[
  {
    "Title": "Message of Hon. Prime Minister on the 35th SAARC Charter Day on 8 December 2019",
    "Date": "08.12.2019",
    "Link": "https://mfa.gov.lk/en/hon-pm-eng/",
    "Summary": "",
    "Category": "News From Other Sources"
  },
  {
    "Title": "Message of H.E the President on the 35th SAARC Charter Day on 8 December 2019",
    "Date": "08.12.2019",
    "Link": "https://mfa.gov.lk/en/h-e-the-president-eng/",
    "Summary": "",
    "Category": "News From Other Sources"
  },
  {
    "Title": "The Financial Action Task Force delisted Sri Lanka from the Grey List",
    "Date": "22.10.2019",
    "Link": "https://mfa.gov.lk/en/delisted-sl-grey-list-eng/",
    "Summary": "",
    "Category": "News From Other Sources"
  },
  {
    "Title": "Sri Lanka’s ability to uphold free and fair election process has been commendable – Netherlands FM",
    "Date": "20.10.2019",
    "Link": "https://mfa.gov.lk/en/sri-lankas-ability-to-uphold-free-and-fair-election-process-has-been-commendable-netherlands-fm/",
    "Summary": "The Netherlands Foreign Affairs Minister, Stef Blok, praised Sri Lanka for successfully conducting free and fair elections despite facing numerous challenges. Several democratic countries have also commended Sri Lanka's commendable efforts in upholding the election process.",
    "Category": "News From Other Sources"
  },
  {
    "Title": "A glimmer of hope for MICE Tourism: Global Shapers in Sri Lanka to Host ‘Shape South Asia 2019’",
    "Date": "08.08.2019",
    "Link": "https://mfa.gov.lk/en/a-glimmer-of-hope-for-mice-tourism-global-shapers-in-sri-lanka-to-host-shape-south-asia-2019/",
    "Summary": "The Global Shapers Colombo and Kandy Hubs have successfully secured the opportunity to host 'Shape South Asia 2019,' a regional gathering of Global Shapers in South Asia. The event, scheduled for the second week of October 2019, will bring together 150 delegates to Sri Lanka, offering a promising outlook for MICE tourism in the region.",
    "Category": "News From Other Sources"
  },
  {
    "Title": "Germany charges suspect over 2005 killing of Sri Lanka Foreign Minister – Press Statement by the Federal General Prosecutor of Germany, 24.07.2019",
    "Date": "24.07.2019",
    "Link": "https://mfa.gov.lk/en/press-statement-gba/",
    "Summary": "Germany's Federal Attorney General has charged a suspect with aiding and abetting the 2005 murder of Sri Lanka's Foreign Minister. The suspect is believed to be a member of the foreign terrorist group Liberation Tiger of Tamil Eelam (LTTE).",
    "Category": "News From Other Sources"
  }
]