{
  "columns": [
    "Title",
    "Date",
    "Link",
    "Summary",
    "Category"
  ],
  "rows": [
    [
      "Speech by Foreign Secretary Admiral Prof. Colombage at the ‘International Conference on Business Studies (ICBR 2021)”, organized by the Faculty of Business of University of Moratuwa.",
      "10.12.2021",
      "https://mfa.gov.lk/en/speech-by-foreign-secretary-admiral-prof-colombage-at-the-international-conference-on-business-studies-icbr-2021-organized-by-the-faculty-of-business-of-university-of-moratuwa/",
      "Foreign Secretary Admiral Prof. Colombage delivered a speech at the ‘International Conference on Business Studies (ICBR 2021)’ organized by the Faculty of Business of University of Moratuwa. The full speech can be viewed at https://youtu.be/yqpJda8vy3o, and the complete program is available at https://m.youtube.com/watch?v=hbSiIIjZLQE&feature=youtu.b.",
      "News From Other Sources"
    ],
    [
      "55th Annual Meeting of the Board of Governors in Colombo, Sri Lanka, from 2 to 5 May 2022",
      "07.10.2021",
      "https://mfa.gov.lk/en/55th-annual-meeting-of-the-board-of-governors-in-colombo-sri-lanka-from-2-to-5-may-2022/",
      "The Asian Development Bank (ADB) will host its 55th Annual Meeting of the Board of Governors in Colombo, Sri Lanka, from May 2 to 5, 2022. The theme for the meeting is \"Positioning a climate-resilient green economy for the post COVID-19 world.",
      "News From Other Sources"
    ],
    [
      "The joint press release on completion of stockpile destruction of anti- personnel land mines by Sri Lanka",
      "05.10.2021",
      "https://mfa.gov.lk/en/the-joint-press-release-on-completion-of-stockpile-destruction-of-anti-personnel-land-mines-by-sri-lanka/",
      "Sri Lanka has completed the destruction of its stockpile of anti-personnel landmines, as announced in a joint press release by the Implementation Support Unit (ISU) of the Anti-Personnel Mine Ban Convention (APMBC) and the N.",
      "News From Other Sources"
    ],
    [
      "Sri Lanka as COVID-19 knowledge exchange regional hub – President proposes at UN",
      "23.09.2021",
      "https://mfa.gov.lk/en/president-proposes-at-un/",
      "Sri Lanka's President proposed establishing a Regional Knowledge Hub in Colombo with the WHO to exchange COVID-19 lessons and assist countries in recovery efforts. The hub aims to support nations in building back better post-pandemic.",
      "News From Other Sources"
    ],
    [
      "Book on Rehabilitation of Ex-Combatants by Bureau of the Commissioner General of Rehabilitation and Department of Government Information",
      "08.07.2021",
      "https://mfa.gov.lk/en/book-on-rehabilitation-of-ex-combatants-by-bureau-of-the-commissioner-general-of-rehabilitation-and-department-of-government-information/",
      "",
      "News From Other Sources"
    ],
    [
      "Statement of Lord Naseby at the Debate on the Queen’s Speech at the House of Lords, 19 May 2021",
      "20.05.2021",
      "https://mfa.gov.lk/en/statement-lord-naseby/",
      "Lord Naseby welcomed the gracious Speech at the House of Lords debate on the Queen's Speech on May 19, 2021. He focused on the topic of global Britain, particularly the Indo-Pacific tilt, drawing from his personal experience of living and working in India, Pakistan, and Sri Lanka.",
      "News From Other Sources"
    ]
  ]
}