[
  {
    "Title": "Temporary Closure of Identified Sri Lanka Missions / Posts Overseas: High Commission of Sri Lanka in Abuja/Nigeria, Consulate General of Sri Lanka in Frankfurt/Germany, Consulate General of Sri Lanka in Nicosia/Cyprus",
    "Date": "27.12.2021",
    "Link": "https://mfa.gov.lk/en/temporary-closure-sl-missions/",
    "Summary": "The Foreign Ministry has decided to temporarily close three of its Missions/Posts overseas: the High Commission of Sri Lanka in Abuja, Nigeria; the Consulate General of Sri Lanka in Frankfurt, Germany; and the Consulate General of Sri Lanka in Nicosia, Cyprus.",
    "Category": "Ministry News"
  },
  {
    "Title": "The message of H.E. Gotabaya Rajapaksa President of Sri Lanka for Christmas 2021",
    "Date": "25.12.2021",
    "Link": "https://mfa.gov.lk/en/the-message-of-h-e-gotabaya-rajapaksa-president-of-sri-lanka-for-christmas-2021/",
    "Summary": "Sri Lankan President Gotabaya Rajapaksa delivered a Christmas message for 2021. The message was shared on WhatsApp and included greetings for the occasion.",
    "Category": "Ministry News"
  },
  {
    "Title": "​MoU between Sri Lanka and Iran ‘Tea for Oil’ Barter Arrangement",
    "Date": "24.12.2021",
    "Link": "https://mfa.gov.lk/en/mou-iran-sl/",
    "Summary": "Sri Lanka and Iran signed a Memorandum of Understanding (MoU) for a 'Tea for Oil' barter arrangement. The agreement was between the Ministry of Plantation of Sri Lanka and the Ministry of Industries, Mine, and Trade of Iran.",
    "Category": "Ministry News"
  },
  {
    "Title": "Social media reports on a Sri Lankan national in Kuwait",
    "Date": "23.12.2021",
    "Link": "https://mfa.gov.lk/en/social-media-reports-kuwait/",
    "Summary": "The Sri Lanka Embassy in Kuwait is aware of circulating social media video clips involving Sri Lankan national Krishnan Siriyanie Chandralatha. The embassy is investigating the matter to gather and provide necessary assistance.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Foreign Minister Peiris meets Envoys of 17 countries after their presentation of credentials",
    "Date": "23.12.2021",
    "Link": "https://mfa.gov.lk/en/fm-sl-envoys-17-countries/",
    "Summary": "Foreign Minister Prof. G. L Peiris met with newly appointed envoys from 17 countries at the Foreign Ministry on December 22. The meeting took place after the envoys presented their credentials to President Gotabaya Rajapaksa. This engagement aimed to strengthen diplomatic relations between Sri Lanka and the represented countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Appointment of Ambassador of the Kingdom of Spain to Sri Lanka",
    "Date": "23.12.2021",
    "Link": "https://mfa.gov.lk/en/ambassador-spain/",
    "Summary": "The Government of the Kingdom of Spain, in agreement with the Government of Sri Lanka, has appointed Mr. Jose Maria Dominguez as the new Ambassador Extraordinary and Plenipotentiary of Spain to Sri Lanka. Mr. Dominguez will represent Spain in his new role in Sri Lanka.",
    "Category": "Ministry News"
  },
  {
    "Title": "Appointment of Ambassador of the Republic of Tunisia to Sri Lanka",
    "Date": "23.12.2021",
    "Link": "https://mfa.gov.lk/en/ambassador-tunisia/",
    "Summary": "The Government of the Republic of Tunisia, with the approval of the Government of Sri Lanka, has appointed Ms. Hayet Talbi Bilel as the Ambassador Extraordinary and Plenipotentiary of the Republic of Tunisia to Sri Lanka. Ms. Bilel will represent Tunisia in Sri Lanka in her new role.",
    "Category": "Ministry News"
  },
  {
    "Title": "Appointment of Ambassador of the Republic of Slovenia to Sri Lanka",
    "Date": "23.12.2021",
    "Link": "https://mfa.gov.lk/en/ambassador-slovenia/",
    "Summary": "The Government of the Republic of Slovenia, with the approval of the Government of Sri Lanka, has appointed Ms. Mateja Ghosh as the Ambassador Extraordinary and Plenipotentiary of the Republic of Slovenia to Sri Lanka. Ms. Ghosh will represent Slovenia in Sri Lanka in her new diplomatic role.",
    "Category": "Ministry News"
  },
  {
    "Title": "Appointment of the High Commissioner of the Republic of Sierra Leone to Sri Lanka",
    "Date": "23.12.2021",
    "Link": "https://mfa.gov.lk/en/high-commissioner-sierra-leone/",
    "Summary": "The Government of the Republic of Sierra Leone, with the approval of the Government of Sri Lanka, has named Mr. Ernest Mbaimba Ndomahina as the inaugural High Commissioner of Sierra Leone to Sri Lanka.",
    "Category": "Ministry News"
  },
  {
    "Title": "Appointment of the High Commissioner of the Federal Republic of Nigeria to Sri Lanka",
    "Date": "23.12.2021",
    "Link": "https://mfa.gov.lk/en/high-commissioner-nigeria/",
    "Summary": "Mr. Ahmed Sule has been appointed as the High Commissioner of the Federal Republic of Nigeria to Sri Lanka, based in New. The appointment was made with the concurrence of the Government of Sri Lanka.",
    "Category": "Ministry News"
  },
  {
    "Title": "Appointment of the High Commissioner of the of Republic of Rwanda to Sri Lanka",
    "Date": "23.12.2021",
    "Link": "https://mfa.gov.lk/en/high-commissioner-rwanda/",
    "Summary": "The Government of Rwanda, in agreement with Sri Lanka, has appointed Ms. Mukangira Jacqueline as the High Commissioner of Rwanda to Sri Lanka. She will be based in New Delhi.",
    "Category": "Ministry News"
  },
  {
    "Title": "Appointment of Ambassador of the Islamic Republic of Mauritania to Sri Lanka",
    "Date": "23.12.2021",
    "Link": "https://mfa.gov.lk/en/ambassador-mauritania/",
    "Summary": "The Government of the Islamic Republic of Mauritania, with the approval of the Government of Sri Lanka, has named Mr. Muhammad Ahmad Rara as the Ambassador Extraordinary and Plenipotentiary to Sri Lanka. Mr. Rara will represent Mauritania in his new role.",
    "Category": "Ministry News"
  },
  {
    "Title": "Appointment of the High Commissioner of the Republic of Malta to Sri Lanka",
    "Date": "23.12.2021",
    "Link": "https://mfa.gov.lk/en/high-commissioner-malta/",
    "Summary": "The Government of the Republic of Malta, in agreement with the Government of Sri Lanka, has named Mr. Reuben Gauci as the High Commissioner of Malta to Sri Lanka. He will be stationed in New Delhi for his diplomatic role.",
    "Category": "Ministry News"
  },
  {
    "Title": "Appointment of Ambassador of the Hashemite Kingdom of Jordan to Sri Lanka",
    "Date": "23.12.2021",
    "Link": "https://mfa.gov.lk/en/ambassador-jordan/",
    "Summary": "The Government of the Hashemite Kingdom of Jordan, with the agreement of Sri Lanka, has named Mr. Mohammed El-Kayed as the new Ambassador Extraordinary and Plenipotentiary to Sri Lanka. He will represent Jordan in diplomatic matters between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Appointment of Ambassador of the Dominican Republic to Sri Lanka",
    "Date": "23.12.2021",
    "Link": "https://mfa.gov.lk/en/ambassador-dominican-rep/",
    "Summary": "The Government of the Dominican Republic, with the agreement of the Government of Sri Lanka, has appointed Mr. David Emmanuel Puig as the Ambassador Extraordinary and Plenipotentiary of the Dominican Republic to Sri Lanka. Mr. Puig will represent the Dominican Republic in Sri Lanka in his new role.",
    "Category": "Ministry News"
  },
  {
    "Title": "Appointment of Ambassador of Democratic People’s Republic of Korea to Sri Lanka",
    "Date": "23.12.2021",
    "Link": "https://mfa.gov.lk/en/ambassador-korea/",
    "Summary": "The Government of the Democratic People’s Republic of Korea, with the concurrence of Sri Lanka, has appointed Mr. Choe Hui Chol as the Ambassador Extraordinary and Plenipotentiary to Sri Lanka. Mr. Chol will represent the Democratic People’s Republic of Korea in Sri Lanka.",
    "Category": "Ministry News"
  },
  {
    "Title": "Appointment of Ambassador of the Republic of Indonesia to Sri Lanka",
    "Date": "23.12.2021",
    "Link": "https://mfa.gov.lk/en/ambassador-indonesia/",
    "Summary": "The Government of the Republic of Indonesia, with the concurrence of Sri Lanka, has appointed Ms. Dewi Gustina Tobing as the new Ambassador Extraordinary and Plenipotentiary of Indonesia to Sri Lanka. Ms. Tobing will represent Indonesia in diplomatic relations with Sri Lanka.",
    "Category": "Ministry News"
  },
  {
    "Title": "Appointment of Ambassador of the Arab Republic of Egypt to Sri Lanka",
    "Date": "23.12.2021",
    "Link": "https://mfa.gov.lk/en/ambassador-egypt/",
    "Summary": "The Government of the Arab Republic of Egypt, with the approval of the Government of Sri Lanka, has named Mr. Maged Mosleh as the new Ambassador Extraordinary and Plenipotentiary of Egypt to Sri Lanka. Mr. Mosleh will represent Egypt in Sri Lanka in his diplomatic capacity.",
    "Category": "Ministry News"
  },
  {
    "Title": "Appointment of the High Commissioner of the Cooperative Republic of Guyana to Sri Lanka",
    "Date": "22.12.2021",
    "Link": "https://mfa.gov.lk/en/hc-guyana/",
    "Summary": "The Government of the Cooperative Republic of Guyana, with the agreement of the Government of Sri Lanka, has named Mr. Charrandass Persaud as the High Commissioner of Guyana to Sri Lanka. This appointment strengthens diplomatic relations between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Appointment of Ambassador of Hungary to Sri Lanka",
    "Date": "22.12.2021",
    "Link": "https://mfa.gov.lk/en/ambassador-hungary/",
    "Summary": "Hungary has appointed Mr. Andras Laszlo Kiraly as its Ambassador to Sri Lanka, with the approval of the Sri Lankan government. He will serve as the Ambassador Extraordinary and Plenipotentiary of Hungary to Sri Lanka, based in New Delhi.",
    "Category": "Ministry News"
  },
  {
    "Title": "Appointment of the High Commissioner of the of Republic of Botswana to Sri Lanka",
    "Date": "22.12.2021",
    "Link": "https://mfa.gov.lk/en/hc-botswana/",
    "Summary": "The Government of Botswana, with the approval of Sri Lanka, has named Mr. Gilbert Shimane Mangole as the new High Commissioner of Botswana to Sri Lanka. Mr. Mangole will be based in New Delhi for his diplomatic duties.",
    "Category": "Ministry News"
  },
  {
    "Title": "Appointment of Ambassador of the Argentine Republic to Sri Lanka",
    "Date": "22.12.2021",
    "Link": "https://mfa.gov.lk/en/argentine-ambassador/",
    "Summary": "The Government of the Argentine Republic, in agreement with the Government of Sri Lanka, has named Mr. Hugo Javier Gobbi as the new Ambassador Extraordinary and Plenipotentiary of the Argentine Republic to Sri Lanka. Mr. Gobbi will represent Argentina in diplomatic matters in Sri Lanka.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Australian Home Minister holds wide ranging talks with the Foreign Minister Peiris",
    "Date": "21.12.2021",
    "Link": "https://mfa.gov.lk/en/australian-hm-fm-sl/",
    "Summary": "Australian Home Affairs Minister Karen Andrews held extensive discussions with Sri Lanka's Foreign Minister Prof. G.L. Peiris during her official visit on December 20, 2021. The talks focused on exploring opportunities for increased cooperation between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Prof. G. L. Peiris discusses progress in achieving Sustainable Development Goals with UN Assistant Secretary General Kanni Wignaraja",
    "Date": "19.12.2021",
    "Link": "https://mfa.gov.lk/en/fm-with-kanni-wignaraja/",
    "Summary": "Foreign Minister Prof. G. L. Peiris discussed progress in achieving Sustainable Development Goals with UN Assistant Secretary General Kanni Wignaraja, who is also the United Nations Development Programme (UNDP) Assistant Administrator and Director of the UNDP Regional Bureau for Asia and the Pacific. Their meeting focused on collaborative efforts towards sustainable development goals.",
    "Category": "Ministry News"
  },
  {
    "Title": "​The High Commissioner of India meets Foreign Minister",
    "Date": "16.12.2021",
    "Link": "https://mfa.gov.lk/en/india-hc-fm-sl/",
    "Summary": "The High Commissioner of India to Sri Lanka, Gopal Baglay, met with Foreign Minister Prof. G.L. Peiris at the Foreign Ministry to discuss the progress of ongoing bilateral engagements between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Peiris hands over a financial grant to the family of  late Priyantha Kumara",
    "Date": "15.12.2021",
    "Link": "https://mfa.gov.lk/en/fm-priyantha-kumara/",
    "Summary": "Foreign Minister Prof. G.L Peiris handed over a financial grant to the family of late Priyantha Kumara, who was brutally killed by a mob in Sialkot, Pakistan. The event took place at the Foreign Ministry today, offering support to the grieving family.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Foreign Minister G.L. Peiris hosts Year-end Christmas reception 2021",
    "Date": "15.12.2021",
    "Link": "https://mfa.gov.lk/en/fm-hosts-recepetion/",
    "Summary": "Foreign Minister G.L. Peiris hosted a Year-end Christmas reception on December 12, 2021, at the Hilton Colombo. The event was attended by Heads of Missions of the Diplomatic Corps based in Colombo, Cabinet Ministers, MPs, and senior government officials.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Polish Ambassador calls on Foreign Minister",
    "Date": "11.12.2021",
    "Link": "https://mfa.gov.lk/en/polish-ambassador-fm-sl/",
    "Summary": "Polish Ambassador Adam Burakowski, also accredited to Sri Lanka, met with Foreign Minister Prof. G.L. Peiris on December 8, 2021, at the Foreign Ministry to discuss mutual interests.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Foreign Minister G. L. Peiris reassures commitment of Sri Lanka to BIMSTEC during the visit of Secretary General of BIMSTEC Tenzin Lekphell",
    "Date": "10.12.2021",
    "Link": "https://mfa.gov.lk/en/bimstec-fm-sl/",
    "Summary": "During the visit of BIMSTEC Secretary General Tenzin Lekphell, Sri Lanka's Foreign Minister G. L. Peiris reaffirmed the country's commitment to BIMSTEC. The Secretary General briefed the Foreign Minister during a courtesy call.",
    "Category": "Ministry News"
  },
  {
    "Title": "Speech for Hon. Foreign Minister (Head of Delegation) 2021 Seoul UN Peacekeeping Ministerial 7-8 December, 2021. Session I: Sustaining Peace",
    "Date": "09.12.2021",
    "Link": "https://mfa.gov.lk/en/speech-for-hon-foreign-minister-head-of-delegation-2021-seoul-un-peacekeeping-ministerial-7-8-december-2021-session-i-sustaining-peace/",
    "Summary": "At the 2021 Seoul UN Peacekeeping Ministerial on December 7-8, H.E. Chung Eui-yong, Minister of Foreign Affairs of the Republic of Korea, delivered a speech on sustaining peace. He expressed appreciation to attendees and emphasized the importance of collaborative efforts in maintaining global peace.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister discusses with the Pakistan envoy in Sri Lanka matters relating to financial security of the family of late Priyantha Kumara",
    "Date": "09.12.2021",
    "Link": "https://mfa.gov.lk/en/fm-pakistan-env/",
    "Summary": "Foreign Minister Prof. G L Peiris met with Pakistan's Acting High Commissioner Tanvir Ahmad in Colombo to discuss financial security for the family of the late Priyantha Kumara. They deliberated on matters related to compensation during the meeting.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Prof. Peiris discusses  Energy  Security, Increased Employment Opportunities with UAE Foreign Minister",
    "Date": "07.12.2021",
    "Link": "https://mfa.gov.lk/en/fm-sl-uae-fm/",
    "Summary": "Foreign Minister Prof. G. L. Peiris discussed energy security and increased employment opportunities with UAE Foreign Minister Sheikh Abdulla Bin Zayed Al Nahyan at the 5th Indian Ocean Conference – IOC 2021. The meeting took place on the sidelines of the conference.",
    "Category": "Ministry News"
  },
  {
    "Title": "Minister of External Affairs of India calls on Foreign Minister Prof. G. L. Peiris",
    "Date": "06.12.2021",
    "Link": "https://mfa.gov.lk/en/fm-sl-india-moea/",
    "Summary": "Foreign Minister Prof. G. L. Peiris met with Minister of External Affairs of India Dr. S. Jaishankar at the 5th Indian Ocean Conference in Abu Dhabi. They discussed bilateral relations between Sri Lanka and India during the meeting.",
    "Category": "Ministry News"
  },
  {
    "Title": "The human remains of   Diyawadanage Don Nandasiri Priyantha Kumara to be brought to Sri Lanka tomorrow",
    "Date": "05.12.2021",
    "Link": "https://mfa.gov.lk/en/human-remains-priyantha-kumara/",
    "Summary": "The human remains of Diyawadanage Don Nandasiri Priyantha Kumara, who was killed by a mob in Sialkot, Pakistan on December 3, 2021, will be brought to Sri Lanka on December 6, 2021, via Sri Lankan Airlines.",
    "Category": "Ministry News"
  },
  {
    "Title": "Swedish Ambassador calls on Foreign Minister",
    "Date": "05.12.2021",
    "Link": "https://mfa.gov.lk/en/swedish-amb-calls-fm/",
    "Summary": "Swedish Ambassador Klas Molin, concurrently accredited to Sri Lanka from New Delhi, met with Foreign Minister Prof. G.L. Peiris on December 2, 2021. They discussed matters of mutual interest at the Foreign Ministry.",
    "Category": "Ministry News"
  },
  {
    "Title": "Ambassador of Japan to Sri Lanka MIZUKOSHI Hideaki called on Foreign Minister Prof. G.L. Peiris",
    "Date": "03.12.2021",
    "Link": "https://mfa.gov.lk/en/japan-fm-sl/",
    "Summary": "The newly appointed Japanese Ambassador to Sri Lanka, MIZUKOSHI Hideaki, paid a courtesy call on Foreign Minister Prof. G.L. Peiris on 30 November 2021. The Foreign Minister warmly welcomed the new Ambassador, strengthening diplomatic ties between Japan and Sri Lanka.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka Missions to Accelerate Tourism Promotion",
    "Date": "02.12.2021",
    "Link": "https://mfa.gov.lk/en/sl-missions-toursm/",
    "Summary": "Sri Lanka's Foreign Minister Prof. G.L. Peiris, Tourism Minister Prasanna Ranatunga, and State Minister Tharaka Balasuriya addressed the country's Heads of Mission abroad to boost tourism promotion efforts. The officials discussed strategies to accelerate tourism promotion during the meeting.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister G.L. Peiris hosts working dinner for Ambassadors of Islamic States",
    "Date": "02.12.2021",
    "Link": "https://mfa.gov.lk/en/islamic-states-fm-sl/",
    "Summary": "Foreign Minister G.L. Peiris hosted a working dinner for the Ambassadors of Islamic States in Colombo on 30 November, with Prime Minister Mahinda Rajapaksa as the Guest of Honour. The event aimed to strengthen diplomatic ties and cooperation between Sri Lanka and the Islamic countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "United Nations Special Rapporteur calls on Foreign Minister",
    "Date": "01.12.2021",
    "Link": "https://mfa.gov.lk/en/un-fm-sl/",
    "Summary": "The United Nations Special Rapporteur on Contemporary Forms of Slavery, Tomoya Obokata, is visiting Sri Lanka at the government's invitation. He has called on the Foreign Minister during his visit.",
    "Category": "Ministry News"
  },
  {
    "Title": "Ambassador Unambuwe presents Credentials to President Pendarovski of the Republic of North Macedonia",
    "Date": "30.11.2021",
    "Link": "https://mfa.gov.lk/en/ambassador-unambuwe-presents-credentials-to-president-pendarovski-of-the-republic-of-north-macedonia/",
    "Summary": "Ambassador of Sri Lanka to Germany, Manori Unambuwe, presented her Letters of Credence to President Stevo Pendarovski of North Macedonia, officially accrediting her as the Ambassador Extraordinary and Plenipotentiary. This formalizes her role as the ambassador representing Sri Lanka in North Macedonia.",
    "Category": "Ministry News"
  },
  {
    "Title": "Permanent Representative of Sri Lanka Ambassador C. A. Chaminda I. Colonne presents Letters of Credence to the United Nations Economic and Social Commission for Asia and the Pacific (UNESCAP)",
    "Date": "30.11.2021",
    "Link": "https://mfa.gov.lk/en/permanent-representative-of-sri-lanka-ambassador-c-a-chaminda-i-colonne-presents-letters-of-credence-to-the-united-nations-economic-and-social-commission-for-asia-and-the-pacific-unescap/",
    "Summary": "Ambassador C. A. Chaminda I. Colonne, the Permanent Representative of Sri Lanka to the United Nations Economic and Social Commission for Asia and the Pacific (UNESCAP), presented his Letters of Credence. This formalized his role in representing Sri Lanka at UNESCAP.",
    "Category": "Ministry News"
  },
  {
    "Title": "Chargé d’affaires of the United Arab Emirates to Sri Lanka Ibrahim Ali Ibrahim Al Gergawi calls on Foreign Minister of Sri Lanka Prof. G.L. Peiris",
    "Date": "28.11.2021",
    "Link": "https://mfa.gov.lk/en/charge-daffaires-uae-fm-sl/",
    "Summary": "Chargé d'affaires of the United Arab Emirates to Sri Lanka, Ibrahim Ali Ibrahim Al Gergawi, met with Sri Lanka's Foreign Minister Prof. G.L. Peiris on November 26, 2021. During the meeting, the Chargé d'affaires conveyed greetings from the Minister of Foreign Affairs.",
    "Category": "Ministry News"
  },
  {
    "Title": "Dutch Ambassador presents “Orange the World” Banner to Foreign Minister",
    "Date": "27.11.2021",
    "Link": "https://mfa.gov.lk/en/orange-the-world-fm/",
    "Summary": "The Dutch Ambassador, Tanja Gonggrijp, presented the \"Orange the World\" banner to the Foreign Minister in Colombo to mark the annual \"Orange the World: 16 Days of Activism against Gender-Based Violence\" campaign.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister stresses importance of collaboration at University of Colombo Annual Research Symposium 2021",
    "Date": "26.11.2021",
    "Link": "https://mfa.gov.lk/en/fm-research-symposium-2021/",
    "Summary": "Foreign Minister Prof. G. L. Peiris emphasized the importance of collaboration at the University of Colombo Annual Research Symposium 2021, where he was the Special Guest on November 23. The symposium gathered distinguished academics to share their research findings and insights.",
    "Category": "Ministry News"
  },
  {
    "Title": "United Nations ASG Khaled Khiari calls on Foreign Minister",
    "Date": "24.11.2021",
    "Link": "https://mfa.gov.lk/en/unasg-fm-sl/",
    "Summary": "United Nations Assistant-Secretary-General Khaled Khiari, visiting Sri Lanka, met with Foreign Minister Prof G.L. Peiris on Tuesday.",
    "Category": "Ministry News"
  },
  {
    "Title": "Italian Ambassador calls on Foreign Minister",
    "Date": "23.11.2021",
    "Link": "https://mfa.gov.lk/en/italy-ambassdor-fm-sl/",
    "Summary": "The Ambassador of Italy to Sri Lanka, Rita Manella, met with Foreign Minister Prof. G.L. Peiris on November 22, 2021, at the Foreign Ministry. The discussion centered on mutual interests, including political relations. The meeting aimed to strengthen ties between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka High Commission in Singapore facilitates donation of Covid-19 medical equipment",
    "Date": "23.11.2021",
    "Link": "https://mfa.gov.lk/en/donation-singapore/",
    "Summary": "The Sri Lanka High Commission in Singapore helped facilitate a donation of 50 BiPAP machines and 8 ventilators from the Temasek Foundation of Singapore to support Sri Lanka's COVID-19 containment efforts. This donation aims to bolster Sri Lanka's healthcare system during the pandemic.",
    "Category": "Ministry News"
  },
  {
    "Title": "Public Notice",
    "Date": "21.11.2021",
    "Link": "https://mfa.gov.lk/en/public-notice/",
    "Summary": "The Ministry of Foreign Affairs is seeking the public's assistance in locating close relatives or acquaintances of Sri Lankans who have passed away abroad. If you have any information, please come forward to help with the identification process.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka Embassy in Austria facilitates donation of Covid-19 medical equipment",
    "Date": "19.11.2021",
    "Link": "https://mfa.gov.lk/en/covid-19-medical-equipment/",
    "Summary": "The Sri Lanka Embassy in Austria helped coordinate a donation of Covid-19 medical equipment, including rapid antigen test kits and pulse oximeters. The donation was made by the Honorary Consuls of Sri Lanka in Styria and Carinthia in Austria, the Czech Republic, Serbia, and Slovakia.",
    "Category": "Ministry News"
  },
  {
    "Title": "Ambassador N.L Godfrey Cooray presents Credentials to the President of Iceland",
    "Date": "19.11.2021",
    "Link": "https://mfa.gov.lk/en/ambassador-n-l-godfrey-cooray-presents-credentials-to-the-president-of-iceland/",
    "Summary": "Ambassador N.L. Godfrey Cooray presented his Letter of Credence to President Guðni Th. Jóhannesson of Iceland at a ceremony on November 10, 2021, in Reykjavík. The ceremony took place at the office of the President of Iceland, accrediting Ambassador Cooray.",
    "Category": "Ministry News"
  },
  {
    "Title": "“Sri Lanka improved its global ranking in SDGs despite global pandemic”: Foreign Secretary tells the 5th South Asia Forum on Sustainable Development Goals",
    "Date": "19.11.2021",
    "Link": "https://mfa.gov.lk/en/fs-sl-asia-forum/",
    "Summary": "During the 5th South Asia Forum on Sustainable Development Goals in Colombo, Foreign Secretary Admiral Prof. Jayanath Colombage announced that Sri Lanka has enhanced its global ranking in SDGs despite the global pandemic. This positive development was highlighted in his keynote address on Tuesday.",
    "Category": "Ministry News"
  },
  {
    "Title": "Assuming the Vice Chair of IORA Foreign Minister Peiris Calls for Collective Action to Safeguard Maritime Shipping Lanes and Ocean Space from Pollution related Disasters at the 21st Council of Ministers Meeting in Dhaka",
    "Date": "18.11.2021",
    "Link": "https://mfa.gov.lk/en/vice-chair-iora-fm-sl/",
    "Summary": "Foreign Minister Prof. G. L. Peiris assumed the Vice-Chair position of the Indian Ocean Rim Association at the 21st Council of Ministers Meeting in Dhaka. He called for collective action to safeguard maritime shipping lanes and ocean space from pollution-related disasters.",
    "Category": "Ministry News"
  },
  {
    "Title": "Seva Vanitha Unit of Sri Lanka Mission in Geneva donates Covid-19 medical equipment",
    "Date": "18.11.2021",
    "Link": "https://mfa.gov.lk/en/seva-vanitha-geneva-donates/",
    "Summary": "The Seva Vanitha Unit of the Sri Lanka Mission in Geneva, with the support of staff members and spouses, raised funds through various activities and donated 8 Oxygen Concentrators for government use in combating Covid-19.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister G. L. Peiris calls on Prime Minister of Bangladesh",
    "Date": "18.11.2021",
    "Link": "https://mfa.gov.lk/en/fm-sl-pm-bangladesh/",
    "Summary": "Sri Lankan Foreign Minister Prof. G. L. Peiris met with Prime Minister Sheikh Hasina at her office in Dhaka, Bangladesh. During the meeting, Prof. Peiris briefed the Prime Minister on Sri Lanka's successful initiatives.",
    "Category": "Ministry News"
  },
  {
    "Title": "Donation to Itukama Covid-19 Healthcare and Social Security Fund from Philippines",
    "Date": "17.11.2021",
    "Link": "https://mfa.gov.lk/en/itukama-from-philippines/",
    "Summary": "Philippine businessman William Chen, a friend of Sri Lanka, donated $20,000 (approximately Rs. 4 million) to the Itukama Covid-19 Healthcare and Social Security Fund. The generous contribution aims to support the country's efforts in combating the pandemic.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Peiris discusses further collaboration in shipping sector with Bangladesh",
    "Date": "17.11.2021",
    "Link": "https://mfa.gov.lk/en/fm-bangladesh-shipping/",
    "Summary": "Foreign Minister Prof G.L. Peiris discussed further collaboration in the shipping sector with State Minister of Shipping Khalid Mahmud Chowdhury of Bangladesh on November 16. This meeting followed his previous discussion with Bangladesh's Foreign Minister Dr. to strengthen ties between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "US DASS Kelly Keiderling reviews bilateral ties with the Foreign Secretary",
    "Date": "16.11.2021",
    "Link": "https://mfa.gov.lk/en/fs-us-dass/",
    "Summary": "US Deputy Assistant Secretary of State for Public Diplomacy, Ambassador Kelly Keiderling, reviewed bilateral ties with the Foreign Secretary. The discussions covered a wide range of topics related to bilateral relations and cooperation between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Appointment of Ambassador of the Kingdom of Thailand to Sri Lanka",
    "Date": "16.11.2021",
    "Link": "https://mfa.gov.lk/en/thailand-to-sl/",
    "Summary": "The Government of Thailand, with the approval of Sri Lanka, has named Mr. Poj Harnpol as the new Ambassador Extraordinary and Plenipotentiary to Sri Lanka. Mr. Harnpol will represent Thailand in diplomatic matters in Sri Lanka.",
    "Category": "Ministry News"
  },
  {
    "Title": "Appointment of the High Commissioner of the Republic of South Africa to Sri Lanka",
    "Date": "16.11.2021",
    "Link": "https://mfa.gov.lk/en/south-africa-to-sl/",
    "Summary": "The Government of the Republic of South Africa, with the approval of the Government of Sri Lanka, has appointed Mr. Sandile Edwin Schalk as the High Commissioner of the Republic of South Africa to Sri Lanka. Mr. Schalk will serve in this role in Succes.",
    "Category": "Ministry News"
  },
  {
    "Title": "Appointment of Ambassador of Japan to Sri Lanka",
    "Date": "16.11.2021",
    "Link": "https://mfa.gov.lk/en/japan-to-sl/",
    "Summary": "The Government of Japan, with the approval of the Government of Sri Lanka, has appointed Mr. Hideaki Mizukoshi as the new Ambassador Extraordinary and Plenipotentiary of Japan to Sri Lanka, succeeding H.E. Akira Sug.",
    "Category": "Ministry News"
  },
  {
    "Title": "Germany donates 300,000 Rapid Antigen Test Kits",
    "Date": "16.11.2021",
    "Link": "https://mfa.gov.lk/en/germany-donates/",
    "Summary": "The Ministry of Social Affairs, Health, and Integration of the German State of Baden-Württemberg donated 300,000 German-manufactured Rapid Antigen Test Kits to support Sri Lanka's efforts in containing COVID-19. This donation aims to bolster Sri Lanka's testing capabilities and enhance its response to the pandemic.",
    "Category": "Ministry News"
  },
  {
    "Title": "BIMSTEC Secretary General Tenzin Lekphell pays a Courtesy Call on Foreign Minister Peiris in Dhaka",
    "Date": "16.11.2021",
    "Link": "https://mfa.gov.lk/en/bimstec-secretary-fm-sl/",
    "Summary": "BIMSTEC Secretary General Tenzin Lekphell paid a courtesy call on Foreign Minister Prof. G.L. Peiris in Dhaka. They discussed matters related to the Bay of Bengal Initiative for Multi Sectoral Technical and Economic Cooperation (BIMSTEC).",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Peiris meets Foreign Minister of Bangladesh",
    "Date": "15.11.2021",
    "Link": "https://mfa.gov.lk/en/fm-sl-bangladesh-2/",
    "Summary": "Foreign Minister Prof. G.L. Peiris met with Bangladesh's Foreign Minister Dr. A.K. Abdul Momen at the State Guest House Padma in Dhaka on November 15. During the meeting, Foreign Minister Peiris recalled the visit of Prime Minister Mahin.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister G.L. Peiris to attend 21st Meeting of IORA Council of Ministers in Dhaka",
    "Date": "14.11.2021",
    "Link": "https://mfa.gov.lk/en/fm-sl-dhaka-iora/",
    "Summary": "Foreign Minister G.L. Peiris will visit Dhaka, Bangladesh from November 15 to 18, 2021, to attend the 21st Meeting of the Indian Ocean Rim Association (IORA) Council of Ministers.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka brings the importance of sustainable nitrogen management to the climate change discourse",
    "Date": "12.11.2021",
    "Link": "https://mfa.gov.lk/en/sl-nitrogen4netzero/",
    "Summary": "Sri Lanka's Foreign Ministry hosted an event titled 'Rediscovering Nitrogen: Solution synergies for climate change, health, biodiversity, and circular economy' in collaboration with the International Nitrogen Management System. The event aimed to highlight the significance of sustainable nitrogen management in addressing climate change and promoting environmental sustainability.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister bids farewell to Ambassador of Japan",
    "Date": "10.11.2021",
    "Link": "https://mfa.gov.lk/en/fm-sl-ambassador-japan/",
    "Summary": "Foreign Minister Prof. G.L. Peiris bid farewell to Ambassador Akira Sugiyama of Japan at the Foreign Ministry today. The Minister highlighted the strong and multifaceted relations between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Ambassador Manori Unambuwe Presents Credentials to the President of the Republic of Montenegro",
    "Date": "09.11.2021",
    "Link": "https://mfa.gov.lk/en/ambassador-manori-unambuwe-presents-credentials-to-the-president-of-the-republic-of-montenegro/",
    "Summary": "Ambassador Manori Unambuwe presented her Letters of Credence to President Milo Đukanović of Montenegro at the Presidential Palace in Cetinje, officially accrediting her as the Ambassador Extraordinary and Plenipotentiary. This ceremony marks the beginning of her diplomatic mission in Montenegro.",
    "Category": "Ministry News"
  },
  {
    "Title": "The Royal Audience and the Presentation of the Letter of Credence  by Ambassador of Sri Lanka to Thailand C.A. Chaminda I. Colonne to the King Maha Vajiralongkorn Phra Vajiraklaochaoyuhua of the Kingdom of Thailand",
    "Date": "08.11.2021",
    "Link": "https://mfa.gov.lk/en/the-royal-audience-and-the-presentation-of-the-letter-of-credence-by-ambassador-of-sri-lanka-to-thailand-c-a-chaminda-i-colonne-to-the-king-maha-vajiralongkorn-phra-vajirak/",
    "Summary": "Ambassador C.A. Chaminda I. Colonne of Sri Lanka presented his Letter of Credence to King Maha Vajiralongkorn Phra Vajiraklaochaoyuhua of Thailand during a Royal Audience. The King graciously received the Ambassador as the official representative of Sri Lanka.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lankan Envoy to Saudi Arabia Presents Copies of Credentials",
    "Date": "05.11.2021",
    "Link": "https://mfa.gov.lk/en/sri-lankan-envoy-to-saudi-arabia-presents-copies-of-credentials/",
    "Summary": "Sri Lankan Ambassador designate P.M. Amza presented copies of credentials to Saudi Arabia's Deputy Minister for Protocol Affairs, Khalid bin Faisal Al Sihly on November 2, 2021, at the Ministry.",
    "Category": "Ministry News"
  },
  {
    "Title": "Message by Gotabaya Rajapaksa, President of Sri Lanka on the occasion of Deepavali",
    "Date": "04.11.2021",
    "Link": "https://mfa.gov.lk/en/president-deepavali/",
    "Summary": "President Gotabaya Rajapaksa of Sri Lanka shared a message on the occasion of Deepavali. The message was conveyed via a WhatsApp image dated November 4, 2021, at 10:03 AM.",
    "Category": "Ministry News"
  },
  {
    "Title": "Speech by President Gotabaya Rajapaksa at the “ World Leaders Summit of COP26″, UN Climate Change Conference, Scotland,  UK | 01 November 2021",
    "Date": "02.11.2021",
    "Link": "https://mfa.gov.lk/en/president-world-leaders-summit-of-cop26/",
    "Summary": "President Gotabaya Rajapaksa emphasized the critical importance of addressing climate change at the \"World Leaders Summit of COP26\" in Scotland. As a developing tropical island nation with rich biodiversity, Sri Lanka is acutely aware of the climate impacts. The speech highlighted the urgent need for global action to combat climate change.",
    "Category": "Ministry News"
  },
  {
    "Title": "Ambassador – designate of Sri Lanka to the Kingdom of Saudi Arabia assumes duties",
    "Date": "02.11.2021",
    "Link": "https://mfa.gov.lk/en/ambassador-designate-of-sri-lanka-to-the-kingdom-of-saudi-arabia-assumes-duties/",
    "Summary": "Ambassador-designate Pakeer Amza assumed duties at the Sri Lankan Embassy in Riyadh on October 31, 2021. The ceremony was organized by the embassy staff to mark the occasion.",
    "Category": "Ministry News"
  },
  {
    "Title": "Speech by President Gotabaya Rajapaksa at the “Rediscovering Nitrogen: Solutions and Synergies for Climate Change, Health, Biodiversity and Circular Economy”, COP26 Side Event, Scotland, UK on 31 October 2021",
    "Date": "01.11.2021",
    "Link": "https://mfa.gov.lk/en/president-cop-26/",
    "Summary": "President Gotabaya Rajapaksa delivered a speech at the COP26 Side Event in Scotland on October 31, 2021, focusing on the importance of addressing climate change. He highlighted the significance of solutions and synergies related to nitrogen in combating climate change, promoting health, biodiversity, and circular economy. The President expressed pleasure in seeing a notable turnout at the event, emphasizing the urgency of tackling the global climate crisis.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Prof G. L. Peiris visits Jesus College, University of Cambridge for discussions",
    "Date": "31.10.2021",
    "Link": "https://mfa.gov.lk/en/fm-sl-visits-uoc/",
    "Summary": "Foreign Minister Prof. G. L. Peiris visited Jesus College, University of Cambridge, to discuss issues concerning Sri Lanka and its future. The discussion included participation from Professor Sir Ivan Lawrence QC.",
    "Category": "Ministry News"
  },
  {
    "Title": "Speech delivered by Foreign Minister Professor G. L. Peiris when Foreign Minister Peiris and the British Prime Minister’s Special Envoy for Trade with Sri Lanka Lord Mervyn Davies of Abersoch jointly inaugurated the Sri Lanka – United Kingdom Chamber of Commerce at the Sri Lankan High Commission in London.",
    "Date": "30.10.2021",
    "Link": "https://mfa.gov.lk/en/fm-british-pm/",
    "Summary": "Foreign Minister Professor G. L. Peiris delivered a speech at the inauguration of the Sri Lanka – United Kingdom Chamber of Commerce in London, alongside British Prime Minister's Special Envoy for Trade with Sri Lanka Lord Mervyn Davies of Abersoch. The event took place at the Sri Lankan High Commission.",
    "Category": "Ministry News"
  },
  {
    "Title": "Final Keynote Address Hon. Tharaka Balasuriya,  State Minister of Regional Cooperation at the  “Youth in Climate Action Virtual Conference”, 29 October 2021",
    "Date": "29.10.2021",
    "Link": "https://mfa.gov.lk/en/final-keynote-address-sm/",
    "Summary": "Hon. Tharaka Balasuriya, State Minister of Regional Cooperation, delivered the final keynote address at the \"Youth in Climate Action Virtual Conference\" on October 29, 2021. Ms. Maryaam Rehman, Director of the British Council, introduced the Minister to the audience.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Prof G. L. Peiris meets the UK Foreign Secretary",
    "Date": "29.10.2021",
    "Link": "https://mfa.gov.lk/en/fm-meets-uk-fs/",
    "Summary": "Foreign Minister Prof. G.L. Peiris met with UK Foreign Secretary Elizabeth Truss on October 26, 2021, at the Foreign, Commonwealth and Development Office in the UK. The meeting aimed to discuss bilateral relations and cooperation between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Consular Services provided by the Foreign Ministry",
    "Date": "29.10.2021",
    "Link": "https://mfa.gov.lk/en/fm-consular-services/",
    "Summary": "The Consular Affairs Division of the Foreign Ministry is currently experiencing a high demand for authentication of certificates and documents from across the country. The division efficiently provides these services to service seekers nationwide.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Prof G. L. Peiris calls on the Speaker of the House of Commons",
    "Date": "28.10.2021",
    "Link": "https://mfa.gov.lk/en/fm-calls-speaker-uk/",
    "Summary": "Foreign Minister Prof. G.L. Peiris met with the Speaker of the House of Commons, Sir Lindsay Hoyle, on October 26, 2021. During the meeting, Minister Prof. Peiris highlighted the historical significance of the Sri Lankan Parliament's establishment.",
    "Category": "Ministry News"
  },
  {
    "Title": "Political Consultations between Sri Lanka and Kingdom Bahrain",
    "Date": "22.10.2021",
    "Link": "https://mfa.gov.lk/en/sl-kingdom-bahrain/",
    "Summary": "Sri Lanka and Bahrain held their first virtual session of Political Consultations today (21 October 2021). The two countries signed an MOU on Political Consultations in 2009.",
    "Category": "Ministry News"
  },
  {
    "Title": "US Ambassador pays farewell call on Foreign Minister",
    "Date": "21.10.2021",
    "Link": "https://mfa.gov.lk/en/us-ambassador-fm/",
    "Summary": "US Ambassador Alaina B. Teplitz paid a farewell visit to Sri Lanka's Foreign Minister Professor G. L. Peiris at the Foreign Ministry. During the meeting, they discussed bilateral relations and cooperation between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Representative of Sri Lanka to the State of Palestine Nawalage Bennet Cooray  presents Credentials to the President of the State of Palestine",
    "Date": "20.10.2021",
    "Link": "https://mfa.gov.lk/en/representative-of-sri-lanka-to-the-state-of-palestine-nawalage-bennet-cooray-presents-credentials-to-the-president-of-the-state-of-palestine/",
    "Summary": "Sri Lanka's Representative to the State of Palestine, Nawalage Bennet Cooray, presented his Letter of Credence to the President of the State of Palestine on October 14, 2021, at the Presidential Palace in Ramallah. This formalized his role as Sri Lanka's official envoy to Palestine.",
    "Category": "Ministry News"
  },
  {
    "Title": "French Ambassador pays courtesy call on Foreign Minister Peiris",
    "Date": "20.10.2021",
    "Link": "https://mfa.gov.lk/en/fm-sl-france/",
    "Summary": "French Ambassador Eric Lavertu paid a courtesy call on Foreign Minister Prof. G. L. Peiris at the Foreign Ministry in Sri Lanka. Both sides expressed satisfaction with the multifaceted cooperation and friendship between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "High Commissioner designate of Sri Lanka to Canada calls on the Chief of Protocol of Canada",
    "Date": "18.10.2021",
    "Link": "https://mfa.gov.lk/en/high-commissioner-designate-of-sri-lanka-to-canada-calls-on-the-chief-of-protocol-of-canada/",
    "Summary": "High Commissioner-designate of Sri Lanka to Canada, Harsha Kumara Navaratne, met with the Chief of Protocol of Canada, Stewart Wheeler, in Ottawa on 15 October 2021. This meeting took place following Navaratne's arrival in Canada on 14 October 2021.",
    "Category": "Ministry News"
  },
  {
    "Title": "Czech Ambassador pays a farewell call on Foreign Minister Peiris",
    "Date": "17.10.2021",
    "Link": "https://mfa.gov.lk/en/czech-fm-sl/",
    "Summary": "Czech Ambassador Milan Hovorka bid farewell to Foreign Minister Prof. G.L. Peiris during a visit to the Foreign Ministry on October 14, 2021. Minister Peiris warmly welcomed the ambassador before his departure.",
    "Category": "Ministry News"
  },
  {
    "Title": "Malaysia and Sri Lanka to enhance cooperation in the fields of digitalization and education",
    "Date": "15.10.2021",
    "Link": "https://mfa.gov.lk/en/malaysia-sl/",
    "Summary": "Malaysia's High Commissioner to Colombo, Tan Yang Thai, visited Sri Lanka's Foreign Minister Prof. G.L. Peiris on October 14, 2021, to discuss enhancing cooperation in digitalization and education. The meeting aimed to strengthen the close and friendly bilateral ties between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka and Algeria discuss enhancement of political and economic ties at first ever bilateral consultations",
    "Date": "14.10.2021",
    "Link": "https://mfa.gov.lk/en/sl-algeria/",
    "Summary": "Sri Lanka and Algeria conducted their inaugural Foreign Ministry Level Virtual Bilateral Consultations on October 12, 2021, aiming to enhance political and economic ties. The discussions centered on strengthening cooperation in political and economic spheres. This meeting marks a significant step towards deepening relations between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka Participates in the 6th Ministerial Meeting of CICA",
    "Date": "13.10.2021",
    "Link": "https://mfa.gov.lk/en/cica-slfs/",
    "Summary": "Sri Lanka's Foreign Secretary Admiral Prof. Jayanath Colombage participated in the 6th Ministerial Meeting of CICA, delivering the country's statement virtually. The meeting focused on foreign affairs and confidence-building measures among member countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Prof. G. L. Peiris addresses the Diplomatic Community at Foreign Ministry",
    "Date": "13.10.2021",
    "Link": "https://mfa.gov.lk/en/fm-sl-diplomatic-community/",
    "Summary": "Foreign Minister Prof. G.L. Peiris addressed the Colombo-based diplomatic community at the Foreign Ministry auditorium on October 13, 2021. The meeting provided an opportunity for the Foreign Minister to engage with the diplomatic community.",
    "Category": "Ministry News"
  },
  {
    "Title": "Ambassador of Sri Lanka to Brazil Sumith Dassanayake presents Credentials to the President of Brazil",
    "Date": "12.10.2021",
    "Link": "https://mfa.gov.lk/en/ambassador-of-sri-lanka-to-brazil-sumith-dassanayake-presents-credentials-to-the-president-of-brazil/",
    "Summary": "Ambassador Sumith Dassanayake of Sri Lanka presented his Letters of Credence to President Jair Bolsonaro at the Palácio Do Planalto in Brasilia, officially assuming his role as Sri Lanka's Ambassador to Brazil.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka and Russia Reaffirm Strong Partnership at Bilateral Political Consultations in Moscow",
    "Date": "11.10.2021",
    "Link": "https://mfa.gov.lk/en/moscow-mfs/",
    "Summary": "Sri Lanka and Russia reaffirmed their strong partnership during the 10th Round of Bilateral Political Consultations held at the Ministry of Foreign Affairs of Russia in Moscow on Friday, October 8, 2021. The consultations aimed to strengthen diplomatic ties between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Prof. G. L. Peiris meets with Canadian High Commissioner David McKinnon",
    "Date": "08.10.2021",
    "Link": "https://mfa.gov.lk/en/fm-sl-canada-hc/",
    "Summary": "Foreign Minister Prof. G.L. Peiris met with Canadian High Commissioner David McKinnon at the Foreign Ministry on 8 October. They discussed various areas of ongoing bilateral cooperation, and the Minister briefed the High Commissioner on relevant matters.",
    "Category": "Ministry News"
  },
  {
    "Title": "Prof. Janitha A. Liyanage assumes duties as the Ambassador of Sri Lanka to Russia",
    "Date": "08.10.2021",
    "Link": "https://mfa.gov.lk/en/prof-janitha-a-liyanage-assumes-duties-as-the-ambassador-of-sri-lanka-to-russia/",
    "Summary": "Prof. Janitha Abeywickrema Liyanage has officially started her role as the Ambassador of Sri Lanka to Russia following a ceremony at the Embassy on October 4, 2021.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Peiris underscores the need to strengthen economic ties with Bangladesh",
    "Date": "08.10.2021",
    "Link": "https://mfa.gov.lk/en/fm-sl-bangladesh/",
    "Summary": "Foreign Minister Prof. G.L. Peiris emphasized the significance of enhancing economic ties with Bangladesh, underscoring Sri Lanka's commitment to strengthening relations, particularly in economic cooperation. He made these remarks during a courtesy call.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Prof. G.L. Peiris co- chairs meeting with Minister Namal Rajapaksa on upgrading the digitalization of Consular Services at the Foreign Ministry",
    "Date": "08.10.2021",
    "Link": "https://mfa.gov.lk/en/fm-upgrading-digitalization/",
    "Summary": "Foreign Minister Prof. G.L. Peiris co-chaired a meeting with Minister Namal Rajapaksa to discuss upgrading the digitalization of Consular Services at the Foreign Ministry. The meeting aimed to enhance the efficiency and accessibility of consular services through digital technology.",
    "Category": "Ministry News"
  },
  {
    "Title": "Singaporeans donate COVID 19 related medical equipment to Sri Lanka",
    "Date": "08.10.2021",
    "Link": "https://mfa.gov.lk/en/singapore-donate-sl/",
    "Summary": "Singaporeans donated COVID-19 related medical equipment to Sri Lanka through the collaboration between the Sri Lanka High Commission in Singapore and the Religious Advisor of the Maha Karuna Buddhist Society of Singapore, Ven. Dr. K. Gunaratana Thero.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka community in Oman donates COVID 19 related medical equipment to Sri Lanka",
    "Date": "07.10.2021",
    "Link": "https://mfa.gov.lk/en/oman-sl/",
    "Summary": "The Sri Lankan community in Oman donated a consignment of medical equipment, including ICU beds, to treat COVID-19 patients in Sri Lanka. The donation was made by the Sri Lankan Quantity Surveyors Fraternity, bankers, and other professionals. This contribution aims to support the country's efforts in combating the pandemic.",
    "Category": "Ministry News"
  },
  {
    "Title": "Korea donates a further consignment of COVID 19 related medical equipment to Sri Lanka",
    "Date": "06.10.2021",
    "Link": "https://mfa.gov.lk/en/korea-sl/",
    "Summary": "The Government of the Republic of Korea, via the Korea International Cooperation Agency (KOICA), donated COVID-19 medical equipment worth USD 450,000 to Sri Lanka. The consignment includes PCR detection kits and 5 PCR machines for rapid testing, aiding Sri Lanka's pandemic response efforts.",
    "Category": "Ministry News"
  },
  {
    "Title": "Providing Consular Services to Public by the Foreign Ministry",
    "Date": "06.10.2021",
    "Link": "https://mfa.gov.lk/en/consular-services-fm/",
    "Summary": "The Consular Affairs Division on the 2nd floor of the Ceylinco Building, under the Foreign Ministry, has resumed providing consular services to walk-in customers while following health guidelines. This service is now available to the public.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka- Saudi Arabia cooperation in multiple spheres emphasized during courtesy call on Foreign Minister G.L. Peiris by the Ambassador of Saudi Arabia",
    "Date": "06.10.2021",
    "Link": "https://mfa.gov.lk/en/saudi-ambassador-fm-sl/",
    "Summary": "During a courtesy call on Foreign Minister G.L. Peiris, Ambassador of Saudi Arabia Abdul Nasser Al Harthy emphasized cooperation between Sri Lanka and Saudi Arabia across various spheres. The meeting took place at the Foreign Ministry on 01 October 2021, where the Foreign Minister warmly welcomed the Ambassador and recalled past collaborations.",
    "Category": "Ministry News"
  },
  {
    "Title": "Egyptian Envoy in Colombo bids farewell",
    "Date": "06.10.2021",
    "Link": "https://mfa.gov.lk/en/egypt-ambassador-fm/",
    "Summary": "Egypt's outgoing Ambassador, Hussein Abdelhamid El Saharty, bid farewell to Foreign Minister Prof. G.L. Peiris at the Foreign Ministry in Colombo on October 1, 2021. The Ambassador acknowledged the contributions made during his tenure.",
    "Category": "Ministry News"
  },
  {
    "Title": "Indian Foreign Secretary Shri Harsh Vardhan Shringla concludes his successful visit to Sri Lanka",
    "Date": "05.10.2021",
    "Link": "https://mfa.gov.lk/en/fs-india-visit-sl/",
    "Summary": "Indian Foreign Secretary Shri Harsh Vardhan Shringla successfully concluded his first official visit to Sri Lanka on October 5, 2021, after engaging in productive bilateral discussions with Sri Lankan dignitaries. The visit spanned three days and aimed to strengthen ties between the two nations.",
    "Category": "Ministry News"
  },
  {
    "Title": "Speech by the Hon. Foreign Minister Prof. G. L. Peiris in Parliament, 5 October 2021",
    "Date": "05.10.2021",
    "Link": "https://mfa.gov.lk/en/speech-fm-parliament/",
    "Summary": "Foreign Minister Prof. G. L. Peiris addressed Parliament on October 5, 2021, highlighting Sri Lanka's international efforts. He discussed the government's response to the pandemic and its actions regarding ecological consequences.",
    "Category": "Ministry News"
  },
  {
    "Title": "Joint Press Release 5th Meeting of the European Union – Sri Lanka Working Group on Good Governance, Rule of Law and Human Rights",
    "Date": "02.10.2021",
    "Link": "https://mfa.gov.lk/en/joint-press-release-eu/",
    "Summary": "The 5th Meeting of the European Union – Sri Lanka Working Group on Good Governance, Rule of Law, and Human Rights convened in Colombo on September 29, 2021. This meeting was part of the ongoing bilateral exchanges between the European Union and Sri Lanka to address governance, rule of law, and human rights issues.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Prof. G.L. Peiris updates incoming EU mission on progress on matters of relevance in EU – Sri Lanka cooperation",
    "Date": "01.10.2021",
    "Link": "https://mfa.gov.lk/en/fm-sl-eu-mission/",
    "Summary": "Foreign Minister Prof. G.L. Peiris updated a five-member EU delegation on the progress of EU-Sri Lanka cooperation during a meeting on Friday, October 1, 2021. He welcomed the constructive and cordial engagement between the two parties.",
    "Category": "Ministry News"
  },
  {
    "Title": "Indian Foreign Secretary to visit Sri Lanka",
    "Date": "01.10.2021",
    "Link": "https://mfa.gov.lk/en/indian-fs-visit-sl/",
    "Summary": "Indian Foreign Secretary Shri Harsh Vardhan Shringla will visit Sri Lanka from 2-5 October 2021 at the invitation of Sri Lankan Foreign Secretary Admiral Prof. Jayanath Colombage. The visit aims to strengthen bilateral ties between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Peiris seeks enhanced market access for Sri Lankan exports in Brazil",
    "Date": "01.10.2021",
    "Link": "https://mfa.gov.lk/en/fm-sl-brazil/",
    "Summary": "Foreign Minister G.L. Peiris has requested increased market access for Sri Lankan export products in Brazil during a meeting with the Brazilian Ambassador to Sri Lanka, Sergi. Peiris aims to enhance opportunities for Sri Lankan exports in the growing Brazilian market.",
    "Category": "Ministry News"
  },
  {
    "Title": "Ambassador of Sri Lanka to the Islamic Republic of Iran Vipulatheja Wishwanath Aponsu presented Letters of Credence in Iran",
    "Date": "30.09.2021",
    "Link": "https://mfa.gov.lk/en/ambassador-of-sri-lanka-to-the-islamic-republic-of-iran-vipulatheja-wishwanath-aponsu-presented-letters-of-credence-in-iran/",
    "Summary": "Ambassador of Sri Lanka to Iran, Vipulatheja Wishwanath Aponsu, presented his Letters of Credence to President Ayatollah Sayyid Ebrahim Raisi at the Sadabad Complex in Iran. The ceremony took place at the Office of the President.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Professor G.L Peiris reiterates support to the Palestine cause during courtesy call by the Palestine Ambassador to Sri Lanka",
    "Date": "30.09.2021",
    "Link": "https://mfa.gov.lk/en/palestine-fm-sl/",
    "Summary": "Foreign Minister Professor G.L Peiris reiterated support for the Palestine cause during a courtesy call by the Palestine Ambassador, Dr. Zuhair M.H. Dar Zaid, at the Foreign Ministry on September 28th. The meeting emphasized the ongoing commitment to the Palestinian cause.",
    "Category": "Ministry News"
  },
  {
    "Title": "New Zealand High Commissioner calls on Foreign Minister Prof. Peiris",
    "Date": "30.09.2021",
    "Link": "https://mfa.gov.lk/en/nzhc-fm-sl/",
    "Summary": "New Zealand's High Commissioner to Sri Lanka, Michael Appleton, visited Foreign Minister Prof. G.L. Peiris at the Foreign Ministry on September 29, 2021, to extend congratulations. The meeting was a courtesy call to discuss bilateral relations between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Myanmar Ambassador calls on the Foreign Minister",
    "Date": "29.09.2021",
    "Link": "https://mfa.gov.lk/en/myanmar-fm-sl/",
    "Summary": "Myanmar Ambassador to Sri Lanka U Han Thu met with Foreign Minister Prof. G.L. Peiris at the Foreign Ministry on 28 September 2021. During the meeting, Ambassador Thu congratulated Prof. Peiris on his recent appointment as the Foreign Minister.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka’s continuing close and cordial relations with the UK is desirable and potentially productive",
    "Date": "29.09.2021",
    "Link": "https://mfa.gov.lk/en/sl-fm-ukhc/",
    "Summary": "Foreign Minister Prof. G.L. Peiris met with UK High Commissioner Sarah Hulton in Colombo for a productive discussion, emphasizing the importance of maintaining close relations between Sri Lanka and the UK. The meeting aimed to strengthen bilateral ties and explore potential areas of cooperation.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka, British Ministers discuss Trade, Investment, and Domestic Reconciliation Process",
    "Date": "26.09.2021",
    "Link": "https://mfa.gov.lk/en/sl-british-ministers/",
    "Summary": "Sri Lanka's Foreign Minister Prof. G. L. Peiris and British Minister of State for South Asia, Lord Ahmad of Wimbledon, recently discussed trade, investment, and the domestic reconciliation process at the Sri Lanka Mission in New York. The meeting aimed to strengthen bilateral ties and cooperation between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Statement by H.E. Gotabaya Rajapaksa, President of Sri Lanka at the High Level Dialogue on Energy",
    "Date": "26.09.2021",
    "Link": "https://mfa.gov.lk/en/president-dialogue/",
    "Summary": "In a statement at the High Level Dialogue on Energy, Sri Lankan President H.E. Gotabaya Rajapaksa addressed key energy-related issues. The President's speech can be viewed at the provided link on YouTube.",
    "Category": "Ministry News"
  },
  {
    "Title": "Statement by H.E.the President at the Food Systems Summit in New York – 23 September 2021",
    "Date": "26.09.2021",
    "Link": "https://mfa.gov.lk/en/president-fs-summit/",
    "Summary": "H.E. the President delivered a statement at the Food Systems Summit in New York on September 23, 2021. The full statement can be viewed at the provided YouTube link.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Ministers of Sri Lanka and South Africa discuss reconciliation rooted in local culture",
    "Date": "26.09.2021",
    "Link": "https://mfa.gov.lk/en/fm-sl-south-africa/",
    "Summary": "South African Minister for International Relations and Cooperation Dr. Naledi Pandor met with Sri Lankan Foreign Minister Prof. G.L. Peiris at the Permanent Mission of South Africa in New York on Friday, September 24, 2021. The discussion focused on reconciliation strategies that are deeply rooted in the local culture of both countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Ministers of Sri Lanka and Indonesia focus on Indian Ocean security and counter terrorism",
    "Date": "25.09.2021",
    "Link": "https://mfa.gov.lk/en/sl-fm-indonesia/",
    "Summary": "Foreign Minister of Indonesia Retno Lestari Priansari Marsudi welcomed the Foreign Minister of Sri Lanka to the Mission of Indonesia in New York. They focused on Indian Ocean security and counter-terrorism cooperation during their meeting. The Indonesian Foreign Minister emphasized the importance of bilateral relations between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka Foreign Minister requests UAE assistance regarding purchase of oil",
    "Date": "24.09.2021",
    "Link": "https://mfa.gov.lk/en/sl-fm-uae/",
    "Summary": "Sri Lanka's Foreign Minister Prof. G.L. Peiris requested UAE's assistance in oil purchases during a meeting with UAE's Minister of Industry and Advanced Technology Dr. Sultan Al Jaber at the 76th session of the United Nations General Assembly.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Ministers of Sri Lanka and Thailand resolve to build on Buddhist Heritage",
    "Date": "24.09.2021",
    "Link": "https://mfa.gov.lk/en/sl-fs-thailand/",
    "Summary": "Foreign Minister G.L. Peiris and Thailand's Deputy Prime Minister Don Pramudwinai discussed their strong bilateral ties as two countries practicing Theravada Buddhism, aiming to build on their shared Buddhist heritage.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Prof. G. L. Peiris called on the Indian Foreign Minister Dr S. Jaishankar on the sidelines of the U. N. General Assembly in New York, USA on 22 September 2021",
    "Date": "23.09.2021",
    "Link": "https://mfa.gov.lk/en/fm-sl-india/",
    "Summary": "Foreign Minister Prof. G. L. Peiris met with Indian Foreign Minister Dr. S. Jaishankar at the U.N. General Assembly in New York on September 22, 2021. During the meeting, Prof. Peiris briefed Dr. Jaishankar on Sri Lanka's successful measures to control the spread of Covid-19.",
    "Category": "Ministry News"
  },
  {
    "Title": "Speech of President Gotabaya Rajapaksa at 76th UN General Assembly – New York, September 22, 2021",
    "Date": "23.09.2021",
    "Link": "https://mfa.gov.lk/en/speech-sl-president-76th-un/",
    "Summary": "President Gotabaya Rajapaksa delivered a speech at the 76th UN General Assembly in New York on September 22, 2021. The video of the speech can be viewed at https://youtu.be/0yttqpTMkvQ.",
    "Category": "Ministry News"
  },
  {
    "Title": "High Commissioner of Sri Lanka to India Milinda Moragoda presents Credentials to the President of India Shri Ram Nath Kovind",
    "Date": "22.09.2021",
    "Link": "https://mfa.gov.lk/en/high-commissioner-of-sri-lanka-to-india-milinda-moragoda-presents-credentials-to-the-president-of-india-shri-ram-nath-kovind/",
    "Summary": "High Commissioner of Sri Lanka to India, Milinda Moragoda, appointed with cabinet rank, presented his Letter of Credence to President Shri Ram Nath Kovind of India today in New Delhi. This formal act signifies the official start of his diplomatic duties in India.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Peiris and Secretary-General of the Organization of Islamic Cooperation reiterate the importance of integration among communities with preservation of identity",
    "Date": "22.09.2021",
    "Link": "https://mfa.gov.lk/en/ffm-sl-oic/",
    "Summary": "Foreign Minister Prof. G.L. Peiris and OIC Secretary-General Yousef Al-Othaimeen emphasized the importance of integration among communities while preserving their identities. Both officials highlighted the positive outcomes of fostering unity and diversity within societies.",
    "Category": "Ministry News"
  },
  {
    "Title": "“Sri Lanka will remain neutral in the Indian Ocean and will not be a threat to any country” – Sri Lankan Foreign Secretary Admiral Prof. Jayanath Colombage",
    "Date": "21.09.2021",
    "Link": "https://mfa.gov.lk/en/sl-fm-secretary-carnegie/",
    "Summary": "Sri Lankan Foreign Secretary Admiral Prof. Jayanath Colombage reaffirmed that Sri Lanka will maintain neutrality in the Indian Ocean and pose no threat to any country during his Special Address at the 'Ocean Nations: An In' event. This statement emphasizes Sri Lanka's commitment to peaceful relations in the region.",
    "Category": "Ministry News"
  },
  {
    "Title": "CICA has a vital role to play and can render yeoman service under the current circumstances, states Foreign Minister Peiris",
    "Date": "21.09.2021",
    "Link": "https://mfa.gov.lk/en/cica-fm-sl/",
    "Summary": "Foreign Minister Prof. G.L. Peiris emphasized the vital role that the Conference on Interaction and Confidence Building Measures in Asia (CICA) can play under current circumstances. He stated that CICA has the potential to render yeoman service in addressing regional challenges.",
    "Category": "Ministry News"
  },
  {
    "Title": "The Foreign Ministers of Sri Lanka and Australia meet on the eve of the 76th Session of the United Nations General Assembly",
    "Date": "21.09.2021",
    "Link": "https://mfa.gov.lk/en/fm-sl-australia-2/",
    "Summary": "Sri Lankan Foreign Minister Prof. G.L. Peiris met with Australian Foreign Minister Marise Payne in New York on the eve of the 76th Session of the United Nations General Assembly. They discussed opportunities for increased cooperation across various areas, with Minister Payne extending warm greetings during the meeting.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister G.L. Peiris has bilateral meeting with Foreign Minister of Turkey",
    "Date": "20.09.2021",
    "Link": "https://mfa.gov.lk/en/fm-turkey/",
    "Summary": "Foreign Minister G.L. Peiris held a bilateral meeting with Turkish Foreign Minister Mevlüt Çavuşoğlu at the Turkish House in New York on Friday, September 17, 2021. The meeting took place at the Chancery building of the Turkish Permanent Mission.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Peiris reaffirms Sri Lanka’s active commitment to dialogue and engagement with the Commonwealth",
    "Date": "19.09.2021",
    "Link": "https://mfa.gov.lk/en/fm-commonwealth/",
    "Summary": "Sri Lankan Foreign Minister Prof. G.L. Peiris reaffirmed Sri Lanka’s commitment to dialogue and engagement with the Commonwealth during a virtual meeting with Commonwealth Secretary-General Patricia Scotland. Sri Lanka remains actively engaged in fostering relationships within the Commonwealth.",
    "Category": "Ministry News"
  },
  {
    "Title": "The new Executive Director assumes duties at the Lakshman Kadirgamar Institute for International Relations and Strategic Studies",
    "Date": "16.09.2021",
    "Link": "https://mfa.gov.lk/en/lki-new-ex-director/",
    "Summary": "Ambassador Dayantha Laksiri Mendis has assumed the role of Executive Director at the Lakshman Kadirgamar Institute for International Relations and Strategic Studies (LKIIRSS), appointed by the Foreign Minister and Chairman of the Board.",
    "Category": "Ministry News"
  },
  {
    "Title": "Statement by Foreign Minister Prof. G.L. Peiris at the Ministerial Sessions on ‘Foreign Policy and Religion’ at the G20 Interfaith Forum, Bologna, Italy",
    "Date": "16.09.2021",
    "Link": "https://mfa.gov.lk/en/fm-sl-bologna/",
    "Summary": "Foreign Minister Prof. G.L. Peiris addressed the Ministerial Sessions on 'Foreign Policy and Religion' at the G20 Interfaith Forum in Bologna, Italy. He highlighted the significant interface between religion and foreign policy, building on insights shared by the Maltese Minister and the Rector.",
    "Category": "Ministry News"
  },
  {
    "Title": "State Minister Tharaka Balasuriya discusses potential for enhancing tourism and economic ties with Ukrainian counterparts",
    "Date": "15.09.2021",
    "Link": "https://mfa.gov.lk/en/sm-ukrain/",
    "Summary": "State Minister of Regional Co-operation Tharaka Balasuriya visited Ukraine from 8 – 10 September 2021 to participate in a Sri Lanka tourism promotion campaign and explore opportunities for enhancing tourism and economic ties with Ukrainian counterparts. The discussions aimed to strengthen bilateral cooperation and boost tourism between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "State Minister Tharaka Balasuriya participates in tourism promotion campaign in Moscow",
    "Date": "15.09.2021",
    "Link": "https://mfa.gov.lk/en/sm-moscow/",
    "Summary": "State Minister of Regional Co-operation Tharaka Balasuriya visited Russia from September 5 to 8, 2021, to join a tourism promotion campaign in Moscow. He attended the opening of the Sri Lanka pavilion at the \"OTDYKH Leisure Fair,\" aiming to boost tourism ties between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Statement by Hon. Foreign Minister of Sri Lanka at the 48th Regular Session of the UN Human Rights Council, 14 September 2021, Geneva",
    "Date": "14.09.2021",
    "Link": "https://mfa.gov.lk/en/sl-fm-unhrc/",
    "Summary": "At the 48th Regular Session of the UN Human Rights Council in Geneva on September 14, 2021, Hon. Foreign Minister of Sri Lanka, Prof. G.L. Peiris, delivered a statement regarding human rights issues in Sri Lanka. The statement was made during Agenda Item 2, which focused on an oral update by the High Commissioner for Human Rights.",
    "Category": "Ministry News"
  },
  {
    "Title": "Government of Sri Lanka expresses solidarity to the US Government on the 20th Anniversary of 9/11",
    "Date": "11.09.2021",
    "Link": "https://mfa.gov.lk/en/us-20th-memorial-9-11/",
    "Summary": "The Government of Sri Lanka expresses solidarity with the US Government on the 20th Anniversary of 9/11, commemorating the lives lost in the tragic terrorist attacks. Today marks two decades since the events that affected not only the USA but also many other nationalities.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Prof. G.L. Peiris  calls for enhanced economic cooperation with Iran",
    "Date": "09.09.2021",
    "Link": "https://mfa.gov.lk/en/sl-fm-iran/",
    "Summary": "Foreign Minister Prof. G.L. Peiris has called for enhanced economic cooperation with Iran, focusing on increased bilateral trade, investment, and potential collaboration in sectors like tourism and energy. The aim is to strengthen ties and explore new avenues for mutual growth and development.",
    "Category": "Ministry News"
  },
  {
    "Title": "Ambassador of Viet Nam in Colombo Ho Thi Thanh Truc calls on Foreign Minister Prof. G.L. Peiris",
    "Date": "09.09.2021",
    "Link": "https://mfa.gov.lk/en/sl-fm-viet-nam/",
    "Summary": "Ambassador of Viet Nam in Colombo, Ho Thi Thanh Truc, visited Foreign Minister Prof. G.L. Peiris at the Foreign Ministry on September 8, 2021. The meeting likely discussed the 50th Anniversary of the establishment of diplomatic relations between Viet Nam and Sri Lanka.",
    "Category": "Ministry News"
  },
  {
    "Title": "Visit by Prime Minister to Italy",
    "Date": "08.09.2021",
    "Link": "https://mfa.gov.lk/en/pm-visit-italy/",
    "Summary": "The Prime Minister and Foreign Minister will visit Bologna, Italy to attend an international event alongside the Prime Minister of Italy and other dignitaries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Statement on the issue of tracing the Origins of COVID-19",
    "Date": "08.09.2021",
    "Link": "https://mfa.gov.lk/en/origins-covid-19/",
    "Summary": "The COVID-19 pandemic has severely disrupted global health, safety, and livelihoods. Multilateralism and international cooperation are crucial for effectively tracing the origins of the virus and addressing its impacts.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister appreciates multifaceted partnership with Italy",
    "Date": "04.09.2021",
    "Link": "https://mfa.gov.lk/en/sl-fm-italy/",
    "Summary": "Foreign Minister Prof. G.L. Peiris welcomed the Ambassador of Italy to Sri Lanka, Rita Giuliana Manella, during her courtesy visit at the Foreign Ministry on Thursday, September 2. The Ambassador expressed warm felicitations, highlighting the countries' multifaceted partnership.",
    "Category": "Ministry News"
  },
  {
    "Title": "Telephone conversation between the President and Kenyan President",
    "Date": "04.09.2021",
    "Link": "https://mfa.gov.lk/en/telephone-conversation-between-the-president-and-kenyan-president/",
    "Summary": "President Gotabaya Rajapaksa and Kenyan President Uhuru Muigai Kenyatta had a cordial telephone conversation on 3 September. The two leaders discussed bilateral relations and cooperation between Sri Lanka and Kenya.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Peiris meets UN Resident Coordinator Hanaa Singer- Hamdy",
    "Date": "02.09.2021",
    "Link": "https://mfa.gov.lk/en/fm-sl-unrc/",
    "Summary": "Foreign Minister G. L. Peiris met with UN Resident Coordinator Hanaa Singer-Hamdy at the Foreign Ministry in Colombo on 2 September. During the courtesy call, Minister Peiris expressed gratitude to the UNRC.",
    "Category": "Ministry News"
  },
  {
    "Title": "Libyan government requests Sri Lanka to monitor upcoming elections later this year",
    "Date": "02.09.2021",
    "Link": "https://mfa.gov.lk/en/fm-sl-libya/",
    "Summary": "The Libyan government has requested Sri Lanka to monitor the upcoming elections later this year. Foreign Minister Prof. G.L. Peiris discussed this matter with the Charge d’ Affaires of the Embassy of the State of Libya in Sri Lanka, Amar A.M. Muftah, at the Foreign Ministry on Wednesday, 01 September 2021.",
    "Category": "Ministry News"
  },
  {
    "Title": "LTTE proscription in the UK",
    "Date": "02.09.2021",
    "Link": "https://mfa.gov.lk/en/ltte-proscription-uk/",
    "Summary": "The UK Home Secretary has decided to uphold the proscription of the LTTE as a terrorist organization under the UK Terrorism Act. This decision was communicated to the Government of Sri Lanka.",
    "Category": "Ministry News"
  },
  {
    "Title": "Thailand donates COVID-19 related medical equipment to Sri Lanka",
    "Date": "01.09.2021",
    "Link": "https://mfa.gov.lk/en/thailand-sl-fm/",
    "Summary": "Thailand donated COVID-19 related medical equipment to Sri Lanka, which was accepted by Foreign Secretary Jayanath Colombage from the Chargè d’ affaires of the Royal Thai Embassy in Colombo, Tayatat Kanjanapipatkul. The donation was received at a symbolic ceremony held at the Foreign Ministry.",
    "Category": "Ministry News"
  },
  {
    "Title": "Apostolic Nuncio discusses Easter Sunday bombing investigation in meeting with Foreign Minister",
    "Date": "01.09.2021",
    "Link": "https://mfa.gov.lk/en/fm-sl-apostolic-nuncio/",
    "Summary": "Archbishop Brian Udaigwe, the Apostolic Nuncio to Sri Lanka, met with Foreign Minister Prof. G. L. Peiris on Tuesday, August 31, at the Foreign Ministry to discuss the Easter Sunday bombing investigation. The meeting aimed to address the ongoing investigation into the tragic events that occurred on Easter Sunday.",
    "Category": "Ministry News"
  },
  {
    "Title": "Norwegian Ambassador pays courtesy call on Foreign Minister",
    "Date": "31.08.2021",
    "Link": "https://mfa.gov.lk/en/fm-sl-norway/",
    "Summary": "Norwegian Ambassador Trine Jøranli Eskedal visited Sri Lanka and met with Foreign Minister Prof. G.L. Peiris on August 30, 2021, at the Foreign Ministry. They discussed matters of mutual interest during the courtesy call.",
    "Category": "Ministry News"
  },
  {
    "Title": "High Commissioner-designate of Sri Lanka to India Milinda Moragoda assumes duties in New Delhi",
    "Date": "31.08.2021",
    "Link": "https://mfa.gov.lk/en/high-commissioner-designate-of-sri-lanka-to-india-milinda-moragoda-assumes-duties-in-new-delhi/",
    "Summary": "Milinda Moragoda, the new High Commissioner-designate of Sri Lanka to India, assumed his duties with cabinet rank at a ceremony in New Delhi on August 30, 2021. The event took place at the High Commission of Sri Lanka, marking the official start of his diplomatic role.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka seeks safety of travellers from Afghanistan",
    "Date": "30.08.2021",
    "Link": "https://mfa.gov.lk/en/sl-afghan-2/",
    "Summary": "Sri Lanka is closely monitoring the situation in Afghanistan to ensure the safety of travelers, with a focus on the humanitarian aspect. The country is working with international partners to facilitate necessary assistance.",
    "Category": "Ministry News"
  },
  {
    "Title": "Ambassador of Qatar to Sri Lanka Jassin Bin Jabir Jassim Al Sorour called on the new Foreign Minister Prof. G.L. Peiris",
    "Date": "27.08.2021",
    "Link": "https://mfa.gov.lk/en/fm-sl-qatar/",
    "Summary": "Ambassador of Qatar to Sri Lanka, Jassin Bin Jabir Jassim Al Sorour, met with the new Foreign Minister Prof. G.L. Peiris on August 25, 2021. During the meeting, Foreign Minister Peiris acknowledged the longstanding friendly relations between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Ambassador of Turkey to Sri Lanka pays courtesy call on Foreign Minister",
    "Date": "27.08.2021",
    "Link": "https://mfa.gov.lk/en/fm-sl-turkey/",
    "Summary": "The Ambassador of Turkey to Sri Lanka, Demet Şekercioğlu, visited Foreign Minister Prof. G. L. Peiris at the Foreign Ministry on August 25. They engaged in discussions during the courtesy call.",
    "Category": "Ministry News"
  },
  {
    "Title": "Ambassador of Sri Lanka to Oman Ameer Ajwad presented Letter of Credence as the Non-resident Ambassador to the Republic of Yemen",
    "Date": "27.08.2021",
    "Link": "https://mfa.gov.lk/en/ambassador-of-sri-lanka-to-oman-ameer-ajwad-presented-letter-of-credence-as-the-non-resident-ambassador-to-the-republic-of-yemen/",
    "Summary": "Ambassador of Sri Lanka to Oman, Ameer Ajwad, presented his Letters of Credence to the President of the Republic of Yemen, Abd Rabbuh Mansour Al Hadi, at the Presidential Palace in Riyadh. This marks his official appointment as the Non-resident Ambassador to Yemen.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Prof. G. L Peiris discusses Strengthening Mutual Cooperation with Australia",
    "Date": "26.08.2021",
    "Link": "https://mfa.gov.lk/en/fm-sl-australia/",
    "Summary": "Foreign Minister Prof. G. L. Peiris discussed strengthening mutual cooperation with Australia during a courtesy call with High Commissioner David Holly on August 25, 2021. They explored ways to advance bilateral relations across various fields. The meeting aimed to enhance collaboration between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Consular Assistance Provided by the Foreign Ministry during Covid-19 Pandemic",
    "Date": "25.08.2021",
    "Link": "https://mfa.gov.lk/en/fm-consular/",
    "Summary": "The Consular Affairs and Overseas Sri Lankans Division of the Foreign Ministry provides consular assistance during the Covid-19 pandemic by authenticating documents through the Electronic Documentation Attestation System (e-DAS). This system, implemented in 2017, facilitates the process for individuals seeking consular services.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister highlights Sri Lanka’s longstanding relations with the Netherlands during meeting with Dutch Ambassador",
    "Date": "25.08.2021",
    "Link": "https://mfa.gov.lk/en/fm-sl-dutch/",
    "Summary": "Foreign Minister Prof. G.L. Peiris met with Dutch Ambassador Tanja Gonggrijp at the Foreign Ministry in Colombo to discuss Sri Lanka's longstanding relations with the Netherlands. The meeting highlighted the strong diplomatic ties between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "German Ambassador Holger Seubert pays courtesy call on Foreign Minister G.L. Peiris",
    "Date": "25.08.2021",
    "Link": "https://mfa.gov.lk/en/fm-sl-german/",
    "Summary": "German Ambassador Holger Seubert visited Sri Lanka's Foreign Minister G.L. Peiris on August 24 at the Foreign Ministry in Colombo. The courtesy call aimed to strengthen diplomatic ties between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Ambassador of Kuwait to Sri Lanka Khalaf Bu Dhhair called on the new Foreign Minister Prof. G.L. Peiris",
    "Date": "25.08.2021",
    "Link": "https://mfa.gov.lk/en/fm-sl-kuwait/",
    "Summary": "Ambassador of Kuwait to Sri Lanka, Khalaf Bu Dhhair, met with the new Foreign Minister Prof. G.L. Peiris on August 24, 2021. During the meeting, Ambassador Dhhair conveyed greetings from the Foreign Minister of Kuwait, Sheikh D.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister highlights priorities for enhancing Sri Lanka – Korea relations in meeting with the Korean Ambassador",
    "Date": "24.08.2021",
    "Link": "https://mfa.gov.lk/en/fm-sl-korea/",
    "Summary": "The Ambassador of the Republic of Korea to Sri Lanka, Santhush Woonjin Jeong, met with the newly appointed Foreign Minister Prof. G.L. Peiris on August 24, 2021, at the Foreign Ministry. During the meeting, they discussed priorities for enhancing Sri Lanka-Korea relations.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Ministry expresses condolences on the demise of former Foreign Minister Mangala Samaraweera",
    "Date": "24.08.2021",
    "Link": "https://mfa.gov.lk/en/condolences-ffm/",
    "Summary": "The Foreign Ministry, led by Foreign Minister Prof. G.L.Peiris, extends heartfelt condolences on the passing of former Foreign Minister Mangala Samaraweera. Samaraweera served with distinction in his role.",
    "Category": "Ministry News"
  },
  {
    "Title": "Ambassador of Pakistan to Sri Lanka Major General Muhammad Saad Khattak called on the new Foreign Minister Prof. G.L.Peiris",
    "Date": "23.08.2021",
    "Link": "https://mfa.gov.lk/en/sl-fm-pakistan/",
    "Summary": "Ambassador of Pakistan to Sri Lanka, Major General Muhammad Saad Khattak, met with the new Foreign Minister Prof. G.L. Peiris on August 20, 2021, at the Foreign Ministry to offer congratulations.",
    "Category": "Ministry News"
  },
  {
    "Title": "Ambassador of Japan to Sri Lanka Akira Sugiyama called on the New Foreign Minister Prof. G. L. Peiris",
    "Date": "23.08.2021",
    "Link": "https://mfa.gov.lk/en/sl-fm-japan/",
    "Summary": "Ambassador of Japan to Sri Lanka, Akira Sugiyama, congratulated the new Foreign Minister, Prof. G.L. Peiris, on his appointment and reaffirmed Japan's ongoing support and cooperation with Sri Lanka during their meeting.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister highlights Sri Lanka’s wide-ranging cooperation with Russia in meeting with the Russian Ambassador",
    "Date": "23.08.2021",
    "Link": "https://mfa.gov.lk/en/sl-fm-russia/",
    "Summary": "The Russian Ambassador, Yuri B. Materiy, met with Sri Lanka's Foreign Minister Prof. G.L. Peiris to discuss their countries' broad cooperation. The meeting took place at the Foreign Ministry on Friday, highlighting the strong ties between Sri Lanka and Russia.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Peiris discusses wide ranging cooperation with the  EU Ambassador in Sri Lanka",
    "Date": "23.08.2021",
    "Link": "https://mfa.gov.lk/en/sl-fm-eu/",
    "Summary": "Foreign Minister Prof. G.L. Peiris, who recently took office, held discussions with EU Ambassador Denis Chaibi at the Foreign Ministry in Sri Lanka. The meeting focused on exploring wide-ranging cooperation between Sri Lanka and the European Union.",
    "Category": "Ministry News"
  },
  {
    "Title": "US Ambassador calls on the Foreign Minister",
    "Date": "23.08.2021",
    "Link": "https://mfa.gov.lk/en/us-sl-fm/",
    "Summary": "The US Ambassador to Sri Lanka, Alaina Teplitz, met with Foreign Minister Prof. G.L. Peiris at the Foreign Ministry on Friday, August 20, 2021. During the meeting, Foreign Minister Peiris expressed gratitude to the United States for their assistance.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister appreciates the steadfast assistance by China",
    "Date": "23.08.2021",
    "Link": "https://mfa.gov.lk/en/china-sl-fm/",
    "Summary": "Foreign Minister Prof. G. L. Peiris expressed gratitude to China for its ongoing support to Sri Lanka. Discussions were held on priorities to strengthen relations between the two countries across various sectors.",
    "Category": "Ministry News"
  },
  {
    "Title": "High Commissioner of India to Sri Lanka Gopal Baglay calls on Foreign Minister Prof. G.L. Peiris",
    "Date": "23.08.2021",
    "Link": "https://mfa.gov.lk/en/india-sl-fm/",
    "Summary": "High Commissioner of India to Sri Lanka, Gopal Baglay, met with the new Foreign Minister Prof. G.L. Peiris following his assumption of duties. Foreign Minister Peiris expressed appreciation for the support from India.",
    "Category": "Ministry News"
  },
  {
    "Title": "Statement on situation in Afghanistan",
    "Date": "21.08.2021",
    "Link": "https://mfa.gov.lk/en/sl-afghan/",
    "Summary": "The Government of Sri Lanka is closely monitoring the situation in Afghanistan and expresses deep concern. Their primary focus is on ensuring the safety and security of Sri Lankans living in Afghanistan and facilitating evacuations.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Ministry Consular Affairs Division provides limited services  during the lockdown period",
    "Date": "20.08.2021",
    "Link": "https://mfa.gov.lk/en/consular-limited/",
    "Summary": "During the nationwide lockdown from 20 August to 30 August 2021, the Foreign Ministry's Consular Affairs Division will provide limited services only to those with urgent needs. Regular services will resume after the lockdown period ends.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Prof. G.L Peiris assumes duties",
    "Date": "18.08.2021",
    "Link": "https://mfa.gov.lk/en/fm-assumes-duties/",
    "Summary": "Foreign Minister Prof. G.L Peiris officially began his duties at the Ministry today in a ceremony attended by outgoing Foreign Minister Dinesh Gunawarden, who is now the Minister of Education.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka, as a globally acclaimed leisure destination, takes the lead to revitalize the regional and domestic tourism industry through enhanced regional cooperation",
    "Date": "18.08.2021",
    "Link": "https://mfa.gov.lk/en/b2b-cica/",
    "Summary": "Sri Lanka, known for its global appeal as a leisure destination, is leading efforts to boost regional and domestic tourism through enhanced cooperation. The Foreign Ministry and Sri Lanka Tourism Promotion Bureau recently organized a virtual B2B interactive session on August 17, 2021, with member states of the Conference. This initiative aims to revitalize the tourism industry in the region.",
    "Category": "Ministry News"
  },
  {
    "Title": "Efforts to evacuate Sri Lankan nationals in Afghanistan",
    "Date": "15.08.2021",
    "Link": "https://mfa.gov.lk/en/afghan-sl/",
    "Summary": "Efforts are underway to evacuate Sri Lankan nationals from Afghanistan amidst the current situation. The Foreign Ministry is actively working on the evacuation process to ensure the safety of its citizens in Afghanistan.",
    "Category": "Ministry News"
  },
  {
    "Title": "The late Lakshman Kadirgamar was an excellent and exemplary leader",
    "Date": "13.08.2021",
    "Link": "https://mfa.gov.lk/en/lakshman-kadirgamar/",
    "Summary": "Foreign Minister Dinesh Gunawardena praised the late Lakshman Kadirgamar as a remarkable Minister and exemplary leader from Sri Lanka. Minister Gunawardena made these remarks while paying tribute to Kadirgamar.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign  Minister Dinesh Gunawardena discusses bilateral priorities with the Saudi Minister of State for Foreign Affairs",
    "Date": "12.08.2021",
    "Link": "https://mfa.gov.lk/en/fm-saudi/",
    "Summary": "Foreign Minister Dinesh Gunawardena discussed bilateral priorities with Saudi Minister of State for Foreign Affairs Adel bin Ahmed Al-Jubeir in a virtual meeting. Gunawardena praised the strong bilateral relations with Saudi Arabia during the discussion.",
    "Category": "Ministry News"
  },
  {
    "Title": "47th Consultative Committee Meeting of The Colombo Plan Inaugural address by the Hon. Dinesh Gunawardena, Foreign Minister of Sri Lanka",
    "Date": "11.08.2021",
    "Link": "https://mfa.gov.lk/en/47th-consultative-committee/",
    "Summary": "At the 47th Consultative Committee Meeting of The Colombo Plan, Hon. Dinesh Gunawardena, Foreign Minister of Sri Lanka, delivered the inaugural address. The event was attended by various dignitaries including the Chair of the 46th CCM, Heads of Delegations, and representatives of international organizations.",
    "Category": "Ministry News"
  },
  {
    "Title": "Colombo Plan is a Source of Strength to Face Post- Pandemic Global Challenges – Foreign Minister",
    "Date": "11.08.2021",
    "Link": "https://mfa.gov.lk/en/colombo-plan-fm/",
    "Summary": "Foreign Minister Dinesh Gunawardena emphasized the importance of The Colombo Plan in facing post-pandemic global challenges during the 47th Consultative Committee Meeting. He highlighted the organization's work and experience in socio-economic development.",
    "Category": "Ministry News"
  },
  {
    "Title": "COP26 Regional Ambassador for Asia-Pacific and South Asia Ken O’Flaherty commends Sri Lanka for its commitments on renewable energy and climate action",
    "Date": "10.08.2021",
    "Link": "https://mfa.gov.lk/en/cop26-south-asia/",
    "Summary": "COP26 Regional Ambassador for Asia-Pacific and South Asia Ken O’Flaherty praised Sri Lanka for submitting its updated Nationally Determined Contributions (NDCs) with ambitious commitments on renewable energy and climate action. Sri Lanka's efforts in this regard have been commended for their timely and significant contributions towards addressing climate change.",
    "Category": "Ministry News"
  },
  {
    "Title": "Japan appreciates Sri Lanka’s solidarity exhibited through participating in the Olympics",
    "Date": "10.08.2021",
    "Link": "https://mfa.gov.lk/en/japan-appreciates-sl/",
    "Summary": "Ambassador of Japan to Sri Lanka, Akira Sujiama, met with Foreign Minister Dinesh Gunawardena to express gratitude for Sri Lanka's solidarity in participating in the Tokyo Olympics. Japan appreciates the support shown by Sri Lanka through its presence at this year's Olympic Games.",
    "Category": "Ministry News"
  },
  {
    "Title": "State Minister of Regional Cooperation Tharaka Balasuriya stresses Sri Lanka’s commitment for enhanced cooperation at the 28th ASEAN Regional Forum (ARF)",
    "Date": "10.08.2021",
    "Link": "https://mfa.gov.lk/en/sm-28th-arf/",
    "Summary": "State Minister of Regional Cooperation Tharaka Balasuriya highlighted Sri Lanka's dedication to increased cooperation at the 28th ASEAN Regional Forum (ARF) held virtually on August 6, 2021. He emphasized Sri Lanka's commitment to enhancing collaboration with the ARF members.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Gunawardena stresses enhanced global vaccine collaboration at the First International Forum on COVID-19 Vaccine Cooperation",
    "Date": "06.08.2021",
    "Link": "https://mfa.gov.lk/en/fm-1covid-forum/",
    "Summary": "Foreign Minister Gunawardena emphasized the importance of enhanced global collaboration on vaccines at the First International Forum on COVID-19 Vaccine Cooperation held virtually on August 5, 2021. The forum aimed to promote cooperation among countries for effective vaccine distribution and response to the pandemic.",
    "Category": "Ministry News"
  },
  {
    "Title": "High Commissioner of India to Sri Lanka calls on Foreign Minister",
    "Date": "05.08.2021",
    "Link": "https://mfa.gov.lk/en/india-slfm/",
    "Summary": "High Commissioner of India to Sri Lanka, Gopal Baglay, met with Foreign Minister Dinesh Gunawardena on August 3, 2021. Minister Gunawardena expressed gratitude to India for their assistance.",
    "Category": "Ministry News"
  },
  {
    "Title": "Establishment of Three Regional Offices within the past ten months to decentralize the Consular services of the Foreign Ministry",
    "Date": "05.08.2021",
    "Link": "https://mfa.gov.lk/en/regional-consular/",
    "Summary": "The Foreign Ministry has established three regional offices in the past ten months to decentralize consular services. Foreign Secretary Admiral Prof. Jayanath Colombage highlights the ongoing Programme on Decentralization of Consular Services as a key initiative. This move aims to improve accessibility and efficiency in delivering consular services to citizens.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Ministers welcome opening of New Zealand High Commission in Colombo",
    "Date": "04.08.2021",
    "Link": "https://mfa.gov.lk/en/new-zealand-fm/",
    "Summary": "Foreign Ministers Nanaia Mahuta of New Zealand and Dinesh Gunawardena of Sri Lanka have expressed their approval for the upcoming opening of the New Zealand High Commission in Colombo next week. The Foreign Ministers met virtually yesterday to discuss this development.",
    "Category": "Ministry News"
  },
  {
    "Title": "Courtesy call by the New Zealand High Commissioner",
    "Date": "02.08.2021",
    "Link": "https://mfa.gov.lk/en/fm-new-zealand-hc/",
    "Summary": "Foreign Minister Dinesh Gunawardena welcomed Michael Appleton, the first New Zealand resident High Commissioner to Sri Lanka, during a meeting on August 2, 2021. They discussed various initiatives aimed at expanding practical cooperation between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Singapore-based global non-profit, the Alliance to End Plastic Waste donates beach cleaning machinery to Sri Lanka",
    "Date": "02.08.2021",
    "Link": "https://mfa.gov.lk/en/mepa-alliance/",
    "Summary": "Singapore-based global non-profit, the Alliance to End Plastic Waste, donated eight BeachTech Hydro Sweepy beach cleaning machines valued at around US$180,000 to Sri Lanka's Marine Environment Protection Authority (MEPA). The donation aims to support MEPA in enhancing beach cleaning efforts and combating plastic pollution in Sri Lanka.",
    "Category": "Ministry News"
  },
  {
    "Title": "The first consignment of AstraZeneca vaccines received from Japan at the request of the President arrived in Sri Lanka day before yesterday",
    "Date": "01.08.2021",
    "Link": "https://mfa.gov.lk/en/japan-sl/",
    "Summary": "The first consignment of AstraZeneca vaccines, donated by Japan at the request of the President, arrived in Sri Lanka two days ago. Foreign Minister Dinesh Gunawardena conveyed gratitude to Japan for providing over 1.4 million vaccine doses to Sri Lanka.",
    "Category": "Ministry News"
  },
  {
    "Title": "Video of Counterfeit “NIKE” shoes with LTTE insignia circulating on social media",
    "Date": "31.07.2021",
    "Link": "https://mfa.gov.lk/en/nike-fm/",
    "Summary": "A video showing counterfeit \"NIKE\" shoes featuring the LTTE insignia is circulating on social media. NIKE, Inc. has confirmed that the shoes in the video are not authentic.",
    "Category": "Ministry News"
  },
  {
    "Title": "Prime Minister declares open a Regional Consular Office in Kurunegala",
    "Date": "31.07.2021",
    "Link": "https://mfa.gov.lk/en/consular-kurunegala/",
    "Summary": "Prime Minister Mahinda Rajapaksa virtually inaugurated a Regional Consular Office of the Foreign Ministry in Kurunegala on July 27, 2021. The event was attended by Foreign Minister Dinesh Gunawardena and other government officials. This new office aims to enhance consular services in the region.",
    "Category": "Ministry News"
  },
  {
    "Title": "The Ambassador of Cuba to Sri Lanka calls on the Foreign Minister",
    "Date": "29.07.2021",
    "Link": "https://mfa.gov.lk/en/sl-fm-cuba/",
    "Summary": "The new Ambassador of Cuba to Sri Lanka, Andres Marcelo Gonzalez Garrido, met with Foreign Minister Dinesh Gunawardena at the Foreign Ministry on July 29. Minister Gunawardena warmly welcomed Ambassador Garrido during the meeting.",
    "Category": "Ministry News"
  },
  {
    "Title": "Celebrating the International Day for the Conservation of the Mangrove Ecosystem",
    "Date": "29.07.2021",
    "Link": "https://mfa.gov.lk/en/mangrove-ecosystem/",
    "Summary": "On the International Day for the Conservation of the Mangrove Ecosystem, it is noted that 30-50% of mangroves have been lost in the last 50 years. New restoration approaches are emerging, utilizing low-cost technologies to support the resilience of local communities.",
    "Category": "Ministry News"
  },
  {
    "Title": "State Minister of Regional Cooperation Tharaka Balasuriya and first resident High Commissioner of New Zealand to Sri Lanka discuss means of strengthening economic ties between the two countries",
    "Date": "28.07.2021",
    "Link": "https://mfa.gov.lk/en/new-zealand-sl-2/",
    "Summary": "State Minister of Regional Cooperation Tharaka Balasuriya and the first resident High Commissioner of New Zealand to Sri Lanka, Michael Appleton, discussed ways to enhance economic ties between the two countries during a courtesy call on 28 July 2021. The meeting aimed to strengthen bilateral cooperation and promote economic relations between Sri Lanka and New Zealand.",
    "Category": "Ministry News"
  },
  {
    "Title": "Joint stamp launches in Sri Lanka and Singapore to commemorate 50 years of diplomatic ties",
    "Date": "27.07.2021",
    "Link": "https://mfa.gov.lk/en/joint-stamp-sl-sin/",
    "Summary": "A joint stamp launch ceremony was held at the Foreign Ministry in Sri Lanka on July 27 to commemorate 50 years of diplomatic ties established on the same day in 1970. The event marked a significant milestone in the relationship between Sri Lanka and Singapore.",
    "Category": "Ministry News"
  },
  {
    "Title": "Appointment of the first High Commissioner of the New Zealand to Sri Lanka",
    "Date": "22.07.2021",
    "Link": "https://mfa.gov.lk/en/new-zealand-sl/",
    "Summary": "The Government of New Zealand, in agreement with the Government of Sri Lanka, has appointed Mr. Michael Edward Appleton as the first High Commissioner of New Zealand to Sri Lanka. He will be based in Colombo.",
    "Category": "Ministry News"
  },
  {
    "Title": "Appointment of Ambassador of the Republic of Cuba to Sri Lanka",
    "Date": "22.07.2021",
    "Link": "https://mfa.gov.lk/en/cuba-sl/",
    "Summary": "The Government of the Republic of Cuba, with the approval of the Government of Sri Lanka, has named Mr. Andrés Marcelo Garrido as the new Ambassador Extraordinary and Plenipotentiary of Cuba to Sri Lanka. Mr. Garrido will represent Cuba in Sri Lanka in his diplomatic capacity.",
    "Category": "Ministry News"
  },
  {
    "Title": "Ambassador Majintha Jayesinghe presented Letters of Credence in Slovakia",
    "Date": "22.07.2021",
    "Link": "https://mfa.gov.lk/en/ambassador-majintha-jayesinghe-presented-letters-of-credence-in-slovakia/",
    "Summary": "Ambassador Majintha Jayesinghe presented the Letters of Credence to President Zuzana Čaputová of the Slovak Republic at the Presidential Palace in Bratislava on July 7, 2021. This accreditation officially appointed Jayesinghe as the Ambassador Extraordinaire.",
    "Category": "Ministry News"
  },
  {
    "Title": "State Minister of Regional Cooperation discusses enhancement of economic ties with Bahrain",
    "Date": "19.07.2021",
    "Link": "https://mfa.gov.lk/en/sm-sl-bahrain/",
    "Summary": "State Minister of Regional Cooperation, Tharaka Balasuriya, discussed the enhancement of economic ties with Bahrain during a phone call, aligning with the ministry's goal to strengthen relations in the Middle East.",
    "Category": "Ministry News"
  },
  {
    "Title": "Ambassador of Myanmar to Sri Lanka calls on the Foreign Minister",
    "Date": "19.07.2021",
    "Link": "https://mfa.gov.lk/en/fm-sl-myanmar/",
    "Summary": "Myanmar's Ambassador to Sri Lanka, U Han Thu, met with Foreign Minister Dinesh Gunawardena on July 16. During the meeting, Minister Gunawardena highlighted the enduring fraternal bilateral relationship between Sri Lanka and Myanmar.",
    "Category": "Ministry News"
  },
  {
    "Title": "State Minister of Regional Cooperation holds discussions with Minister of Commerce, Industry and Investment Promotion of Oman to enhance bilateral economic ties",
    "Date": "19.07.2021",
    "Link": "https://mfa.gov.lk/en/sm-sl-oman/",
    "Summary": "State Minister of Regional Cooperation, Tharaka Balasuriya, engaged in virtual discussions with the Minister of Commerce, Industry, and Investment Promotion of Oman to strengthen bilateral economic ties in line with the ministry's focus on enhancing relations with the Middle East.",
    "Category": "Ministry News"
  },
  {
    "Title": "New Ambassador of Viet Nam to Sri Lanka calls on the Foreign Minister",
    "Date": "19.07.2021",
    "Link": "https://mfa.gov.lk/en/fm-sl-viet-nam/",
    "Summary": "The newly appointed Ambassador of Viet Nam to Sri Lanka, Ho Thi Thanh Truc, met with Foreign Minister Dinesh Gunawardena at the Foreign Ministry on July 15, 2021. The Foreign Minister welcomed Ambassador Truc to Sri Lanka during the meeting.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka launches the Submarine Cable Protection and Resilience Framework",
    "Date": "18.07.2021",
    "Link": "https://mfa.gov.lk/en/sl-submarine-cable/",
    "Summary": "Sri Lanka launched the Submarine Cable Protection and Resilience Framework on July 15, 2021, making it the first country in Asia to do so. The framework was introduced at a stakeholder meeting chaired by Secretary to the President Dr. P. B. Jayasundara.",
    "Category": "Ministry News"
  },
  {
    "Title": "Statement by Hon. Dinesh Gunawardena, Foreign Minister of Sri Lanka International Conference “Central and South Asia: Regional Connectivity. Challenges and Opportunities”   Tashkent, Republic of Uzbekistan, 15-16 July 2021",
    "Date": "17.07.2021",
    "Link": "https://mfa.gov.lk/en/fm-sl-uzebkistan/",
    "Summary": "Foreign Minister of Sri Lanka, Hon. Dinesh Gunawardena, participated in the International Conference \"Central and South Asia: Regional Connectivity. Challenges and Opportunities\" in Tashkent, Uzbekistan on July 15-16, 2021. He expressed his honor to engage in discussions on the relevant topics at the high-level forum.",
    "Category": "Ministry News"
  },
  {
    "Title": "US Ambassador calls on the Foreign Minister",
    "Date": "15.07.2021",
    "Link": "https://mfa.gov.lk/en/us-fm/",
    "Summary": "The US Ambassador to Sri Lanka, Alaina Teplitz, met with Foreign Minister Dinesh Gunawardena on July 13. During the meeting, Minister Gunawardena expressed gratitude to the United States for their assistance. The discussion highlighted the strong diplomatic relations between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka and Australia to strengthen practical cooperation",
    "Date": "14.07.2021",
    "Link": "https://mfa.gov.lk/en/sl-australia/",
    "Summary": "Sri Lanka's Foreign Minister Dinesh Gunawardena met with Australian High Commissioner David Holly on July 13, 2021, to explore ways to enhance practical cooperation between the two countries across various sectors. They discussed strategies to strengthen relations, aiming to achieve mutual benefits and progress.",
    "Category": "Ministry News"
  },
  {
    "Title": "Viet Nam Sri Lanka Bilateral Relations to get a boost in Organic Farming, Investments in IT Sector and Tourism",
    "Date": "13.07.2021",
    "Link": "https://mfa.gov.lk/en/viet-nam-sm/",
    "Summary": "The Ambassador of Viet Nam in Colombo, Ho Thi Thanh Truc, met with State Minister of Regional Cooperation Tharaka Balasuriya at the Foreign Ministry premises on July 13, 2021. The discussions focused on enhancing bilateral relations through initiatives in organic farming, investments in the IT sector, and promoting tourism between Viet Nam and Sri Lanka.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Ministry takes steps to collect Buddhist information around the world",
    "Date": "13.07.2021",
    "Link": "https://mfa.gov.lk/en/foreign-ministry-takes-steps-to-collect-buddhist-information-around-the-world/",
    "Summary": "The Foreign Ministry is collecting and documenting information on Buddhist places of worship globally to expand Sri Lanka's relations with Buddhist countries. This initiative aims to enhance cultural ties and promote understanding among nations.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister meets Foreign Consul Generals in Sri Lanka",
    "Date": "13.07.2021",
    "Link": "https://mfa.gov.lk/en/foreign-minister-meets-foreign-consul-generals-in-sri-lanka/",
    "Summary": "The Foreign Minister of Sri Lanka met with Resident Consul Generals to seek their mediation in securing foreign aid for the country amid the COVID-19 pandemic. This request was made to address the impact of the epidemic on Sri Lanka.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Dinesh Gunawardena and Luxembourg Minister of Foreign Affairs Jean Asselborn review bilateral cooperation",
    "Date": "10.07.2021",
    "Link": "https://mfa.gov.lk/en/fm-luxembourg-fm/",
    "Summary": "Foreign Minister Dinesh Gunawardena and Luxembourg's Minister of Foreign Affairs Jean Asselborn have agreed to enhance bilateral cooperation by expanding into new mutually beneficial areas. The two ministers aim to strengthen their relations for mutual benefit.",
    "Category": "Ministry News"
  },
  {
    "Title": "Ambassador of Sri Lanka to Poland Dhammika Kumari Semasinghe presented Letters of Credence in Poland",
    "Date": "09.07.2021",
    "Link": "https://mfa.gov.lk/en/ambassador-of-sri-lanka-to-poland-dhammika-kumari-semasinghe-presented-letters-of-credence-in-poland/",
    "Summary": "Ambassador of Sri Lanka to Poland, Dhammika Kumari Semasinghe, presented the Letters of Credence to President Andrzej Duda at the Belvedere Palace in Warsaw on July 6, 2021. The formal presentation solidifies her role as the official representative of Sri Lanka in Poland.",
    "Category": "Ministry News"
  },
  {
    "Title": "Ambassador of Sri Lanka to Slovenia Majintha Jayesinghe presented Letters of Credence in Slovenia",
    "Date": "07.07.2021",
    "Link": "https://mfa.gov.lk/en/ambassador-of-sri-lanka-to-slovenia-majintha-jayesinghe-presented-letters-of-credence-in-slovenia/",
    "Summary": "Ambassador of Sri Lanka to Slovenia, Majintha Jayesinghe, presented the Letters of Credence to the President of the Republic of Slovenia, Borut Pahor, at the Presidential Palace in Ljubljana, accrediting as the Ambassador. This formal ceremony solidified Jayesinghe's official role as the Sri Lankan Ambassador to Slovenia.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Ministry discusses the environmental and economic impact of the X-Express Pearl fire",
    "Date": "07.07.2021",
    "Link": "https://mfa.gov.lk/en/foreign-ministry-discusses-the-environmental-and-economic-impact-of-the-x-express-pearl-fire/",
    "Summary": "The Foreign Ministry, led by Foreign Minister Dinesh Gunewardena, held a special discussion on July 1 to address the environmental and economic impact of the X-Press Pearl fire. The meeting focused on assessing the repercussions of the incident.",
    "Category": "Ministry News"
  },
  {
    "Title": "Communication on the impact on the working public by suspending the GSP+ facility by Trade Unions to the Foreign Minister",
    "Date": "07.07.2021",
    "Link": "https://mfa.gov.lk/en/communication-on-the-impact-on-the-working-public-by-suspending-the-gsp-facility-by-trade-unions-to-the-foreign-minister/",
    "Summary": "Trade unions have requested the Foreign Minister to address the impact on the working public if Sri Lanka loses the GSP+ facility due to resolutions passed in the European Union Parliament. Five major trade unions are concerned about how this suspension would affect the country's workforce.",
    "Category": "Ministry News"
  },
  {
    "Title": "Assistance is sought from the Food and Agriculture Organization (FAO) to conduct a survey on the composition of Sri Lankan soil and grant a soil card to farmers",
    "Date": "07.07.2021",
    "Link": "https://mfa.gov.lk/en/assistance-is-sought-from-the-food-and-agriculture-organization-fao-to-conduct-a-survey-on-the-composition-of-sri-lankan-soil-and-grant-a-soil-card-to-farmers/",
    "Summary": "The Food and Agriculture Organization (FAO) is assisting Sri Lanka in conducting a survey on the composition of its soil and issuing soil cards to farmers. This initiative aims to streamline the use of organic fertilizer in the country, as highlighted by the FAO.",
    "Category": "Ministry News"
  },
  {
    "Title": "New UNICEF Country Representative presents his Credentials to Foreign Minister",
    "Date": "06.07.2021",
    "Link": "https://mfa.gov.lk/en/unicef-credentials/",
    "Summary": "The new UNICEF Country Representative to Sri Lanka, Christian Skoog, presented his credentials to Foreign Minister Dinesh Gunawardena on July 5, 2022.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Secretary Colombage interviewed on ‘Ada Derana Get Real by Mahieash Johnney’",
    "Date": "06.07.2021",
    "Link": "https://mfa.gov.lk/en/fs-ada-derana/",
    "Summary": "Foreign Secretary Admiral Prof. Jayanath Colombage was interviewed by Mahieash Johnney on Ada Derana Get Real. The discussion focused on India's concerns regarding the Port City project. The interview took place on Episode 110 on July 5, 2021.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Dinesh Gunawardena virtually interacts with Sri Lankan expats in Singapore and Brunei Darussalam",
    "Date": "04.07.2021",
    "Link": "https://mfa.gov.lk/en/fm-singapore-brunei/",
    "Summary": "Foreign Minister Dinesh Gunawardena virtually engaged with Sri Lankan expats in Singapore and Brunei Darussalam, including community and business associations, the Maha Sangha, and religious leaders. The interaction was productive and aimed at fostering connections with overseas Sri Lankans.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka informs EU of action to review PTA and on progress in reconciliation",
    "Date": "01.07.2021",
    "Link": "https://mfa.gov.lk/en/sl-eu-pta/",
    "Summary": "Sri Lanka has informed the European Union about its actions to review the Prevention of Terrorism Act (PTA) and the progress made in reconciliation efforts. The update was provided by the Government of Sri Lanka during its routine engagement and dialogue with the EU through the Foreign Ministry.",
    "Category": "Ministry News"
  },
  {
    "Title": "New FAO Country Representative calls on the Foreign Minister",
    "Date": "28.06.2021",
    "Link": "https://mfa.gov.lk/en/new-fao-fm/",
    "Summary": "The newly appointed Country Representative of the Food and Agriculture Organization (FAO) to Sri Lanka, Vimlendra Sharan, met with Foreign Minister Dinesh Gunawardena at the Foreign Ministry on June 28, 2021. The meeting aimed to strengthen cooperation between FAO and Sri Lanka in the field of food and agriculture.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister meets the new WHO Representative to Sri Lanka",
    "Date": "25.06.2021",
    "Link": "https://mfa.gov.lk/en/fm-who/",
    "Summary": "Foreign Minister Dinesh Gunawardena welcomed Dr. Alaka Singh, the new WHO Representative to Sri Lanka, during a meeting at the Ministry today (25 June). The meeting aimed to strengthen collaboration between Sri Lanka and the WHO.",
    "Category": "Ministry News"
  },
  {
    "Title": "Statement by Foreign Minister Dinesh Gunawardena, at the NIICE Global Conclave 2021,  25 June, 2021",
    "Date": "25.06.2021",
    "Link": "https://mfa.gov.lk/en/fm-niice/",
    "Summary": "Foreign Minister Dinesh Gunawardena expressed gratitude to the Nepal Institute for International Cooperation and Engagement (NIICE) for inviting him to address the Inaugural Session at the NIICE Global Conclave 2021 on June 25, 2021.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Dinesh Gunawardena attends the Asia-Pacific High Level Conference on Belt and Road Cooperation",
    "Date": "24.06.2021",
    "Link": "https://mfa.gov.lk/en/asia-pacific-fm/",
    "Summary": "Foreign Minister Dinesh Gunawardena participated in the Asia-Pacific High Level Conference on Belt and Road Cooperation on June 23, 2021, emphasizing the need for increased cooperation among states and other participants. The conference was held virtually.",
    "Category": "Ministry News"
  },
  {
    "Title": "India and Sri Lanka agree to co-operate on common issues in the region",
    "Date": "22.06.2021",
    "Link": "https://mfa.gov.lk/en/sl-india/",
    "Summary": "India and Sri Lanka have agreed to cooperate on common regional issues. During a telephone conversation, Foreign Minister Dinesh Gunawardena and Indian External Affairs Minister discussed steps taken to enhance bilateral relations. The two countries aim to strengthen their ties for mutual benefit.",
    "Category": "Ministry News"
  },
  {
    "Title": "Ambassador of Sri Lanka to Kazakhstan Prof. M.D. Lamawansa presents credentials to Kazakhstan President",
    "Date": "21.06.2021",
    "Link": "https://mfa.gov.lk/en/ambassador-of-sri-lanka-to-kazakhstan-prof-m-d-lamawansa-presents-credentials-to-kazakhstan-president/",
    "Summary": "Ambassador of Sri Lanka to Kazakhstan Prof. M.D. Lamawansa presented his Letters of Credence to Kazakhstan President Kassym-Jomart Tokayev at a ceremony held at Acorda Presidentia. The event marked the official recognition of Lamawansa as Sri Lanka's representative to Kazakhstan.",
    "Category": "Ministry News"
  },
  {
    "Title": "Procument Notice – Ministry of Agriculture Sri Lanka",
    "Date": "19.06.2021",
    "Link": "https://mfa.gov.lk/en/procument-notice-ministry-of-agriculture-sri-lanka/",
    "Summary": "The Ministry of Agriculture in Sri Lanka has issued a procurement notice for the importation of organic fertilizer and natural minerals (Potassium Chloride) for paddy cultivation. This pre-qualification document is under the State Ministry of Production, Supply, and Regulation of Organic and Natural Fertilizer. Interested parties should take note of this opportunity for agricultural support.",
    "Category": "Ministry News"
  },
  {
    "Title": "The General Administration Customs of China (GACC) approves the Health Certificate for importing fisheries products to China",
    "Date": "18.06.2021",
    "Link": "https://mfa.gov.lk/en/the-general-administration-customs-of-china-gacc-approves-the-health-certificate-for-importing-fisheries-products-to-china/",
    "Summary": "The General Administration of Customs of China (GACC) has approved the Health Certificate for importing fisheries products to China. This approval allows the entry of approved fisheries and aquatic products into the lucrative Chinese market.",
    "Category": "Ministry News"
  },
  {
    "Title": "State Ministry of Regional Cooperation facilitates collaboration on Graphene applications with Russian Company",
    "Date": "18.06.2021",
    "Link": "https://mfa.gov.lk/en/smf-sl-russia/",
    "Summary": "The State Ministry of Regional Cooperation is facilitating collaboration on Graphene applications with a Russian company to harness Sri Lanka's natural resources for economic growth. This initiative aims to explore sustainable ways for the country's development.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Ministry hosts stakeholder meeting to brief foreign experts  on the MV-X Press Pearl Disaster",
    "Date": "18.06.2021",
    "Link": "https://mfa.gov.lk/en/x-press-pearl/",
    "Summary": "The European Union (EU)/ECHO, through the United Nations Environment Programme (UNEP), supports three technical experts to assist the Sri Lankan Government in assessing the impact of the MV-X Press Pearl Disaster. The experts were briefed during a stakeholder meeting hosted by the Foreign Ministry.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Dinesh Gunawardena and U.K. Minister for South Asia, Lord Ahmad discuss steps to enhance bilateral cooperation",
    "Date": "18.06.2021",
    "Link": "https://mfa.gov.lk/en/sl-uk/",
    "Summary": "Foreign Minister Dinesh Gunawardena and UK Minister for South Asia, Lord Tariq Ahmad discussed enhancing bilateral cooperation during a video call on Thursday, June 17. Both ministers agreed to explore opportunities to strengthen ties between their countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "The Korean Ambassador to Sri Lanka assures that the prospect to leave for work in Korea will be provided shortly",
    "Date": "17.06.2021",
    "Link": "https://mfa.gov.lk/en/korean-sl/",
    "Summary": "The Korean Ambassador to Sri Lanka, Woonjin Jeong, assured the Foreign Minister that necessary facilities for eligible Sri Lankan youth to work in Korea will be provided soon. This initiative aims to facilitate their travel and employment opportunities in Korea.",
    "Category": "Ministry News"
  },
  {
    "Title": "Compensation, salary dues and other redress to the family members of  deceased Sri Lankan migrant workers overseas",
    "Date": "16.06.2021",
    "Link": "https://mfa.gov.lk/en/compensation-sl/",
    "Summary": "The Consular Affairs Division of the Foreign Ministry held a ceremony at the Ministry Premises to provide compensation, salary dues, and other redress to the families of deceased Sri Lankan migrant workers abroad. Letters of compensation were handed over to the respective family members during the event.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka’s Observations on the Resolution adopted in the EU Parliament",
    "Date": "14.06.2021",
    "Link": "https://mfa.gov.lk/en/sl-eu/",
    "Summary": "Sri Lanka's Foreign Ministry expressed regret over the resolution adopted in the European Parliament on June 10, 2021, titled \"The Situation in Sri Lanka.\" The resolution addressed concerns about arrests made under the Prevention of Terrorism Act.",
    "Category": "Ministry News"
  },
  {
    "Title": "State Minister Balasuriya calls for Indian Investors to join Sri Lanka in pursuit of ‘Shared Prosperity’",
    "Date": "10.06.2021",
    "Link": "https://mfa.gov.lk/en/sm-india-invest/",
    "Summary": "State Minister for Regional Cooperation Tharaka Balasuriya has called on Indian investors to join Sri Lanka in pursuing 'shared prosperity' by investing in the country. The minister emphasized the opportunity for both nations to benefit from this partnership.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Gunawardena conveys appreciation to Australian counterpart for support to Sri Lanka",
    "Date": "10.06.2021",
    "Link": "https://mfa.gov.lk/en/fs-australia-sl/",
    "Summary": "Foreign Minister Dinesh Gunawardena expressed appreciation to Australian counterpart Marise Payne for their support to Sri Lanka in a recent telephone conversation on Wednesday.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka and Ethiopia discuss enhancement of political and economic ties at first ever bilateral consultations",
    "Date": "09.06.2021",
    "Link": "https://mfa.gov.lk/en/sl-ethiopia/",
    "Summary": "Sri Lanka and Ethiopia engaged in their first-ever bilateral consultations at the Foreign Ministry level on June 9, 2021. The discussions focused on enhancing political and economic ties between the two countries. Foreign Minister Dinesh Gunaratne represented Sri Lanka during the virtual meeting.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Gunawardena appreciates Russia’s support to Sri Lanka in conversation with Foreign Minister Lavrov",
    "Date": "09.06.2021",
    "Link": "https://mfa.gov.lk/en/sl-fm-rus/",
    "Summary": "Foreign Minister Dinesh Gunawardena expressed deep appreciation to Russian Foreign Minister Sergey Lavrov for Russia's support to Sri Lanka during a telephone conversation on June 7, 2021. Gunawardena highlighted the importance of the support extended by Russia.",
    "Category": "Ministry News"
  },
  {
    "Title": "Congratulatory Message extended by Foreign Minister Hon. Dinesh Gunawardena to Minister of Foreign Affairs of the Republic of Maldives Hon. Abdulla Shahid",
    "Date": "09.06.2021",
    "Link": "https://mfa.gov.lk/en/un-ga/",
    "Summary": "Foreign Minister Hon. Dinesh Gunawardena extended a congratulatory message to Minister of Foreign Affairs of the Republic of Maldives Hon. Abdulla Shahid. The message conveyed warm wishes and a commitment to strengthen bilateral relations between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "US Chargé d’ Affaires calls on the Foreign Minister",
    "Date": "08.06.2021",
    "Link": "https://mfa.gov.lk/en/us-foreign-minister/",
    "Summary": "US Chargé d’Affaires a.i. Martin T. Kelly visited Foreign Minister Dinesh Gunawardena at the Foreign Ministry in Colombo on June 8, 2021. During the meeting, the Foreign Minister expressed gratitude to the government and people of the US.",
    "Category": "Ministry News"
  },
  {
    "Title": "BIMSTEC Day message of Hon Foreign Minister Dinesh Gunawardena",
    "Date": "06.06.2021",
    "Link": "https://mfa.gov.lk/en/bimstec-fm-message/",
    "Summary": "Honorable Foreign Minister Dinesh Gunawardena delivered a message on BIMSTEC Day. The message was conveyed in multiple languages, including English, Sinhala, and Tamil, emphasizing the importance of regional cooperation.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka calls on US House Foreign Affairs Committee not to proceed with resolution on Sri Lanka",
    "Date": "05.06.2021",
    "Link": "https://mfa.gov.lk/en/sl-us-house-esolution/",
    "Summary": "Sri Lanka's Ambassador in Washington, Ravinatha Aryasinha, has formally requested the US House Foreign Affairs Committee not to proceed with Resolution H. RES. 413 on Sri Lanka, introduced by Congresswoman Deborah Ross. Sri Lanka urges the committee to reconsider the resolution.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka Deputy High Commissioner-designate to Deputy High Commissioner of Sri Lanka in Chennai-India assumed duties",
    "Date": "04.06.2021",
    "Link": "https://mfa.gov.lk/en/sri-lanka-deputy-high-commissioner-designate-to-deputy-high-commissioner-of-sri-lanka-in-chennai-india-assumed-duties/",
    "Summary": "Dr. Doraisamy Venkateshwaran has officially assumed duties as the Deputy High Commissioner of Sri Lanka in Chennai, India on April 12, 2021. He will be representing the Democratic Socialist Republic of Sri Lanka in South India.",
    "Category": "Ministry News"
  },
  {
    "Title": "Statement on the Resolution introduced by the US House of Representatives",
    "Date": "02.06.2021",
    "Link": "https://mfa.gov.lk/en/resolution-us-house/",
    "Summary": "The Foreign Ministry acknowledges Resolution No. H.RES.413 introduced in the US House of Representatives by Representative Deborah K. Ross on May 18, 2021, along with four other Representatives.",
    "Category": "Ministry News"
  },
  {
    "Title": "Virtual meeting between Foreign Minister Dinesh Gunawardena and Minister of State of United Arab Emirates Ahamed Ali Al Sayegh",
    "Date": "02.06.2021",
    "Link": "https://mfa.gov.lk/en/fm-sl-uae/",
    "Summary": "Sri Lankan Foreign Minister Dinesh Gunawardena and UAE Minister of State Ahamed Ali Al Sayegh held a virtual meeting on May 31, 2021. The discussion likely focused on bilateral relations and cooperation between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Permanent Missions of Sri Lanka and Thailand to the United Nations co-host a virtual commemoration for International Day of Vesak",
    "Date": "28.05.2021",
    "Link": "https://mfa.gov.lk/en/un-vesak/",
    "Summary": "The Permanent Missions of Sri Lanka and Thailand co-hosted a virtual commemoration for the International Day of Vesak at the United Nations on May 25, 2021. This event celebrated the occasion with various activities and discussions.",
    "Category": "Ministry News"
  },
  {
    "Title": "Message of Foreign Minister Dinesh Gunawardena at the commemoration of the International Day of Vesak",
    "Date": "27.05.2021",
    "Link": "https://mfa.gov.lk/en/message-fs-vesak-day/",
    "Summary": "Foreign Minister Dinesh Gunawardena delivered a message at the virtual commemoration of the International Day of Vesak hosted by the United Nations in Sri Lanka on May 26, 2021. The event was also attended by the Foreign Ministry and other Member States in Colombo.",
    "Category": "Ministry News"
  },
  {
    "Title": "The message of Hon. Dinesh Gunawardena, Foreign Minister of Sri Lanka for Vesak Day 2021",
    "Date": "26.05.2021",
    "Link": "https://mfa.gov.lk/en/the-message-of-hon-dinesh-gunawardena-foreign-minister-of-sri-lanka-for-vesak-day-2021/",
    "Summary": "Foreign Minister of Sri Lanka, Hon. Dinesh Gunawardena, delivered a message for Vesak Day 2021. The message emphasized the significance of Vesak and its teachings for peace and harmony. Gunawardena highlighted the importance of compassion and understanding in fostering unity among all communities.",
    "Category": "Ministry News"
  },
  {
    "Title": "The message of H.E. Gotabaya Rajapaksa President of Sri Lanka for Vesak Day 2021",
    "Date": "26.05.2021",
    "Link": "https://mfa.gov.lk/en/the-message-of-h-e-gotabaya-rajapaksa-president-of-sri-lanka-for-vesak-day-2021/",
    "Summary": "Sri Lankan President Gotabaya Rajapaksa delivered messages in English, Sinhala, and Tamil for Vesak Day 2021. The messages were shared to commemorate the occasion and convey his wishes to the people.",
    "Category": "Ministry News"
  },
  {
    "Title": "The video message (English) of Hon.Mahinda Rajapaksa Prime Minister of Sri Lanka for Vesak Day 2021",
    "Date": "25.05.2021",
    "Link": "https://mfa.gov.lk/en/the-video-message-english-of-hon-mahinda-rajapaksa-prime-minister-of-sri-lanka-for-vesak-day-2021/",
    "Summary": "Hon. Mahinda Rajapaksa, the Prime Minister of Sri Lanka, has released a video message in English for Vesak Day 2021. The video can be downloaded from the following link: https://wetransfer.com/downloads/0b25d673fdd1e9f7551990bfd76e93.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Ministry organizes several special Vesak programmes",
    "Date": "23.05.2021",
    "Link": "https://mfa.gov.lk/en/fm-vesak-programmes/",
    "Summary": "The Foreign Ministry, led by Foreign Minister Dinesh Gunawardena and Foreign Secretary Admiral Prof. Jayanath Colombage, has organized special religious programmes to mark the Vesak Festival this year. The initiatives aim to celebrate Vesak and promote cultural understanding.",
    "Category": "Ministry News"
  },
  {
    "Title": "Open Competitive Examination for Recruitment to Grade III of the Sri Lanka Foreign Service – 2020 (2021)",
    "Date": "21.05.2021",
    "Link": "https://mfa.gov.lk/en/slfs-open/",
    "Summary": "The Foreign Ministry announced amendments to the Gazette notification for the Open Competitive Examination for Grade III of the Sri Lanka Foreign Service – 2020 (2021). The Public Service Commission has approved changes to the advertising section. Interested candidates should review the updated requirements for the examination.",
    "Category": "Ministry News"
  },
  {
    "Title": "Suspension of all inbound passenger arrival to Sri Lanka",
    "Date": "20.05.2021",
    "Link": "https://mfa.gov.lk/en/suspension-of-all-inbound-passenger-arrival-to-sri-lanka/",
    "Summary": "Sri Lanka will suspend all inbound passenger arrivals.",
    "Category": "Ministry News"
  },
  {
    "Title": "The last batch of detained Sri Lankan migrant workers in Saudi Arabia returns to Sri Lanka",
    "Date": "19.05.2021",
    "Link": "https://mfa.gov.lk/en/sl-migrant-workers-saudi/",
    "Summary": "The repatriation of Sri Lankan migrant workers detained in Riyadh and Jeddah has concluded, with the last batch of 103 detainees returning to Sri Lanka on Saudi Airlines SV 786 on 19 May.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Dinesh Gunawardena meets EU Ambassadors in Colombo",
    "Date": "19.05.2021",
    "Link": "https://mfa.gov.lk/en/eu-fs-sri-lanka/",
    "Summary": "Foreign Minister Dinesh Gunawardena met with EU Ambassadors in Colombo on Tuesday, May 18, 2021. They discussed mutual interests, including EU-Sri Lanka cooperation, at the Foreign Ministry.",
    "Category": "Ministry News"
  },
  {
    "Title": "State Ministry of Regional Cooperation launches Creative Economy Programme",
    "Date": "18.05.2021",
    "Link": "https://mfa.gov.lk/en/smrc-creative-economy/",
    "Summary": "The State Ministry of Regional Cooperation has launched the Creative Economy Programme to boost the country's economy and showcase Sri Lanka's cultural heritage. The initiative aims to promote the creative economy sector and support local artists and entrepreneurs.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka concerned over escalating violence between Palestine and Israel",
    "Date": "17.05.2021",
    "Link": "https://mfa.gov.lk/en/sl-palestine-and-israel/",
    "Summary": "Sri Lanka is deeply concerned about the increasing violence between Palestine and Israel. The Foreign Minister recently expressed this concern to the Ambassador of Palestine in Sri Lanka, emphasizing the seriousness of the situation.",
    "Category": "Ministry News"
  },
  {
    "Title": "The message of H.E. Gotabaya Rajapaksa, President of Sri Lanka on the occasion of Ramazan",
    "Date": "14.05.2021",
    "Link": "https://mfa.gov.lk/en/the-message-of-h-e-gotabaya-rajapaksa-president-of-sri-lanka-on-the-occasion-of-ramazan/",
    "Summary": "President of Sri Lanka, H.E. Gotabaya Rajapaksa, has conveyed his message on the occasion of Ramazan in English, Sinhala, and Tamil versions. The message aims to reach a diverse audience and promote unity during this important religious period.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka Consulate General Office in Milan moves to new premises",
    "Date": "11.05.2021",
    "Link": "https://mfa.gov.lk/en/milan-consulate-sl/",
    "Summary": "The Consulate General of Sri Lanka in Milan, Italy is relocating to new premises at Via Giovanni da Udine, n. 15, 20156, Milan on May 18, 2021. This move aims to offer improved facilities for the Sri Lankan community in the area.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka opposes Bill 104 of Ontario Legislative Assembly",
    "Date": "10.05.2021",
    "Link": "https://mfa.gov.lk/en/sl-bill-104-of-ontario/",
    "Summary": "Sri Lanka's Foreign Minister Dinesh Gunawardena expressed deep concerns to Canadian High Commissioner David McKinnon about Ontario Legislative Assembly's Bill 104. The Sri Lankan government opposes the passing of this Private Member's Bill.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Ministry hosts webinar to review measures of Port State Control and Maritime Safety and Security in the Indian Ocean Region",
    "Date": "08.05.2021",
    "Link": "https://mfa.gov.lk/en/fm-hosts-webinar-iora/",
    "Summary": "The Foreign Ministry hosted a webinar to review Port State Control measures and Maritime Safety and Security in the Indian Ocean Region. The event featured international legal experts, including Prof. Rüdiger Wolfrum and the Director of the Norwegian Centre for the Law of the Sea. The webinar aimed to enhance cooperation and compliance in maritime regulations for the region.",
    "Category": "Ministry News"
  },
  {
    "Title": "High Commissioner Kananathan presents Credentials in Uganda",
    "Date": "08.05.2021",
    "Link": "https://mfa.gov.lk/en/high-commissioner-kananathan-presents-credentials-in-uganda/",
    "Summary": "High Commissioner Veluppillai Kananathan presented his Letter of Credence appointing him as the High Commissioner of Sri Lanka to Uganda, with residence in Kenya, to President Yoweri Kaguta Museveni.",
    "Category": "Ministry News"
  },
  {
    "Title": "Statement on Saudi Arabia’s Saudi Green and Middle East Green Initiatives",
    "Date": "07.05.2021",
    "Link": "https://mfa.gov.lk/en/sa-green/",
    "Summary": "Sri Lanka congratulates Saudi Arabia on its Saudi Green and Middle East Green Initiatives, aimed at fostering regional cooperation to address environmental challenges in Saudi Arabia and the broader region.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka condemns the terrorist attack on Speaker of the Maldivian Parliament and former President of Maldives Hon. Mohamed Nasheed",
    "Date": "07.05.2021",
    "Link": "https://mfa.gov.lk/en/sl-condemns-maldivian-terror-attack/",
    "Summary": "Sri Lanka has condemned the terrorist attack on Hon. Mohamed Nasheed, the Speaker of the Maldivian Parliament and former President of Maldives, on May 6, 2021. The government and people stand united against such acts of violence.",
    "Category": "Ministry News"
  },
  {
    "Title": "The Sixteenth Informal Meeting of the SAARC Finance Ministers",
    "Date": "07.05.2021",
    "Link": "https://mfa.gov.lk/en/the-sixteenth-informal-meeting-of-the-saarc-finance-ministers/",
    "Summary": "The Sixteenth Informal Meeting of the SAARC Finance Ministers took place virtually on May 5, 2021, from 1:30 PM to 3:30 PM (Manila Time). The meeting was held alongside the 54th Annual Meeting of the Asian Development Bank (ADB).",
    "Category": "Ministry News"
  },
  {
    "Title": "Ambassador of Sri Lanka presents credentials to the Netherlands based Organization for the Prohibition of Chemical Weapons (OPCW)",
    "Date": "06.05.2021",
    "Link": "https://mfa.gov.lk/en/ambassador-of-sri-lanka-presents-credentials-to-the-netherlands-based-organization-for-the-prohibition-of-chemical-weapons-opcw/",
    "Summary": "Ambassador Aruni Ranaraja of Sri Lanka presented her credentials to Dr. Fernando Arias, the Director General of the Organization for the Prohibition of Chemical Weapons (OPCW) in the Netherlands. She is now the Permanent Representative of Sri Lanka to the OPCW, strengthening diplomatic ties between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "The UK and Sri Lanka lead on ‘Nitrogen for Climate and Green Recovery’  27 – 29 April 2021, Colombo",
    "Date": "06.05.2021",
    "Link": "https://mfa.gov.lk/en/the-uk-and-sri-lanka-lead-on-nitrogen-for-climate-and-green-recovery-27-29-april-2021-colombo/",
    "Summary": "The UK and Sri Lanka co-hosted a virtual event titled \"Nitrogen for Climate and Green Recovery\" from April 27 to 29, 2021, in Colombo. The event was organized by the British High Commission in Colombo and the Government of the Democratic Socialist Republic of Sri Lanka, focusing on environmental initiatives.",
    "Category": "Ministry News"
  },
  {
    "Title": "Limited Services provided by the Consular Affairs Division",
    "Date": "04.05.2021",
    "Link": "https://mfa.gov.lk/en/limited-services-consular/",
    "Summary": "The Consular Affairs Division of the Foreign Ministry has adjusted its operating hours to 7.30 a.m. to 1.00 p.m. in compliance with recent health authority guidelines amid the ongoing COVID-19 situation. Please note the limited services available during this time.",
    "Category": "Ministry News"
  },
  {
    "Title": "Country Director of the World Food Programme (WFP) to Sri Lanka Abdur Rahim Siddiqui presents his credentials to Foreign Minister Dinesh Gunawardena",
    "Date": "04.05.2021",
    "Link": "https://mfa.gov.lk/en/country-dir-wfp-credentials/",
    "Summary": "Abdur Rahim Siddiqui, the Country Director of the World Food Programme (WFP) in Sri Lanka, presented his credentials to Foreign Minister Dinesh Gunawardena on May 3, 2021, at the Foreign Ministry. The Foreign Minister accepted the credentials during the official ceremony.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka strongly condemns the terror attack on civilians in Pul-e-Alam city in Afghanistan",
    "Date": "01.05.2021",
    "Link": "https://mfa.gov.lk/en/pul-e-alam-city-afghanistan/",
    "Summary": "Sri Lanka has strongly condemned the terror attack on civilians that occurred on April 30, 2021, in Pul-e-Alam city, Logar Province, Afghanistan. The attack targeted civilians, including students and children, in an act of indiscriminate violence.",
    "Category": "Ministry News"
  },
  {
    "Title": "The Message of H.E. Gotabaya Rajapaksa, President of Sri Lanka, on May Day",
    "Date": "01.05.2021",
    "Link": "https://mfa.gov.lk/en/the-message-of-h-e-gotabaya-rajapaksa-president-of-sri-lanka-on-may-day/",
    "Summary": "President of Sri Lanka, H.E. Gotabaya Rajapaksa, delivered a May Day message available in English, Sinhala, and Tamil versions.",
    "Category": "Ministry News"
  },
  {
    "Title": "Statement of His Excellency Gotabaya Rajapaksa, President of Sri Lanka  read by Honourable Dinesh Gunawardena, Foreign Minister",
    "Date": "30.04.2021",
    "Link": "https://mfa.gov.lk/en/statement-of-his-excellency-gotabaya-rajapaksa-president-of-sri-lanka-read-by-honourable-dinesh-gunawardena-foreign-minister/",
    "Summary": "His Excellency Gotabaya Rajapaksa, President of Sri Lanka's statement for the Pre-COP26 virtual event on Nitrogen for Climate and Green Recovery was read by Foreign Minister Dinesh Gunawardena in Colombo on 27-29 April 2021. In his address, President Rajapaksa expressed great pleasure in speaking to the distinguished participants about the importance of the event.",
    "Category": "Ministry News"
  },
  {
    "Title": "The first group of Sri Lankans held at the ‘Tarheel’ deportation camp in Riyadh to return to Sri Lanka tomorrow",
    "Date": "29.04.2021",
    "Link": "https://mfa.gov.lk/en/migrant-ksa/",
    "Summary": "The first group of Sri Lankans held at the 'Tarheel' deportation camp in Riyadh, Saudi Arabia, will return to Sri Lanka on Friday (30). Subsequent groups will also be returning to Sri Lanka in the following days.",
    "Category": "Ministry News"
  },
  {
    "Title": "Limited Services provided by the Consular Affairs Division",
    "Date": "28.04.2021",
    "Link": "https://mfa.gov.lk/en/limited-services-provided-by-the-consular-affairs-division/",
    "Summary": "The Consular Affairs Division of the Foreign Ministry is currently offering limited services to prioritize the health and safety of visitors amid the ongoing COVID-19 situation and recent health guidelines. Please be advised of the reduced service availability during this time.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka participates in a region-wide activity to consolidate joint COVID-19 cooperation",
    "Date": "27.04.2021",
    "Link": "https://mfa.gov.lk/en/fm-vir-m/",
    "Summary": "Sri Lanka's Foreign Minister Dinesh Gunawardena joined a video conference today with counterparts from China, Afghanistan, Bangladesh, Nepal, and Pakistan to discuss joint COVID-19 cooperation. The meeting aimed to strengthen collaboration in response to the pandemic.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka Ambassador to the Kingdom of the Netherlands, presents Letters of Credence to Majesty the King of the Netherlands",
    "Date": "25.04.2021",
    "Link": "https://mfa.gov.lk/en/sri-lanka-ambassador-to-the-kingdom-of-the-netherlands-presents-letters-of-credence-to-majesty-the-king-of-the-netherlands/",
    "Summary": "Sri Lanka's new Ambassador to the Kingdom of the Netherlands, Aruni Ranaraja, presented her credentials to King Willem-Alexander at the Royal Palace in The Hague on April 21, 2021. The ceremony marked the official start of her diplomatic mission in the Netherlands.",
    "Category": "Ministry News"
  },
  {
    "Title": "High Commissioner Srimal Wickremasinghe presents Credentials to the President of the Seychelles",
    "Date": "25.04.2021",
    "Link": "https://mfa.gov.lk/en/high-commissioner-srimal-wickremasinghe-presents-credentials-to-the-president-of-the-seychelles/",
    "Summary": "High Commissioner Srimal Wickremasinghe presented his Letters of Credence to the President of the Republic of Seychelles on April 20, 2021, at a ceremony held at the State House. The event was attended by the Minister o.",
    "Category": "Ministry News"
  },
  {
    "Title": "Speech by Foreign Minister Dinesh Gunawardena at Stakeholder Dialogue on Climate Change, Resilience & Just Recovery in the Sectors of Agriculture, Forestry & Biodiversity",
    "Date": "24.04.2021",
    "Link": "https://mfa.gov.lk/en/fm-stakeholder-dialogue-on-climate-change/",
    "Summary": "Foreign Minister Dinesh Gunawardena expressed gratitude to SLYCAN Trust and stakeholders for the invitation to speak at the Stakeholder Dialogue on Climate Change, Resilience & Just Recovery in Agriculture, Forestry & Biodiversity. The event aimed to address crucial issues in these sectors for a sustainable future.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lankan fishermen arrested in Myanmar will return to Sri Lanka tomorrow",
    "Date": "22.04.2021",
    "Link": "https://mfa.gov.lk/en/sl-fishermen-return/",
    "Summary": "The 12 Sri Lankan fishermen arrested in Myanmar will return to Sri Lanka tomorrow after the Foreign Ministry facilitated their repatriation. The fishermen were released following several rounds of talks with the Myanmar government.",
    "Category": "Ministry News"
  },
  {
    "Title": "Presentation of Credentials to the Director General of UNESCO by the Ambassador Prof.  Kshanika Hirimburegama",
    "Date": "22.04.2021",
    "Link": "https://mfa.gov.lk/en/presentation-of-credentials-to-the-director-general-of-unesco-by-the-ambassador-prof-kshanika-hirimburegama/",
    "Summary": "Ambassador Prof. Kshanika Hirimburegama presented her credentials to UNESCO Director General Audrey Azoulay at a ceremony in Paris on April 16, 2021. She assumed the role as Sri Lanka's Permanent Representative.",
    "Category": "Ministry News"
  },
  {
    "Title": "Ambassador Prof. Kshanika Hirimburegama presented Credentials to President of France Emmanuel Macron",
    "Date": "21.04.2021",
    "Link": "https://mfa.gov.lk/en/ambassador-prof-kshanika-hirimburegama-presented-credentials-to-president-of-france-emmanuel-macron/",
    "Summary": "Ambassador Prof. Kshanika Hirimburegama presented her credentials to President Emmanuel Macron on April 12, 2021, at the Elysee Palace in Paris. During the ceremony, President Macron encouraged all the Ambassadors.",
    "Category": "Ministry News"
  },
  {
    "Title": "High Commissioner S. Amarasekara presents Credentials to President of South Africa Cyril Ramaphosa",
    "Date": "20.04.2021",
    "Link": "https://mfa.gov.lk/en/high-commissioner-s-amarasekara-presents-credentials-to-president-of-south-africa-cyril-ramaphosa/",
    "Summary": "High Commissioner S. Amarasekara presented his Letters of Credence to President Cyril Ramaphosa of South Africa on April 14, 2021, at the Sefako M Makgatho Presidential Guest House in Pretoria.",
    "Category": "Ministry News"
  },
  {
    "Title": "Virtual Address by H.E. the President of Sri Lanka at the BOAO Forum for Asia 2021",
    "Date": "20.04.2021",
    "Link": "https://mfa.gov.lk/en/boao-forum/",
    "Summary": "President of Sri Lanka delivered a virtual address at the BOAO Forum for Asia 2021. The speech took place on April 20, 2021, addressing key issues at the forum.",
    "Category": "Ministry News"
  },
  {
    "Title": "Dr. Palitha Kohona presents Credentials to the Chinese President",
    "Date": "15.04.2021",
    "Link": "https://mfa.gov.lk/en/dr-palitha-kohona-presents-credentials-to-the-chinese-president/",
    "Summary": "Ambassador Dr. Palitha Kohona presented his Letters of Credence to Chinese President Xi Jinping on April 14, 2021, at the Great Hall of the People in Beijing. This formal exchange signifies the official start of his diplomatic role representing his country in China.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sinhala and Tamil New Year message of  President Gotabaya Rajapaksa",
    "Date": "14.04.2021",
    "Link": "https://mfa.gov.lk/en/sinhala-and-tamil-new-year-message-of-president-gotabaya-rajapaksa/",
    "Summary": "President Gotabaya Rajapaksa has conveyed his Sinhala and Tamil New Year message to the nation, emphasizing unity and prosperity. The message was delivered in both Sinhala and Tamil languages to reach a wider audience and promote cultural harmony.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Secretary Admiral Prof. Jayanath Colombage’s Interview on “CGTN Dialogue” – 12 April 2021",
    "Date": "13.04.2021",
    "Link": "https://mfa.gov.lk/en/fs-cgtn-dialogue/",
    "Summary": "Foreign Secretary Admiral Prof. Jayanath Colombage discussed Sri Lanka's COVID-19 situation, post-pandemic economic revival, and vaccination program during an interview on \"CGTN Dialogue\" on 12 April 2021.",
    "Category": "Ministry News"
  },
  {
    "Title": "Special Representative of Prime Minister Mahinda Rajapaksa visits Oman",
    "Date": "12.04.2021",
    "Link": "https://mfa.gov.lk/en/special-representative-of-prime-minister-mahinda-rajapaksa-visits-oman/",
    "Summary": "Special Representative of Sri Lankan Prime Minister Mahinda Rajapaksa, State Minister of Finance Ajith Nivard Cabraal, visited Oman from April 7 to 10, 2021.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister signs the Book of Condolence",
    "Date": "12.04.2021",
    "Link": "https://mfa.gov.lk/en/fm-signs-condolence-book/",
    "Summary": "Foreign Minister Dinesh Gunawardena signed the Book of Condolence for the passing of His Royal Highness the Prince Philip, Duke of Edinburgh on behalf of President Gotabaya Rajapaksa and the Government.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Dinesh Gunawardena discusses EU-Sri Lanka cooperation with EU Ambassadors in Colombo",
    "Date": "10.04.2021",
    "Link": "https://mfa.gov.lk/en/fm_with-eu-embassadors/",
    "Summary": "Foreign Minister Dinesh Gunawardena met with EU Ambassadors in Colombo on Friday to discuss cooperation between the EU and Sri Lanka. The meeting took place at the Foreign Ministry, where Gunawardena briefed them on political and economic developments.",
    "Category": "Ministry News"
  },
  {
    "Title": "Gazette notification to recruit 40 eligible candidates to join the Sri Lanka Foreign Service (SLFS)",
    "Date": "09.04.2021",
    "Link": "https://mfa.gov.lk/en/gazette-notification-to-recruit-40-eligible-candidates-to-join-the-sri-lanka-foreign-service-slfs/",
    "Summary": "The Foreign Ministry has announced a gazette notification for the recruitment of 40 eligible candidates to join the Sri Lanka Foreign Service (SLFS). The Gazette Notification No. 2,223 dated 9 is now published, inviting qualified individuals to apply for the positions. Interested candidates can find in the official notification.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka and New Zealand inaugurate Foreign Ministry Consultations",
    "Date": "09.04.2021",
    "Link": "https://mfa.gov.lk/en/sri-lanka-and-new-zealand-fm-consultations/",
    "Summary": "Sri Lanka and New Zealand inaugurated their First Round of Foreign Ministry Consultations virtually on 08 April 2021. The meeting was co-chaired by the Acting Director General of the East Asia Division of the Foreign Ministry. This initiative aims to strengthen diplomatic ties between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka and Afghanistan sign MoU on Establishment of a Political Consultations Mechanism between Foreign Ministry of Sri Lanka and the Ministry of Foreign Affairs of Afghanistan",
    "Date": "07.04.2021",
    "Link": "https://mfa.gov.lk/en/sl-afghan-mou/",
    "Summary": "Sri Lanka and Afghanistan signed a Memorandum of Understanding (MoU) today to establish a Political Consultations Mechanism between their respective Foreign Ministries. This agreement aims to enhance diplomatic cooperation and communication between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Entry Requirement for Sri Lankans Lifted",
    "Date": "06.04.2021",
    "Link": "https://mfa.gov.lk/en/entry-requirement-for-sri-lankans-lifted/",
    "Summary": "Sri Lankan entry requirements have been lifted following a review by the Foreign Ministry under President Gotabaya Rajapaksa's directive on April 6, 2021. This change aims to provide relief for prospective Lankan returnees, making it easier for them to enter the country.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka Embassy in Oman repatriates another group of 248 stranded Sri Lankan Migrant Workers back home",
    "Date": "05.04.2021",
    "Link": "https://mfa.gov.lk/en/sri-lanka-embassy-in-oman-repatriates-another-group-of-248-stranded-sri-lankan-migrant-workers-back-home/",
    "Summary": "The Sri Lanka Embassy in Oman, in collaboration with the President's Secretariat and the Foreign Ministry of Sri Lanka, facilitated the repatriation of 248 stranded Sri Lankan migrant workers from Muscat. The special arrangements ensured their safe return home.",
    "Category": "Ministry News"
  },
  {
    "Title": "The 5th Evacuation Flight from Lebanon 31 March 2021",
    "Date": "05.04.2021",
    "Link": "https://mfa.gov.lk/en/the-5th-evacuation-flight-from-lebanon-31-march-2021/",
    "Summary": "On March 31, 2021, the Embassy of Sri Lanka in Lebanon, in partnership with the Presidential Secretariat, Foreign Ministry, and Sri Lankan Airlines, successfully repatriated 175 Sri Lankans, including 4 children, on the 5th evacuation flight from Lebanon.",
    "Category": "Ministry News"
  },
  {
    "Title": "Easter Sunday Message of President Gotabaya Rajapaksa",
    "Date": "04.04.2021",
    "Link": "https://mfa.gov.lk/en/presidents-easter-sunday-message/",
    "Summary": "President Gotabaya Rajapaksa delivered an Easter Sunday message in English. The message aimed to convey his wishes for a peaceful and prosperous future for all citizens.",
    "Category": "Ministry News"
  },
  {
    "Title": "The Chinese and Russian Ambassadors call on the Foreign Minister",
    "Date": "02.04.2021",
    "Link": "https://mfa.gov.lk/en/fm-chinese-russian-emb/",
    "Summary": "Foreign Minister Dinesh Gunawardena met with the Russian Ambassador Yuri Meteriy and Chinese Ambassador Qi Zhenhong at the Foreign Ministry last Wednesday. The ambassadors discussed matters of mutual interest and cooperation with the Sri Lankan government.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Dinesh Gunawardena elected to chair the 17th Session of the Ministerial Meeting of BIMSTEC",
    "Date": "02.04.2021",
    "Link": "https://mfa.gov.lk/en/conclusion-of-bimstec-2/",
    "Summary": "Sri Lanka's Foreign Minister Dinesh Gunawardena has been elected to chair the 17th Session of the Ministerial Meeting of BIMSTEC, the Bay of Bengal Initiative for Multi-Sectoral Technical and Economic Cooperation. Gunawardena will lead the discussions at the upcoming meeting as the appointed chair.",
    "Category": "Ministry News"
  },
  {
    "Title": "State Minister of Regional Cooperation meets Chinese Ambassador at Foreign Ministry",
    "Date": "01.04.2021",
    "Link": "https://mfa.gov.lk/en/sm-and-chinese-ambassador/",
    "Summary": "State Minister of Regional Cooperation Tharaka Balasuriya met with the Chinese Ambassador HE Qi Zhenhong at the Foreign Ministry on April 1, 2021. The meeting was a courtesy call to discuss cooperation between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister calls for early conclusion of Charter of the Association of BIMSTEC Speakers and Parliamentarians at the 17th BIMSTEC Ministerial Meeting",
    "Date": "01.04.2021",
    "Link": "https://mfa.gov.lk/en/conclusion-of-bimstec/",
    "Summary": "Foreign Minister Dinesh Gunawardena urged for the prompt finalization of the Charter of the Association of BIMSTEC Speakers and Parliamentarians during his welcome speech at the 17th BIMSTEC Ministerial Meeting.",
    "Category": "Ministry News"
  },
  {
    "Title": "Appointment of the Ambassador of the Socialist Republic of Viet Nam to Sri Lanka",
    "Date": "30.03.2021",
    "Link": "https://mfa.gov.lk/en/amb-of-viet-nam/",
    "Summary": "The Government of the Socialist Republic of Viet Nam, with the approval of the Government of Sri Lanka, has appointed Mrs. Ho Thi Thanh Truc as the Ambassador Extraordinary and Plenipotentiary to Sri Lanka. Mrs. Truc will represent Viet Nam in her new diplomatic role in Sri Lanka.",
    "Category": "Ministry News"
  },
  {
    "Title": "Interview of the Foreign Secretary on Hydepark of Ada Derana – 27 March 2021",
    "Date": "30.03.2021",
    "Link": "https://mfa.gov.lk/en/interview-of-the-foreign-secretary-on-hydepark-of-ada-derana-27-march-2021/",
    "Summary": "Foreign Secretary Admiral Prof. Jayanath Colombage discussed the recent UNHRC draft resolution on Sri Lanka and the country's future direction in an interview on Hydepark of Ada Derana on March 27, 2021. The interview provided insights into Sri Lanka's response to the resolution and its strategic plans moving forward.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka’s Envoy to the Kingdom of Sweden presents credentials",
    "Date": "28.03.2021",
    "Link": "https://mfa.gov.lk/en/sri-lankas-envoy-to-the-kingdom-of-sweden-presents-credentials/",
    "Summary": "Ambassador Dharshana M. Perera has presented his credentials as Sri Lanka’s Envoy to the Kingdom of Sweden to His Majesty King Carl XVI Gustaf through a special arrangement with the Protocol Department.",
    "Category": "Ministry News"
  },
  {
    "Title": "Leading the IORA Maritime Safety and Security Working Group, Sri Lanka finalizes the second Work Plan for 2022 to 2026",
    "Date": "26.03.2021",
    "Link": "https://mfa.gov.lk/en/smf-iora-2021/",
    "Summary": "Sri Lanka, leading the IORA Maritime Safety and Security Working Group, finalized the second Work Plan for 2022 to 2026 during the 2nd Meeting of the IORA Working Group on Maritime Safety and Security held virtually on March 18-19, 2021. Delegates representing the Indian Ocean region participated in the meeting.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Gunawardena appreciates support of countries at UNHRC",
    "Date": "23.03.2021",
    "Link": "https://mfa.gov.lk/en/media-briefing-unhrc/",
    "Summary": "Foreign Minister Dinesh Gunawardena briefed the media today on the outcome of the UNHRC sessions in Geneva, expressing appreciation for the support received from various countries. The media conference held at the Foreign Ministry highlighted the importance of international backing in addressing key issues.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Dinesh Gunawardena meets CDA of Romania to review bilateral cooperation",
    "Date": "23.03.2021",
    "Link": "https://mfa.gov.lk/en/fm-romania-23-03-21/",
    "Summary": "Foreign Minister Dinesh Gunawardena met with Romania's Chargé d’Affaires, Ambassador Victor Chiujdea, to review bilateral cooperation at the Foreign Ministry in Colombo on Friday, 19 March. The discussions focused on enhancing collaboration between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Dinesh Gunawardena meets Afghanistan Ambassador to discuss bilateral issues",
    "Date": "22.03.2021",
    "Link": "https://mfa.gov.lk/en/fm-afghanistan-23-03-21/",
    "Summary": "Foreign Minister Dinesh Gunawardena met with Afghanistan Ambassador Ashraf Haidari in Sri Lanka on March 19, 2021, at the Foreign Ministry to discuss bilateral issues. During the meeting, Ambassador Haidari provided a briefing on key matters of mutual interest.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Secretary’s Interview on CNN-News18, India – 18 March 2021",
    "Date": "21.03.2021",
    "Link": "https://mfa.gov.lk/en/foreign-secretarys-interview-on-cnn-news18-india-18-march-2021/",
    "Summary": "Foreign Secretary Admiral Prof. Jayanath Colombage was interviewed on CNN-News18, India on 18 March 2021. The interview can be viewed at the following links: https://t.co/U2puy4BA2D. He discussed important topics during the interview.",
    "Category": "Ministry News"
  },
  {
    "Title": "Joint Communique  On the State Visit of H. E. Mahinda Rajapaksa, Prime Minister of the Democratic Socialist Republic of Sri Lanka to the People’s Republic of Bangladesh on 19 – 20 March 2021",
    "Date": "20.03.2021",
    "Link": "https://mfa.gov.lk/en/joint-communique/",
    "Summary": "During the State Visit on 19-20 March 2021, H. E. Mahinda Rajapaksa, Prime Minister of Sri Lanka, visited Bangladesh at the invitation of H. E. Sheikh Hasina, Prime Minister.",
    "Category": "Ministry News"
  },
  {
    "Title": "The UK High Court quashes the judgement of the Westminster Magistrates’ Court against former Minister Counsellor (Defence) of the Sri Lanka High Commission in London Major Gen Priyanka Fernando",
    "Date": "20.03.2021",
    "Link": "https://mfa.gov.lk/en/uk-high_court-20-03-21/",
    "Summary": "The UK High Court has overturned the judgement of the Westminster Magistrates’ Court against Major Gen Priyanka Fernando, the former Minister Counsellor (Defence) of the Sri Lanka High Commission in London. The appeal made by Major Gen Priyanka Fernando was successful, resulting in the quashing of the previous ruling.",
    "Category": "Ministry News"
  },
  {
    "Title": "Allegations made against us at the Geneva Human Rights Council are politically biased  – Foreign Minister Dinesh Gunawardena",
    "Date": "19.03.2021",
    "Link": "https://mfa.gov.lk/en/allegations-made-against-us-at-the-geneva-human-rights-council-are-politically-biased-foreign-minister-dinesh-gunawardena/",
    "Summary": "Foreign Minister Dinesh Gunawardena has stated that the allegations of human rights abuses in Sri Lanka at the Geneva Human Rights Council are politically biased, with countries like the UK, Canada, and Germany using them for political motives. Gunawardena believes these actions are aimed at concealing the truth.",
    "Category": "Ministry News"
  },
  {
    "Title": "Opening Remarks by Admiral Professor Jayanath Colombage, Foreign Secretary, on the occasion of the  Second Meeting of the IORA Working Group on Maritime Safety and Security Colombo, Sri Lanka,  18th March 2021",
    "Date": "18.03.2021",
    "Link": "https://mfa.gov.lk/en/foreign-secretary-18-03-21/",
    "Summary": "Admiral Professor Jayanath Colombage, Foreign Secretary, delivered opening remarks at the Second Meeting of the IORA Working Group on Maritime Safety and Security in Colombo, Sri Lanka on March 18, 2021. Attendees included Hannah Singer, the U.N. Resident Coordinator in Colombo, and Dr. Gatot H. Gunawan, Acting Secretary General of IORA, along with members of the Diplomatic Corps.",
    "Category": "Ministry News"
  },
  {
    "Title": "Handing over the cheque of Compensation to the Next of Kin of late Mr. K P Manjula Antony",
    "Date": "18.03.2021",
    "Link": "https://mfa.gov.lk/en/handing-over-the-cheque-of-compensation-to-the-next-of-kin-of-late-mr-k-p-manjula-antony/",
    "Summary": "Foreign Minister Dinesh Gunawardena presented a compensation cheque of SLRs. 2,653,125.00 to the spouse of late Mr. K P Manjula Antony on March 16, 2021, at the Foreign Ministry premises. The compensation was handed over as a gesture of support to the next of kin.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Dinesh Gunawardena meets with Pakistan High Commissioner in Colombo",
    "Date": "17.03.2021",
    "Link": "https://mfa.gov.lk/en/foreign-minister-dinesh-gunawardena-meets-with-pakistan-high-commissioner-in-colombo/",
    "Summary": "Foreign Minister Dinesh Gunawardena met with Pakistan High Commissioner Major General (Retd.) Muhammad Saad Khattak on March 16, 2021, at the Foreign Ministry in Colombo. The meeting aimed to enhance bilateral relations between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Media Statement of the Foreign Ministry-16 March 2021",
    "Date": "16.03.2021",
    "Link": "https://mfa.gov.lk/en/media-statement-16-03-2021/",
    "Summary": "The Foreign Ministry addressed recent media reports on a proposed ban on burqa and niqab in Sri Lanka. Foreign Secretary Admiral Prof. Jayanath Colombage clarified that no decision has been made regarding the ban.",
    "Category": "Ministry News"
  },
  {
    "Title": "The present government is committed to developing the country as an independent, sovereign, free and unitary state – Minister Dinesh Gunawardena",
    "Date": "14.03.2021",
    "Link": "https://mfa.gov.lk/en/consular-trinco/",
    "Summary": "Foreign Minister Dinesh Gunawardena affirmed the government's dedication to developing the country as an independent, sovereign, free, and unitary state. He emphasized this commitment during a recent speech, highlighting the importance of preserving these fundamental principles for the nation's progress.",
    "Category": "Ministry News"
  },
  {
    "Title": "Media Statement-The Embassy of Sri Lanka in Beijing , 13 March 2021",
    "Date": "13.03.2021",
    "Link": "https://mfa.gov.lk/en/media-statement-the-embassy-of-sri-lanka-in-beijing-13-march-2021/",
    "Summary": "The Embassy of Sri Lanka in Beijing discovered the misuse of the Sri Lankan flag image on a \"Non-Slip Doormat\" made in China. Upon receiving this information, the Embassy promptly notified the Ministry of Foreign Affairs. The Embassy took immediate action to address the issue.",
    "Category": "Ministry News"
  },
  {
    "Title": "Ambassadors’ Forum of Sri Lanka launches the book Geneva Crisis – The Way Forward",
    "Date": "12.03.2021",
    "Link": "https://mfa.gov.lk/en/launches-book-geneva-crisis/",
    "Summary": "The Ambassadors’ Forum of Sri Lanka launched the book \"Geneva Crisis – The Way Forward\" today at the Foreign Ministry. The launch event was attended by Foreign Minister Dinesh Gunawardena and Foreign Secretary Admiral Professor.",
    "Category": "Ministry News"
  },
  {
    "Title": "Media Statement of the Foreign Ministry-12 March 2021",
    "Date": "12.03.2021",
    "Link": "https://mfa.gov.lk/en/media-statement-12-03-2021/",
    "Summary": "The Foreign Ministry issued a statement addressing reports of a \"Sri Lanka Flag Non-Slip Doormat\" being sold on Amazon. Foreign Secretary Admiral Prof. Jayanath Colombage commented on the matter, emphasizing the need for respect towards national symbols.",
    "Category": "Ministry News"
  },
  {
    "Title": "Ambassador Prof. M. D. Lamawansa presents Credentials to the President of Armenia",
    "Date": "12.03.2021",
    "Link": "https://mfa.gov.lk/en/ambassador-prof-m-d-lamawansa-presents-credentials-to-the-president-of-armenia/",
    "Summary": "Ambassador Prof. M. D. Lamawansa commenced his duties by presenting his Letter of Credence to President Armen Sarkissian of Armenia on February 23, 2021. This marks the official beginning of his role as Ambassador Extraordina.",
    "Category": "Ministry News"
  },
  {
    "Title": "Security Council Arria-Formula Meeting  “Call to Lead by Example: Ensuring the Full, Equal and Meaningful Participation of Women in UN-led Peace Processes”",
    "Date": "11.03.2021",
    "Link": "https://mfa.gov.lk/en/security-council-arria-formula-meeting-call-to-lead-by-example-ensuring-the-full-equal-and-meaningful-participation-of-women-in-un-led-peace-processes/",
    "Summary": "The Security Council held an Arria-Formula Meeting on \"Ensuring the Full Participation of Women in UN-led Peace Processes.\" H.E. Mohan Peiris, Permanent Representative of Sri Lanka, thanked and congratulated the co-chairs Mexico and Ireland for their leadership in the meeting. The event aimed to promote women's meaningful involvement in peace processes.",
    "Category": "Ministry News"
  },
  {
    "Title": "Regional Consular Office of the Foreign Ministry will open in Trincomalee",
    "Date": "11.03.2021",
    "Link": "https://mfa.gov.lk/en/consular-office-trinco/",
    "Summary": "The Regional Consular Office of the Foreign Ministry will be inaugurated in Trincomalee on Saturday, 13 March 2021, at 2:00 pm. Foreign Minister Dinesh Gunawardena and Foreign Secretary Admiral Prof. Jayanath Colombage will lead the ceremonial launch.",
    "Category": "Ministry News"
  },
  {
    "Title": "The Message of H.E. Gotabaya Rajapaksa, President of Sri Lanka on the occasion of Maha Shivarathri Celebration",
    "Date": "11.03.2021",
    "Link": "https://mfa.gov.lk/en/the-message-of-h-e-gotabaya-rajapaksa-president-of-sri-lanka-on-the-occasion-of-maha-shivarathri-celebration/",
    "Summary": "President of Sri Lanka, H.E. Gotabaya Rajapaksa, delivered a message on the occasion of Maha Shivarathri Celebration. The message was available in English, Sinhala, and Tamil languages, emphasizing cultural inclusivity and unity among communities.",
    "Category": "Ministry News"
  },
  {
    "Title": "Media Statement of the Foreign Ministry – 10 March 2021",
    "Date": "10.03.2021",
    "Link": "https://mfa.gov.lk/en/media-statement-13/",
    "Summary": "The Foreign Ministry issued a statement addressing reports about an invitation extended to the Foreign Minister of Myanmar to attend the 17th BIMSTEC Ministerial Meeting on April 1, 2021, hosted virtually in Colombo.",
    "Category": "Ministry News"
  },
  {
    "Title": "Ambassador – designate to Thailand C.A. Chaminda I. Colonne presents open copy of the Letter of Credence",
    "Date": "08.03.2021",
    "Link": "https://mfa.gov.lk/en/ambassador-designate-to-thailand-c-a-chaminda-i-colonne-presents-open-copy-of-the-letter-of-credence/",
    "Summary": "Ambassador-designate to Thailand C.A. Chaminda I. Colonne met with Director General Chittipat Tongprasroeth of the Department of Protocol at the Ministry of Foreign Affairs on March 3, 2021. During the meeting, he presented an open copy of his Letter of Credence.",
    "Category": "Ministry News"
  },
  {
    "Title": "Consultations on the Seventh Biennial Review of the United Nations Global Counter-Terrorism Strategy",
    "Date": "08.03.2021",
    "Link": "https://mfa.gov.lk/en/consultations-on-the-seventh-biennial-review-of-the-united-nations-global-counter-terrorism-strategy/",
    "Summary": "Consultations on the Seventh Biennial Review of the United Nations Global Counter-Terrorism Strategy were held at the General Assembly Hall, UNHQ on Friday, 05 March 2021. H.E. Mohan Peiris, the Permanent Representative of Sri Lanka to the United Nations, delivered a statement during the in-person meeting.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Secretary Colombage interviewed on ‘Talk to Al Jazeera’",
    "Date": "06.03.2021",
    "Link": "https://mfa.gov.lk/en/foreign-secretary-colombage-interviewed-on-talk-to-al-jazeera/",
    "Summary": "Foreign Secretary Admiral Prof. Jayanath Colombage was interviewed on 'Talk to Al Jazeera' on March 6, 2021. The interview is available for viewing at https://www.aljazeera.com/program/ta.",
    "Category": "Ministry News"
  },
  {
    "Title": "Ambassadors of Bangladesh, Brazil, Korea and Japan meet Foreign Minister",
    "Date": "04.03.2021",
    "Link": "https://mfa.gov.lk/en/ambassadors-meet-fm-4-3-21/",
    "Summary": "Ambassadors from Bangladesh, Brazil, Korea, and Japan met with Foreign Minister Dinesh Gunawardena individually at the Foreign Ministry in Colombo on the 3rd. The meetings aimed to discuss bilateral relations and cooperation between the respective countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Newly appointed Sri Lanka Ambassador to the Kingdom of Thailand C.A. Chaminda I. Colonne assumes duties",
    "Date": "02.03.2021",
    "Link": "https://mfa.gov.lk/en/newly-appointed-sri-lanka-ambassador-to-the-kingdom-of-thailand-c-a-chaminda-i-colonne-assumes-duties/",
    "Summary": "C.A. Chaminda I. Colonne, the newly appointed Sri Lanka Ambassador to the Kingdom of Thailand, began his duties on March 1, 2021, at the Sri Lanka Embassy in Bangkok. The Embassy is concurrently accredited to other countries in the region.",
    "Category": "Ministry News"
  },
  {
    "Title": "Statement by Hon. Foreign Minister of Sri Lanka  Agenda Item 2: Interactive Dialogue on the OHCHR Report ‘Promoting reconciliation, accountability and human rights in Sri Lanka’ (A/HRC/46/20)  24th February 2021",
    "Date": "24.02.2021",
    "Link": "https://mfa.gov.lk/en/statement-by-fm-unhrc/",
    "Summary": "During the interactive dialogue on the OHCHR Report 'Promoting reconciliation, accountability, and human rights in Sri Lanka,' the Hon. Foreign Minister of Sri Lanka addressed the Resolution 30/1 and 40/1. The report presented today is a result of these resolutions, as acknowledged by the Government of Sri Lanka.",
    "Category": "Ministry News"
  },
  {
    "Title": "Pakistan Minister of Foreign Affairs Makhdoom Shah Mehmood Qureshi calls on Foreign Minister Dinesh Gunawardena at the Foreign Ministry",
    "Date": "24.02.2021",
    "Link": "https://mfa.gov.lk/en/pakistan-sl-fm-02-2021/",
    "Summary": "Pakistan's Minister of Foreign Affairs, Makhdoom Shah Mehmood Qureshi, visited the Foreign Ministry today, 24 February 2021, where he met with Foreign Minister Dinesh Gunawardena. The meeting aimed to discuss bilateral relations and cooperation between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Joint Communiqué on the visit of H.E. Imran Khan, Prime Minister of Pakistan to Sri Lanka on 23-24 February 2021",
    "Date": "24.02.2021",
    "Link": "https://mfa.gov.lk/en/joint-communique-on-fm-24-02-2021/",
    "Summary": "Prime Minister Imran Khan of Pakistan visited Sri Lanka on 23-24 February 2021 at the invitation of Prime Minister Mahinda Rajapaksa. The two leaders engaged in discussions during the two-day official visit.",
    "Category": "Ministry News"
  },
  {
    "Title": "Statement by Hon Foreign Minister of Sri Lanka  High Level Segment of the  46th Session of the UN Human Rights Council  23 February 2021, Geneva",
    "Date": "23.02.2021",
    "Link": "https://mfa.gov.lk/en/fm-23-feb-2021-geneva/",
    "Summary": "During the High Level Segment of the 46th Session of the UN Human Rights Council on February 23, 2021, the Hon Foreign Minister of Sri Lanka addressed the audience, acknowledging the report published by the Office of the High Commissioner for Human Rights (OHCHR). The statement highlighted the country's commitment to addressing human rights concerns.",
    "Category": "Ministry News"
  },
  {
    "Title": "2021 ECOSOC Special Meeting  Reimagining Equality: Eliminating racism, xenophobia and discrimination  for all in the decade of action for the SDGs",
    "Date": "22.02.2021",
    "Link": "https://mfa.gov.lk/en/2021-ecosoc-special-meeting-reimagining-equality-eliminating-racism-xenophobia-and-discrimination-for-all-in-the-decade-of-action-for-the-sdgs/",
    "Summary": "At the 2021 ECOSOC Special Meeting, H.E. Mohan Peiris, the Permanent Representative of Sri Lanka to the United Nations, addressed the theme \"Reimagining Equality: Eliminating racism, xenophobia, and discrimination for all in the decade of action for the SDGs\" on Thursday, 18 February 2021, during a virtual session. Peiris highlighted the historical challenges posed by racism, xenophobia, and discrimination.",
    "Category": "Ministry News"
  },
  {
    "Title": "Pakistan Prime Minister Imran Khan to visit Sri Lanka next week",
    "Date": "19.02.2021",
    "Link": "https://mfa.gov.lk/en/pakistan-pm-sri-lanka/",
    "Summary": "Pakistan's Prime Minister Imran Khan will visit Sri Lanka on 23-24 February 2021 at the invitation of Prime Minister Mahinda Rajapaksa. The visit aims to strengthen bilateral ties between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Turkey Donates Ventilators and Protective Equipment to Sri Lanka to Address Covid-19 Challenges",
    "Date": "18.02.2021",
    "Link": "https://mfa.gov.lk/en/turkey-donates/",
    "Summary": "Turkey has donated 10 ventilators and a shipment of Personal Protective Equipment (PPE) to Sri Lanka to help combat Covid-19 challenges. The donation was formally accepted by Foreign Secretary Admiral Prof. Jayanath Colombage from the Government of Turkey, presented by the Ambassador.",
    "Category": "Ministry News"
  },
  {
    "Title": "Ambassador Prof. M.D. Lamawansa presents his letter of credence to the President of Moldova",
    "Date": "18.02.2021",
    "Link": "https://mfa.gov.lk/en/ambassador-prof-m-d-lamawansa-presents-his-letter-of-credence-to-the-president-of-moldova/",
    "Summary": "Ambassador Prof. M.D. Lamawansa of Sri Lanka presented his letter of credence to the President of Moldova, with concurrent accreditation to the Russian Federation.",
    "Category": "Ministry News"
  },
  {
    "Title": "UK Travel Restriction Lifted – Foreign Ministry",
    "Date": "17.02.2021",
    "Link": "https://mfa.gov.lk/en/uk-travel-restriction-lifted-foreign-ministry/",
    "Summary": "The UK travel restriction imposed by the Sri Lankan Government due to the new Covid-19 variant has been lifted immediately, according to the Foreign Ministry. Travel from the United Kingdom to Sri Lanka is now permitted.",
    "Category": "Ministry News"
  },
  {
    "Title": "Message by Ambassador of  Sri Lanka to the Sultanate of Oman H.E. Omar Lebbe Ameer Ajwad  On The Commemoration of the 40th Anniversary of Diplomatic Relations between Sri Lanka and the Sultanate of Oman on 17 February 2021.",
    "Date": "17.02.2021",
    "Link": "https://mfa.gov.lk/en/message-by-ambassador-of-sri-lanka-to-the-sultanate-of-oman-h-e-omar-lebbe-ameer-ajwad-on-the-commemoration-of-the-40th-anniversary-of-diplomatic-relations-between-sri/",
    "Summary": "Today marks the 40th Anniversary of diplomatic relations between Sri Lanka and the Sultanate of Oman. To commemorate this milestone, Foreign Minister of Sri Lanka Hon. Dinesh Gunewardena and the Ambassador of Sri Lanka to Oman H.E. Omar Lebbe Ameer Ajwad will participate in the celebrations on 17 February 2021.",
    "Category": "Ministry News"
  },
  {
    "Title": "Providing continuous consular services to Sri Lankans in Milan",
    "Date": "15.02.2021",
    "Link": "https://mfa.gov.lk/en/providing-continuous-consular-services-to-sri-lankans-in-milan/",
    "Summary": "The Foreign Ministry will reintroduce the online appointment system for Sri Lankans at the Consulate General of Sri Lanka in Milan, addressing concerns of the community in Italy. This move aims to provide continuous consular services to Sri Lankans residing in Milan.",
    "Category": "Ministry News"
  },
  {
    "Title": "International Day Against the Use of Child Soldiers",
    "Date": "14.02.2021",
    "Link": "https://mfa.gov.lk/en/international-day-against-the-use-of-child-soldiers/",
    "Summary": "The International Day Against the Use of Child Soldiers was marked with a virtual event focusing on implementing the Vancouver Principles to prevent and end the recruitment and use of child soldiers. H.E. Mohan Peiris, Permanent Representative of Sri Lanka, delivered a statement during the event.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka and Japan conclude the 2nd Policy Dialogue virtually",
    "Date": "10.02.2021",
    "Link": "https://mfa.gov.lk/en/sl-japan-dialogue-virtually/",
    "Summary": "Sri Lanka and Japan concluded their second Policy Dialogue virtually today, 10 February 2021. The dialogue took place at the Senior Official Level of the two Foreign Ministries, reflecting the strong foundation of political ties between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Interview of the Foreign Secretary on ´Pathikada’ telecast on Newsfirst Sri Lanka on 05 February 2021.",
    "Date": "05.02.2021",
    "Link": "https://mfa.gov.lk/en/interview-fs-21-02-05/",
    "Summary": "Foreign Secretary Admiral Prof. Jayanath Colombage was interviewed on 'Pathikada' on Newsfirst Sri Lanka on 05 February 2021. During the interview, he discussed the upcoming 46th Session of the UNHRC and Sri Lanka's response to COVID-19.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Ministry to open a Regional Consular Office in Kandy",
    "Date": "05.02.2021",
    "Link": "https://mfa.gov.lk/en/fm-consular-office-in-kandy/",
    "Summary": "The Foreign Ministry, under Foreign Minister Dinesh Gunawardena's guidance, will open a Regional Consular Office in Kandy to support the Government's National Policy Framework, 'Vistas of Prosperity and Splendour', by improving consular services in the region. This initiative aims to enhance efficiency and effectiveness in serving the public.",
    "Category": "Ministry News"
  },
  {
    "Title": "Independence Day speech by H.E. Gotabaya Rajapaksa, the President of Sri Lanka at the 73rd Independence Day celebrations.",
    "Date": "04.02.2021",
    "Link": "https://mfa.gov.lk/en/independence-day-speech-by-h-e-gotabaya-rajapaksa-the-president-of-sri-lanka-at-the-73rd-independence-day-celebrations/",
    "Summary": "President Gotabaya Rajapaksa delivered speeches in English, Sinhala, and Tamil during the 73rd Independence Day celebrations in Sri Lanka. The speeches highlighted key messages and priorities for the nation's future development and progress.",
    "Category": "Ministry News"
  },
  {
    "Title": "Hon. Prime Minister’s Independence Day Message 2021",
    "Date": "04.02.2021",
    "Link": "https://mfa.gov.lk/en/pm-independence-day-message-2021/",
    "Summary": "In his Independence Day message for 2021, the Honorable Prime Minister addressed the nation in English, Sinhala, and Tamil. The message aimed to inspire unity and progress among all citizens.",
    "Category": "Ministry News"
  },
  {
    "Title": "Independence Day Message of the Hon. Foreign Minister – 2021",
    "Date": "04.02.2021",
    "Link": "https://mfa.gov.lk/en/independence-day-message-of-the-hon-foreign-minister-2021/",
    "Summary": "The Honorable Foreign Minister's Independence Day message for 2021 is available in English and Sinhala PDF formats, as well as in Tamil PD. The message conveys important sentiments and wishes for the occasion.",
    "Category": "Ministry News"
  },
  {
    "Title": "The US Ambassador to Sri Lanka calls on the Foreign Minister",
    "Date": "03.02.2021",
    "Link": "https://mfa.gov.lk/en/us-sl-2021/",
    "Summary": "The US Ambassador to Sri Lanka, Alaina B. Teplitz, met with Foreign Minister Dinesh Gunawardena on February 2, 2021. State Minister for Regional Co-operation Tharaka Balasuriya also participated in the meeting held at the Foreign Ministry. The discussion likely focused on enhancing bilateral relations between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lankan maritime safety and security experts meet",
    "Date": "02.02.2021",
    "Link": "https://mfa.gov.lk/en/sl-lki-2021/",
    "Summary": "Sri Lankan maritime safety and security experts recently gathered at the Lakshman Kadirgamar Institute, where Foreign Secretary Admiral Prof. Jayanath Colombage highlighted Sri Lanka's leadership role in the Indian Ocean Rim Association (IORA). The meeting aimed to strengthen collaboration and initiatives within the region.",
    "Category": "Ministry News"
  },
  {
    "Title": "The Cabinet of Ministers approves the establishment of diplomatic relations with the Principality of Liechtenstein",
    "Date": "01.02.2021",
    "Link": "https://mfa.gov.lk/en/the-cabinet-of-ministers-approves-the-establishment-of-diplomatic-relations-with-the-principality-of-liechtenstein/",
    "Summary": "The Cabinet of Ministers has approved the establishment of diplomatic relations between Sri Lanka and the Principality of Liechtenstein. Foreign Minister Dinesh Gunawardena submitted the proposal for this decision.",
    "Category": "Ministry News"
  },
  {
    "Title": "Item 115 – Report of the Secretary-General on the work of the Organization  Plenary meeting of the 75th Session of the General Assembly",
    "Date": "01.02.2021",
    "Link": "https://mfa.gov.lk/en/item-115-report-of-the-secretary-general-on-the-work-of-the-organization-plenary-meeting-of-the-75th-session-of-the-general-assembly/",
    "Summary": "During the Plenary meeting of the 75th Session of the General Assembly, H.E. Mohan Peiris, the Permanent Representative of Sri Lanka to the United Nations, delivered a statement on the Secretary-General's report on the organization's work. The statement was made on Friday, 29 January 2021, in the General Assembly Hall, marking an important contribution to the ongoing discussions.",
    "Category": "Ministry News"
  },
  {
    "Title": "United Nations Security Council  Arria Formula Meeting on Children and Armed Conflict  Repatriation of children from conflict zones: from camps to homes. Call for action",
    "Date": "01.02.2021",
    "Link": "https://mfa.gov.lk/en/united-nations-security-council-arria-formula-meeting-on-children-and-armed-conflict-repatriation-of-children-from-conflict-zones-from-camps-to-homes-call-for-action/",
    "Summary": "The United Nations Security Council held an Arria Formula Meeting on repatriating children from conflict zones, emphasizing the transition from camps to homes. H.E. Mohan Peiris, Sri Lanka's Permanent Representative to the UN, called for action during the meeting on Friday, 29 January 2021.",
    "Category": "Ministry News"
  },
  {
    "Title": "Ambassador Malraj de Silva Presents Credentials to the United Arab Emirates",
    "Date": "30.01.2021",
    "Link": "https://mfa.gov.lk/en/ambassador-malraj-de-silva-presents-credentials-to-the-united-arab-emirates/",
    "Summary": "Ambassador Malraj de Silva presented his Letters of Credence to Vice President and Prime Minister of the United Arab Emirates, Sheikh Mohammed bin Rashid Al Maktoum, at the Qasr Al Watan Presidential Palace. This formal ceremony marked the official beginning of Ambassador de Silva's diplomatic mission in the UAE.",
    "Category": "Ministry News"
  },
  {
    "Title": "Ambassador-designate of Sri Lanka to Egypt assumed duties",
    "Date": "29.01.2021",
    "Link": "https://mfa.gov.lk/en/ambassador-designate-of-sri-lanka-to-egypt-assumed-duties/",
    "Summary": "Sri Lanka's Ambassador-designate to Egypt, M.K. Pathmanaathan, officially began his duties on January 25, 2020. He was warmly received at Cairo International Airport by a special representative.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Secretary speaks on Sri Lanka’s foreign relations",
    "Date": "28.01.2021",
    "Link": "https://mfa.gov.lk/en/fs-sl-foreign-relations/",
    "Summary": "Foreign Secretary Admiral Prof. Jayanath Colombage discussed Sri Lanka's foreign relations in an interview on News 1st NEWSLINE with Faraz Shauketaly on January 25, 2021. The interview can be viewed at the provided link.",
    "Category": "Ministry News"
  },
  {
    "Title": "Special Notice by Sri Lanka Tourism",
    "Date": "27.01.2021",
    "Link": "https://mfa.gov.lk/en/special-notice-sl/",
    "Summary": "Sri Lanka Tourism has issued special instructions regarding entry permit categories for arrivals to Sri Lanka, following Ministry of Health guidelines dated 06 January 2021. Travelers are advised to adhere to these guidelines for entry into the country.",
    "Category": "Ministry News"
  },
  {
    "Title": "23rd meeting of the EU-Sri Lanka Joint Commission",
    "Date": "25.01.2021",
    "Link": "https://mfa.gov.lk/en/23rd-meeting-of-the-eu-sri-lanka-joint-commission/",
    "Summary": "The European Union (EU) and Sri Lanka convened their 23rd Joint Commission meeting on January 25, 2021, through a video conference. This marked the first Joint Commission meeting under the new leadership.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Ministers of Sri Lanka and the Philippines agree to enhance diplomatic relations",
    "Date": "23.01.2021",
    "Link": "https://mfa.gov.lk/en/fr-sl-philippines-21/",
    "Summary": "Foreign Ministers of Sri Lanka and the Philippines agreed to enhance diplomatic relations by focusing on new strategies to strengthen economic, political, social, and international ties between the two countries. This agreement was reached during their meeting on the 22nd.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka is Open for Tourist Arrivals: Foreign Minister Dinesh Gunawardena informs ACD Member States at the 17th Ministerial Meeting",
    "Date": "22.01.2021",
    "Link": "https://mfa.gov.lk/en/acd-2021/",
    "Summary": "At the 17th Ministerial Meeting of the Asia Cooperation Dialogue (ACD) on January 21, 2021, Foreign Minister Dinesh Gunawardena announced that Sri Lanka is now open for tourist arrivals. The theme of the meeting was \"New Normal and Safe and Healthy Tourism.",
    "Category": "Ministry News"
  },
  {
    "Title": "Commission of Inquiry appointed to look into alleged human rights & IHL violations",
    "Date": "22.01.2021",
    "Link": "https://mfa.gov.lk/en/commission-of-inquiry-appointed-to-look-into-alleged-human-rights-ihl-violations/",
    "Summary": "President Gotabaya Rajapaksa appointed a three-member Commission of Inquiry (CoI) to investigate alleged human rights and IHL violations. The appointment was announced through a media release from the PMD on January 22, 2021, along with an Extraordinary Gazette notification.",
    "Category": "Ministry News"
  },
  {
    "Title": "Ambassador-designate of Sri Lanka to the State of Qatar, presents open Copy of his Letter of Credence",
    "Date": "19.01.2021",
    "Link": "https://mfa.gov.lk/en/ambassador-designate-of-sri-lanka-to-the-state-of-qatar-presents-open-copy-of-his-letter-of-credence/",
    "Summary": "Ambassador-designate M. Mafaz Mohideen of Sri Lanka presented an open copy of his Letter of Credence to Qatar's Minister of State for Foreign Affairs, Soltan bin Saad.",
    "Category": "Ministry News"
  },
  {
    "Title": "Ambassador – designate of Sri Lanka to Qatar Mafaz Mohideen assumes duties in Doha",
    "Date": "18.01.2021",
    "Link": "https://mfa.gov.lk/en/ambassador-designate-of-sri-lanka-to-qatar-mafaz-mohideen-assumes-duties-in-doha/",
    "Summary": "Ambassador-designate of Sri Lanka to Qatar, Mohamed Mafaz Mohideen, officially started his duties at the Sri Lankan Embassy in Doha on January 17, 2021. The commencement was commemorated with a simple ceremony.",
    "Category": "Ministry News"
  },
  {
    "Title": "High Commissioner Kananathan presents credentials to UN Office in Nairobi",
    "Date": "15.01.2021",
    "Link": "https://mfa.gov.lk/en/high-commissioner-kananathan-presents-credentials-to-un-office-in-nairobi/",
    "Summary": "High Commissioner V. Kananathan of Sri Lanka to Kenya presented his credentials to the United Nations Office in Nairobi. He is also accredited as the Permanent Representative of Sri Lanka to UNON, UN Habitat, and United Nations.",
    "Category": "Ministry News"
  },
  {
    "Title": "Ambassador- designate of Sri Lanka to French Republic and Permanent Delegation of UNESCO assumed duties",
    "Date": "15.01.2021",
    "Link": "https://mfa.gov.lk/en/ambassador-designate-of-sri-lanka-to-french-republic-and-permanent-delegation-of-unesco-assumed-duties/",
    "Summary": "Ambassador-designate of Sri Lanka to the French Republic and Permanent Delegation of UNESCO, Professor Kshanika Hirimburegama, assumed duties on January 8, 2021, in Paris. The Sri Lankan National Flag was hoisted by the Ambassador during the ceremony.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka to commence flights to Myanmar",
    "Date": "15.01.2021",
    "Link": "https://mfa.gov.lk/en/myanmar-fs-2021/",
    "Summary": "Sri Lanka plans to start charter flights to Myanmar from mid-2021, as announced by Mohan Meegolla, the Regional Manager (Southeast Asia) of Sri Lankan Airlines, during a meeting organized by the Foreign Ministry. This initiative aims to boost air travel between the two countries post COVID-19.",
    "Category": "Ministry News"
  },
  {
    "Title": "Thai Pongal Message of H.E. the President",
    "Date": "14.01.2021",
    "Link": "https://mfa.gov.lk/en/president-thai-pongal/",
    "Summary": "H.E. the President delivers Thai Pongal messages in English, Sinhala, and Tamil to the nation. The messages convey warm wishes and blessings for the Thai Pongal festival celebrations.",
    "Category": "Ministry News"
  },
  {
    "Title": "Viet Nam Sri Lanka Cooperation focus on Agriculture and Fisheries Sectors",
    "Date": "13.01.2021",
    "Link": "https://mfa.gov.lk/en/fm-vietnam-21/",
    "Summary": "Viet Nam's Ambassador in Colombo, Pham Thi Bich Ngoc, highlighted the significant potential for cooperation between Sri Lanka and Viet Nam in agriculture and fisheries sectors during a recent meeting with Foreign Minister Dinesh Gunawardena on January 12, 2021. The discussion emphasized the mutual interest in enhancing collaboration between the two countries in these key areas.",
    "Category": "Ministry News"
  },
  {
    "Title": "Dr. Palitha T. B. Kohona presents copy of the credentials to the Director General of the Department of Protocol of the Ministry of Foreign Affairs of China",
    "Date": "12.01.2021",
    "Link": "https://mfa.gov.lk/en/dr-palitha-t-b-kohona-presents-copy-of-the-credentials-to-the-director-general-of-the-department-of-protocol-of-the-ministry-of-foreign-affairs-of-china/",
    "Summary": "Ambassador of Sri Lanka to China, Dr. Palitha T. B. Kohona, formally presented his credentials to the Director General of the Department of Protocol, Hong Lei, in accordance with protocol. This gesture signifies the official recognition of Dr. Kohona's role in representing Sri Lanka in diplomatic relations with China.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister seeks assistance to boost FDIs from Honorary Consuls based in Colombo",
    "Date": "12.01.2021",
    "Link": "https://mfa.gov.lk/en/honorary-consuls-based-in-colombo/",
    "Summary": "Foreign Minister Dinesh Gunawardena asked Honorary Consuls in Colombo to help attract foreign investors to Sri Lanka. He made the request during a meeting held on January 11th to boost Foreign Direct Investments (FDIs) in the country.",
    "Category": "Ministry News"
  },
  {
    "Title": "Conferring of the Honorary Religious Title “Aggamahāpaṇḍita” on the four Sri Lankan Buddhist Priests",
    "Date": "12.01.2021",
    "Link": "https://mfa.gov.lk/en/sl-buddhist/",
    "Summary": "The President of Myanmar, U Win Myint, will confer the Honorary Religious Title \"Aggamahāpaṇḍita\" on four Sri Lankan Buddhist monks. Additionally, three Buddhist Priests and one Layman will receive several other Honorary Titles. This decision highlights the recognition and honor bestowed upon these individuals by the President of Myanmar.",
    "Category": "Ministry News"
  },
  {
    "Title": "Appointment of the High Commissioner of the People’s Republic of Bangladesh to Sri Lanka",
    "Date": "12.01.2021",
    "Link": "https://mfa.gov.lk/en/hc-of-bangladesh/",
    "Summary": "The Government of Bangladesh, with the approval of Sri Lanka, has appointed Mr. Tareq Md. Ariful Islam as the High Commissioner of Bangladesh to Sri Lanka.",
    "Category": "Ministry News"
  },
  {
    "Title": "Thailand to focus on investment opportunities in Plantation and Agricultural sectors in Sri Lanka",
    "Date": "10.01.2021",
    "Link": "https://mfa.gov.lk/en/fm-thailand-21/",
    "Summary": "Thailand's Ambassador in Sri Lanka, Chulamanee Chartsuwan, paid a Farewell Call on Foreign Minister Dinesh Gunawardena on 08 January 2021. They discussed Thailand's interest in exploring investment opportunities in Sri Lanka's Plantation and Agricultural sectors.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Dinesh Gunawardena assures the early resumption of medical tourism for Seychellois",
    "Date": "10.01.2021",
    "Link": "https://mfa.gov.lk/en/fm-seychelles21/",
    "Summary": "Foreign Minister Dinesh Gunawardena met with the outgoing High Commissioner of Seychelles, Conrad Vincent Mederic, at the Foreign Ministry on January 8, 2021. During the meeting, Gunawardena assured the early resumption of medical tourism for Seychellois, emphasizing the importance of the sector for both countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Repatriation Process “People Centric and Transparent” – Foreign Ministry sets the record straight",
    "Date": "08.01.2021",
    "Link": "https://mfa.gov.lk/en/fs-repatriate/",
    "Summary": "The Foreign Ministry clarified that the repatriation process is people-centric and transparent, with no financial burden on Sri Lankans. Foreign Secretary Jayanath Colombage emphasized this in response to misinformation circulating in the public domain.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Gunawardena seeks to re-open employment opportunities in Korea",
    "Date": "08.01.2021",
    "Link": "https://mfa.gov.lk/en/fr-korea/",
    "Summary": "Foreign Minister Dinesh Gunawardena met with Korean Ambassador Woonjin Jeong on January 4 to discuss reviving foreign employment cooperation between Sri Lanka and South Korea. Gunawardena aims to re-open employment opportunities for Sri Lankans in Korea.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka Ambassador-Designate to Japan assumed duties",
    "Date": "08.01.2021",
    "Link": "https://mfa.gov.lk/en/sri-lanka-ambassador-designate-to-japan-assumed-duties/",
    "Summary": "Sri Lanka's Ambassador-Designate to Japan, Sanjiv Gunasekara, officially began his duties on January 6, 2021, in Tokyo. He is the seventeenth Sri Lankan Ambassador to Japan in the 69-year history of bilateral relations between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "“India will always be a dependable partner and reliable friend open to strengthening its relationship with Sri Lanka” says EAM Dr. S. Jaishankar",
    "Date": "07.01.2021",
    "Link": "https://mfa.gov.lk/en/india-sl-07/",
    "Summary": "During his visit, Indian Minister of External Affairs Dr. S. Jaishankar engaged in bilateral talks with Sri Lankan Foreign Minister Dinesh Gunawardena at the Republic Building on January 6, 2021. Dr. Jaishankar emphasized India's commitment to being a reliable partner and expressed openness to enhancing the relationship with Sri Lanka.",
    "Category": "Ministry News"
  },
  {
    "Title": "Media statement made by Hon. Dinesh Gunawardena, Foreign Minister following his Bilateral Talks with the visiting Indian Minister of External Affairs Dr. S. Jaishankar on 6th January 2021 at the Foreign Ministry",
    "Date": "06.01.2021",
    "Link": "https://mfa.gov.lk/en/india-sl-2/",
    "Summary": "Foreign Minister Hon. Dinesh Gunawardena issued a media statement after holding bilateral talks with Indian Minister of External Affairs Dr. S. Jaishankar on January 6, 2021, at the Foreign Ministry. The meeting included discussions with H.E. Mr. Gopal Baglay, the Indian High Commissioner, and other Indian officials.",
    "Category": "Ministry News"
  },
  {
    "Title": "UNDP Human Development Report presented to the Foreign Minister",
    "Date": "06.01.2021",
    "Link": "https://mfa.gov.lk/en/undp-human-development-report-presented-to-the-foreign-minister/",
    "Summary": "UNDP Resident Coordinator Robert Jukham presented the UNDP Human Development Report 2020 to Foreign Minister Dinesh Gunawardena on January 5, 2021, at the Foreign Ministry. Foreign Minister Gunawardena expressed appreciation for the report during the presentation.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Secretary Colombage speaks of the repatriation process and the revival of tourism",
    "Date": "05.01.2021",
    "Link": "https://mfa.gov.lk/en/fs_tourism/",
    "Summary": "Foreign Secretary Admiral Prof. Jayanath Colombage discussed the repatriation process for Sri Lankan nationals abroad and the plans for reviving the tourism industry in an interview on Sirasa TV1 on January 5, 2021. He highlighted the importance of facilitating the return of citizens and boosting tourism to support the country's economy.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Secretary Colombage speaks of repatriation, revival of tourism and obtaining vaccines for COVID-19",
    "Date": "04.01.2021",
    "Link": "https://mfa.gov.lk/en/fs-big_focus-21/",
    "Summary": "Foreign Secretary Admiral Prof. Jayanath Colombage discussed the repatriation of Sri Lankans, quarantine facilities, and plans for reviving tourism and securing COVID-19 vaccines during an interview on Ada Derana's 'Big Focus' on January 4, 2021. He highlighted efforts to facilitate the return of citizens, ensure proper quarantine measures, and boost the tourism sector amidst the pandemic.",
    "Category": "Ministry News"
  },
  {
    "Title": "Indian External Affairs Minister Dr. S.Jaishankar undertakes his first New Year foreign visit to Sri Lanka from 5th to 7th January 2021",
    "Date": "04.01.2021",
    "Link": "https://mfa.gov.lk/en/india-sl/",
    "Summary": "Indian External Affairs Minister Dr. S. Jaishankar will visit Sri Lanka from January 5th to 7th, 2021, at the invitation of Foreign Minister Dinesh Gunawardena. This marks Dr. Jaishankar's first foreign visit of the New Year.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka extends felicitations on Cuban National Day",
    "Date": "03.01.2021",
    "Link": "https://mfa.gov.lk/en/sl-cuban-nd/",
    "Summary": "Sri Lanka's Foreign Minister Dinesh Gunawardena visited the Cuban Embassy in Colombo to extend felicitations on the occasion of Cuban National Day, which took place on January 1, 2021. He conveyed best wishes to Ambassador Juana Elena Ramos Rodriguez during the visit.",
    "Category": "Ministry News"
  },
  {
    "Title": "68,000 Sri Lankans awaiting return – Foreign Secretary",
    "Date": "03.01.2021",
    "Link": "https://mfa.gov.lk/en/sl-awaiting/",
    "Summary": "Foreign Secretary reports that 68,000 Sri Lankans are awaiting repatriation amid the global Covid pandemic. The Foreign Ministry is leading efforts to address this pressing challenge.",
    "Category": "Ministry News"
  },
  {
    "Title": "Let us unite and dedicate ourselves for the betterment of our Motherland – Foreign Minister Gunawardena",
    "Date": "02.01.2021",
    "Link": "https://mfa.gov.lk/en/fm-new-year/",
    "Summary": "Foreign Minister Gunawardena calls for unity among Sri Lankans in 2021 to protect the country's dignity, independence, sovereignty, and territorial integrity. He emphasizes the importance of working together for the betterment of the Motherland.",
    "Category": "Ministry News"
  },
  {
    "Title": "President’s New Year Message",
    "Date": "01.01.2021",
    "Link": "https://mfa.gov.lk/en/presidents-new-year-message/",
    "Summary": "President's New Year Message is now available for download in English, Sinhala, and Tamil. You can access the message in PDF format for a detailed review. Wishing everyone a prosperous New Year ahead.",
    "Category": "Ministry News"
  }
]