{
  "columns": [
    "Title",
    "Date",
    "Link",
    "Summary",
    "Category"
  ],
  "rows": [
    [
      "Sri Lanka Ambassador- designate to People’s Republic of China formally assumes duties",
      "31.12.2020",
      "https://mfa.gov.lk/en/sri-lanka-ambassador-designate-to-peoples-republic-of-china-formally-assumes-duties/",
      "Dr. Palitha T. B. Kohona, the Ambassador-designate of Sri Lanka to China, officially began his duties on December 30, 2020, at the Sri Lankan Embassy in Beijing.",
      "Mission News"
    ],
    [
      "The Embassy launches a new website: www.bangkok.embassy.gov.lk",
      "31.12.2020",
      "https://mfa.gov.lk/en/the-embassy-launches-a-new-website-www-bangkok-embassy-gov-lk/",
      "The Embassy of Sri Lanka in Bangkok has launched its new official website, www.bangkok.embassy.gov.lk. The revamped site offers user-friendly access to a wide range of information on Sri Lanka and the Embassy. Visit the website for .",
      "Mission News"
    ],
    [
      "Ambassador Aryasinha commends the services rendered by the Maha Sanga in the propagation of Buddhism across the world",
      "30.12.2020",
      "https://mfa.gov.lk/en/ambassador-aryasinha-commends-the-services-rendered-by-the-maha-sanga-in-the-propagation-of-buddhism-across-the-world/",
      "Ambassador Ravinatha Aryasinha praised the services provided by the Maha Sanga in the United States and other countries for their role in spreading Buddhism worldwide. He emphasized that they have helped promote the most sacred offerings that Sri Lanka has to offer.",
      "Mission News"
    ],
    [
      "Embassy in Washington DC Organizes Virtual Christmas Celebrations",
      "30.12.2020",
      "https://mfa.gov.lk/en/embassy-in-washington-dc-organizes-virtual-christmas-celebrations/",
      "The Embassy of Sri Lanka in Washington D.C. organized virtual Christmas celebrations on December 22, connecting with the Sri Lankan community in the Greater Washington area. The main program was conducted online, bringing together participants to mark the festive occasion.",
      "Mission News"
    ],
    [
      "Sri Lanka-Oman Joint Technical Committee on Labour and Training meets via video conference",
      "30.12.2020",
      "https://mfa.gov.lk/en/sri-lanka-oman-joint-technical-committee-on-labour-and-training-meets-via-video-conference/",
      "The 4th Technical Committee Meeting under the MoU in the Field of Labour and Training between Sri Lanka and Oman took place on 23 December 2020 via video conference. The Sri Lankan delegation was represented by Add, discussing collaboration in labor and training initiatives.",
      "Mission News"
    ],
    [
      "Christmas blessings organised by the Consulate General of Sri Lanka in Frankfurt am main",
      "30.12.2020",
      "https://mfa.gov.lk/en/christmas-blessings-organised-by-the-consulate-general-of-sri-lanka-in-frankfurt-am-main/",
      "The Consulate General of Sri Lanka in Frankfurt am Main organized a Christmas Blessings event via Zoom on December 21, 2020. Father Christian Enke from St. Leonhard’s Church conveyed his blessings during the event.",
      "Mission News"
    ],
    [
      "Ambassador Prof. M.D. Lamawansa presents Credentials to the Minister of Foreign Affairs of Uzbekistan",
      "24.12.2020",
      "https://mfa.gov.lk/en/ambassador-prof-m-d-lamawansa-presents-credentials-to-the-minister-of-foreign-affairs-of-uzbekistan/",
      "Ambassador Prof. M.D. Lamawansa, serving as Sri Lanka's Ambassador to Russia and concurrently to Uzbekistan, presented his credentials to the Minister of Foreign Affairs of Uzbekistan. This formalized his role as Sri Lanka's representative to Uzbekistan.",
      "Mission News"
    ],
    [
      "Permanent Representative Majintha Jayesinghe Presents Credentials to the UNIDO",
      "23.12.2020",
      "https://mfa.gov.lk/en/permanent-representative-majintha-jayesinghe-presents-credentials-to-the-unido/",
      "Ambassador Majintha Jayesinghe presented her credentials to Li Yong, the Director General of the United Nations Industrial Development Organization (UNIDO), on December 22, 2020, at the Vienna International Centre. This accreditation marks her official representation at UNIDO.",
      "Mission News"
    ],
    [
      "Christmas Celebrations via ZOOM hosted by the Embassy of Sri Lanka in Jordan",
      "23.12.2020",
      "https://mfa.gov.lk/en/christmas-celebrations-via-zoom-hosted-by-the-embassy-of-sri-lanka-in-jordan/",
      "The Embassy of Sri Lanka in Jordan hosted a Christmas celebration via ZOOM on December 19, 2020, for Sri Lankan and Jordanian children. The event took place at the Abdul Hameed Shoman Foundation Library in Amman, bringing joy and festive spirit to the participants.",
      "Mission News"
    ],
    [
      "The Launch of Chandanalepa Ayurvedic Products in Lebanon",
      "22.12.2020",
      "https://mfa.gov.lk/en/the-launch-of-chandanalepa-ayurvedic-products-in-lebanon/",
      "The Embassy of Sri Lanka, in partnership with Sanjeewaka Ayurvedic Products (Pvt.) Ltd, introduced the Chandanalepa range in Lebanon at Rafik Hariri Hall to boost Sri Lanka-Lebanon trade relations.",
      "Mission News"
    ],
    [
      "Embassy joins virtual meeting on “prospects for cooperation” with the Sri Lankan and Ukrainian business community",
      "22.12.2020",
      "https://mfa.gov.lk/en/embassy-joins-virtual-meeting-on-prospects-for-cooperation-with-the-sri-lankan-and-ukrainian-business-community/",
      "The Sri Lanka Embassy in Ankara, in partnership with the Ceylon Chamber of Commerce and the Ukrainian Chamber of Commerce & Industry, organized a virtual meeting on \"prospects for cooperation\" on December 11, 2020. The meeting aimed to facilitate collaboration between the Sri Lankan and Ukrainian business communities.",
      "Mission News"
    ],
    [
      "Ambassador Ameer Ajwad inaugurates issuance of NOC to combat trafficking of Sri Lankan Female Migrant Workers",
      "22.12.2020",
      "https://mfa.gov.lk/en/ambassador-ameer-ajwad-inaugurates-issuance-of-noc-to-combat-trafficking-of-sri-lankan-female-migrant-workers/",
      "Ambassador Ameer Ajwad inaugurated the issuance of No Objection Certificates (NOC) to combat trafficking of Sri Lankan female migrant workers in Oman. This initiative aims to curb irregular and undocumented migration, particularly among domestic workers.",
      "Mission News"
    ],
    [
      "Interactive Seminar in the Republic of Korea (RoK) on augmentation of power and energy sphere of Sri Lanka",
      "22.12.2020",
      "https://mfa.gov.lk/en/interactive-seminar-in-the-republic-of-korea-rok-on-augmentation-of-power-and-energy-sphere-of-sri-lanka/",
      "An interactive seminar was held in the Republic of Korea (RoK) focusing on enhancing Sri Lanka's power and energy sector. The webinar featured Ambassador Santhush Jeong Woonjin of the RoK, Ambassador Dr. Saj Mendis, and Moderator Mr. Tharindu Amarasekera, organized by the Embassy of Sri Lanka in Seoul. The session aimed to strengthen cooperation and collaboration between the two countries in the energy sphere.",
      "Mission News"
    ],
    [
      "Embassy organized an interactive webinar and business matchmaking on Sri Lankan Spice sector",
      "21.12.2020",
      "https://mfa.gov.lk/en/embassy-organized-an-interactive-webinar-and-business-matchmaking-on-sri-lankan-spice-sector/",
      "The Embassy of Sri Lanka in Ankara organized an interactive webinar and business matchmaking event focusing on the Sri Lankan spice sector in collaboration with the Sri Lanka Export Development Board and the Turkey-Sri Lanka Business Council. The event aimed to facilitate information sharing and networking opportunities for businesses interested in the spice industry.",
      "Mission News"
    ],
    [
      "Consulate General of Sri Lanka in Shanghai together with the Sri Lankan community and Chinese Business Community spread the message of generosity and care during the festive season",
      "21.12.2020",
      "https://mfa.gov.lk/en/consulate-general-of-sri-lanka-in-shanghai-together-with-the-sri-lankan-community-and-chinese-business-community-spread-the-message-of-generosity-and-care-during-the-festive-season/",
      "The Consulate General of Sri Lanka in Shanghai, along with the Sri Lankan and Chinese business communities, promoted generosity and care during the festive season. The initiative aimed to spread a message of goodwill and unity among the communities.",
      "Mission News"
    ],
    [
      "The Ambassador – designate to People’s Republic of China assumes duties",
      "17.12.2020",
      "https://mfa.gov.lk/en/the-ambassador-designate-to-peoples-republic-of-china-assumes-duties/",
      "Dr. Palitha Kohona, the Ambassador-designate of Sri Lanka to China, arrived in China on December 15, 2020, and virtually assumed duties on December 16, 2020.",
      "Mission News"
    ],
    [
      "Business Networking Meeting in Sydney",
      "17.12.2020",
      "https://mfa.gov.lk/en/business-networking-meeting-in-sydney/",
      "The Consulate General of Sri Lanka in Sydney organized a Business Networking Meeting on December 9, 2020, bringing together selected Australian and Sri Lankan businessmen as Covid-19 restrictions eased in Sydney and Australia. The event aimed to foster connections and collaboration between the two business communities.",
      "Mission News"
    ],
    [
      "Ambassador Aryasinha calls on OSLs in the US to support economic promotion and strengthen advocacy of Sri Lanka",
      "16.12.2020",
      "https://mfa.gov.lk/en/ambassador-aryasinha-calls-on-osls-in-the-us-to-support-economic-promotion-and-strengthen-advocacy-of-sri-lanka/",
      "Ambassador Ravinatha Aryasinha urged Overseas Sri Lankans (OSLs) in the US to support economic promotion and advocate for Sri Lanka. He emphasized the importance of engaging with the US Government and State bodies to strengthen ties.",
      "Mission News"
    ],
    [
      "High Commissioner of Sri Lanka Professor Sudharshan Seneviratne presents Credentials",
      "11.12.2020",
      "https://mfa.gov.lk/en/high-commissioner-of-sri-lanka-professor-sudharshan-seneviratne-presents-credentials/",
      "Sri Lanka's High Commissioner to Bangladesh, Professor Sudharshan Seneviratne, presented his Letter of Credence to Bangladesh's President Md. Abdul Hamid on December 3, 2020, at the Presidential Palace in Dhaka. This formal ceremony marks the official beginning of Professor Seneviratne's diplomatic tenure in Bangladesh.",
      "Mission News"
    ],
    [
      "Repatriation of 272 stranded Sri Lankans in Malaysia due to the Pandemic Situation",
      "11.12.2020",
      "https://mfa.gov.lk/en/repatriation-of-272-stranded-sri-lankans-in-malaysia-due-to-the-pandemic-situation/",
      "The High Commission of Sri Lanka in Malaysia, along with the Foreign Ministry, the Presidential Secretariat, and Sri Lankan Airlines, successfully repatriated 272 stranded Sri Lankans from Malaysia due to the pandemic situation. The collaborative effort ensured the safe return of these individuals to their home country.",
      "Mission News"
    ],
    [
      "High Commissioner – designate to South Africa Sirisena Amarasekara presents Open Copy of his Letter of Credence to the Deputy Chief of State Protocol Ebrahim Edries",
      "10.12.2020",
      "https://mfa.gov.lk/en/high-commissioner-designate-to-south-africa-sirisena-amarasekara-presents-open-copy-of-his-letter-of-credence-to-the-deputy-chief-of-state-protocol-ebrahim-edries/",
      "Sirisena Amarasekara, the High Commissioner-designate of Sri Lanka to South Africa, presented the Open Copy of his Letter of Credence to Deputy Chief of State Protocol Ebrahim Edries on December 9th. This formal presentation signifies the beginning of his official diplomatic role in South Africa.",
      "Mission News"
    ],
    [
      "Embassy of Sri Lanka participates in International Food Festival 2020",
      "08.12.2020",
      "https://mfa.gov.lk/en/embassy-of-sri-lanka-participates-in-international-food-festival-2020/",
      "The Embassy of Sri Lanka in Ha Noi, Viet Nam took part in the 2020 International Food Festival organized by the Ministry of Foreign Affairs of Viet Nam on December 6. The event was held in Ha Noi, showcasing a variety of international cuisines.",
      "Mission News"
    ],
    [
      "High Commissioner-designate of Sri Lanka to South Africa assumes duties",
      "08.12.2020",
      "https://mfa.gov.lk/en/high-commissioner-designate-of-sri-lanka-to-south-africa-assumes-duties/",
      "Sirisena Amarasekara, the High Commissioner-designate of Sri Lanka to South Africa, began his duties at the Sri Lankan High Commission in Pretoria on December 3, 2020. He was warmly welcomed by the staff.",
      "Mission News"
    ],
    [
      "Donation of Test Kits for COVID-19 by SK Group of the Republic of Korea",
      "07.12.2020",
      "https://mfa.gov.lk/en/donation-of-test-kits-for-covid-19-by-sk-group-of-the-republic-of-korea/",
      "The SK Group of the Republic of Korea donated COVID-19 test kits to Sri Lanka. Vice President Mr. Hyeonseo Ku posed with Ambassador Dr. A. Saj U. Mendis at the Press Briefing Ceremony.",
      "Mission News"
    ],
    [
      "Ambassador Aryasinha assumes duties in Washington D.C.",
      "06.12.2020",
      "https://mfa.gov.lk/en/ambassador-aryasinha-assumes-duties-in-washington-d-c/",
      "Ambassador Ravinatha P. Aryasinha assumed his duties as Sri Lanka’s Ambassador to the United States on December 4, 2020, after the US State Department accepted his credentials. The ceremony adhered to COVID protocols.",
      "Mission News"
    ],
    [
      "High Commissioner Kananathan presents Credentials",
      "04.12.2020",
      "https://mfa.gov.lk/en/high-commissioner-kananathan-presents-credentials/",
      "High Commissioner Veluppillai Kananathan presented his Letter of Credence appointing him as High Commissioner to Kenya to President Uhuru Muigai Kenyatta on December 2, 2021.",
      "Mission News"
    ],
    [
      "Tourism Promotional interactive webinar held in Canberra",
      "02.12.2020",
      "https://mfa.gov.lk/en/tourism-promotional-interactive-webinar-held-in-canberra/",
      "A virtual eco-tourism promotional event titled 'Breathtaking Birds of the Sri Lankan Rainforest' was held in Canberra on November 12, 2020. The interactive webinar showcased the diverse bird species in Sinh, providing insights into Sri Lanka's natural beauty.",
      "Mission News"
    ],
    [
      "Ambassador Ameer Ajwad calls on the Chairman of the State Council of Oman",
      "01.12.2020",
      "https://mfa.gov.lk/en/ambassador-ameer-ajwad-calls-on-the-chairman-of-the-state-council-of-oman/",
      "Ambassador Ameer Ajwad of Sri Lanka visited Chairman Shaikh Abdulmalik bin Abdullah bin Ali al Khalili of the State Council of Oman on November 24 for a courtesy call.",
      "Mission News"
    ],
    [
      "Exploring synergies for convergence in the IT-BPM industry of  Sri Lanka and the Philippines",
      "30.11.2020",
      "https://mfa.gov.lk/en/exploring-synergies-for-convergence-in-the-it-bpm-industry-of-sri-lanka-and-the-philippines/",
      "The Embassy of Sri Lanka in Manila is working to enhance bilateral trade relations with the Philippines in the IT-BPM industry. They are exploring synergies to promote convergence between the two countries in this sector.",
      "Mission News"
    ],
    [
      "Ambassador Prof. M.D. Lamawansa presents credentials to President of the Russian Federation Vladimir Putin at the Kremlin",
      "30.11.2020",
      "https://mfa.gov.lk/en/ambassador-prof-m-d-lamawansa-presents-credentials-to-president-of-the-russian-federation-vladimir-putin-at-the-kremlin/",
      "Ambassador of Sri Lanka to the Russian Federation Prof. M.D. Lamawansa presented his letters of credence to President Vladimir Putin at the Kremlin on 24 November 2020. The ceremony followed tradition and took place in the Alex.",
      "Mission News"
    ],
    [
      "Sustainable Blue-Economy is the Future of Bay of Bengal Region",
      "30.11.2020",
      "https://mfa.gov.lk/en/sustainable-blue-economy-is-the-future-of-bay-of-bengal-region/",
      "At a special BIMSTEC event in Bangkok on November 20-21, 2020, Sri Lanka's Ambassador to Thailand, Samantha K. Jayasuriya, emphasized the importance of promoting safety and security in navigation. Sri Lanka advocates for a sustainable blue economy as the future for the Bay of Bengal region.",
      "Mission News"
    ],
    [
      "Ambassador Ameer Ajwad Calls on the new Minister of Higher Education, Scientific Research and Innovation of the Sultanate of Oman",
      "30.11.2020",
      "https://mfa.gov.lk/en/ambassador-ameer-ajwad-calls-on-the-new-minister-of-higher-education-scientific-research-and-innovation-of-the-sultanate-of-oman/",
      "Ambassador Ameer Ajwad of Sri Lanka visited Dr. Rahma bint Ibrahim bi, the new Minister of Higher Education, Scientific Research and Innovation in Oman. The visit was a courtesy call to discuss potential collaborations between the two countries in the field of education and research.",
      "Mission News"
    ],
    [
      "Sri Lanka Embassy in Oman repatriates 291 vulnerable Sri Lankan nationals from Muscat to Colombo",
      "29.11.2020",
      "https://mfa.gov.lk/en/sri-lanka-embassy-in-oman-repatriates-291-vulnerable-sri-lankan-nationals-from-muscat-to-colombo/",
      "The Sri Lanka Embassy in Oman successfully repatriated 291 vulnerable Sri Lankan nationals from Muscat to Colombo on November 26, 2020, via Sri Lankan Airlines flight UL 206. This effort was carried out in collaboration with the Foreign Ministry.",
      "Mission News"
    ],
    [
      "Sri Lanka’s Ambassador meets with Indonesian Deputy Minister for Production and Marketing",
      "27.11.2020",
      "https://mfa.gov.lk/en/sri-lankas-ambassador-meets-with-indonesian-deputy-minister-for-production-and-marketing/",
      "Sri Lanka’s Ambassador to Indonesia and ASEAN, Yasoja Gunasekera, met with the Indonesian Deputy Minister for Production and Marketing, Victoria Simanungkalit, at the Sri Lanka Embassy in Jakarta on 12 November 2020. The meeting aimed to discuss cooperation and strengthen bilateral ties between the two countries.",
      "Mission News"
    ],
    [
      "Sri Lankan nationals successfully evacuated from the war zone in the Tigray region of Ethiopia",
      "26.11.2020",
      "https://mfa.gov.lk/en/sri-lankan-nationals-successfully-evacuated-from-the-war-zone-in-the-tigray-region-of-ethiopia/",
      "The Sri Lanka Embassy in Ethiopia, in coordination with the Foreign Ministry of Sri Lanka and the United Nations in Ethiopia, successfully evacuated thirty-eight (38) Sri Lankan nationals from the war zone in the Tigray region. The safe evacuation was facilitated to ensure the well-being of the Sri Lankan citizens in the conflict-affected area.",
      "Mission News"
    ],
    [
      "Katina pooja at Sri Lanka Maha Vihara in Lumbini organised by Sri Lanka Embassy staff this year",
      "20.11.2020",
      "https://mfa.gov.lk/en/katina-pooja-at-sri-lanka-maha-vihara-in-lumbini-organised-by-sri-lanka-embassy-staff-this-year/",
      "The Katina pooja at the Sri Lanka Maha Vihara in Lumbini was organized on 15 November by the Sri Lanka Embassy staff in Nepal. The event received blessings from the Chief Prelate.",
      "Mission News"
    ],
    [
      "Legatum Prosperity Index highlights the development of education and healthcare sectors in Sri Lanka during the past decade",
      "20.11.2020",
      "https://mfa.gov.lk/en/legatum-prosperity-index-highlights-the-development-of-education-and-healthcare-sectors-in-sri-lanka-during-the-past-decade/",
      "The 14th Legatum Prosperity Index, released by the London-based think-tank Legatum Institute on November 17, 2020, showcased significant advancements in Sri Lanka's education and healthcare sectors over the past decade.",
      "Mission News"
    ],
    [
      "Sri Lanka Embassy in Moscow advises Sri Lankans not to fall victim to human trafficking",
      "20.11.2020",
      "https://mfa.gov.lk/en/sri-lanka-embassy-in-moscow-advises-sri-lankans-not-to-fall-victim-to-human-trafficking/",
      "The Sri Lanka Embassy in Moscow warns Sri Lankans to beware of human trafficking scams, as complaints about fake employment and education agencies are increasing. The embassy advises Sri Lankans not to fall victim to these schemes and to be cautious when traveling to Russia.",
      "Mission News"
    ],
    [
      "“Interconnected Business Networking Session” between Sri Lankan and Turkish business community to enhance bilateral trade, tourism and investment",
      "19.11.2020",
      "https://mfa.gov.lk/en/interconnected-business-networking-session-between-sri-lankan-and-turkish-business-community-to-enhance-bilateral-trade-tourism-and-investment/",
      "The Embassy organized an \"Interconnected Business Networking Session\" today (18/11/2020) in collaboration with the Turkish Economic Relations Board (DEIK), Sri Lanka Export Development Board, and Board of Inv to boost bilateral trade, tourism, and investment between the Sri Lankan and Turkish business communities.",
      "Mission News"
    ],
    [
      "Sri Lanka – Oman Food Sector Companies hold B2B webinar to promote Sri Lankan exports of food products",
      "18.11.2020",
      "https://mfa.gov.lk/en/sri-lanka-oman-food-sector-companies-hold-b2b-webinar-to-promote-sri-lankan-exports-of-food-products/",
      "The Sri Lanka Embassy in Oman and Export Development Board collaborated to host a B2B webinar connecting SPAR Oman with 16 Sri Lankan food exporter companies on November 12, 2020. The aim was to promote Sri Lankan food product exports and explore synergies between the companies.",
      "Mission News"
    ],
    [
      "Sri Lankan Mission in Cairo promotes Tourism via Live Virtual Tour on Wildlife",
      "16.11.2020",
      "https://mfa.gov.lk/en/sri-lankan-mission-in-cairo-promotes-tourism-via-live-virtual-tour-on-wildlife/",
      "The Sri Lankan Mission in Cairo is promoting tourism by offering a live virtual tour showcasing the country's wildlife and rich flora and fauna. The initiative, called \"Go on a Couch Safari,\" aims to bring Sri Lanka's natural beauty to a global audience through a live streaming program.",
      "Mission News"
    ],
    [
      "Sacred Relics returned to historical Ananda Kuti Vihara by the Sri Lanka Embassy",
      "16.11.2020",
      "https://mfa.gov.lk/en/sacred-relics-returned-to-historical-ananda-kuti-vihara-by-the-sri-lanka-embassy/",
      "The Sri Lanka Embassy returned the Sacred Relics of Lord Buddha to the Ananda Kuti Vihara in Kathmandu during a special religious ceremony on 6 November 2020. The relics had been in the embassy's custody since March 2018, marking a significant event for the historical site.",
      "Mission News"
    ],
    [
      "Sri Lanka participation at the China International Import Expo (CIIE)  reaps positive results",
      "13.11.2020",
      "https://mfa.gov.lk/en/sri-lanka-participation-at-the-china-international-import-expo-ciie-reaps-positive-results/",
      "Sri Lanka's participation at the China International Import Expo (CIIE) in Shanghai from 5-10 November 2020 yielded positive outcomes, especially in the food sector. The Sri Lanka Pavilion attracted numerous business persons, with support from the Sri Lanka Embassy in China and Consulate.",
      "Mission News"
    ],
    [
      "Ceylon Tea dyed face masks and Ceylon Tea was ceremonially handed over to the Chamber",
      "06.11.2020",
      "https://mfa.gov.lk/en/ceylon-tea-dyed-face-masks-and-ceylon-tea-was-ceremonially-handed-over-to-the-chamber/",
      "Ambassador Shani Calyaneratne Karunaratne handed over Ceylon Tea dyed face masks and Ceylon Tea to Mohamed Choucair, Chairman of the Chamber of Commerce, Industry, and Agriculture during bilateral talks. Mohamed Choucair is also the Chairman of Lebanese Economic Organizations.",
      "Mission News"
    ],
    [
      "IT-BPM opportunities in Sri Lanka promoted among the British Sri Lankan community",
      "05.11.2020",
      "https://mfa.gov.lk/en/it-bpm-opportunities-in-sri-lanka-promoted-among-the-british-sri-lankan-community/",
      "The Sri Lanka High Commission in London, in partnership with the APSL UK and SLASSCOM, hosted a webinar on promoting IT-BPM opportunities in Sri Lanka among the British Sri Lankan community on the 29th.",
      "Mission News"
    ],
    [
      "Webinar to Explore Opportunities in IT and Business Process Outsourcing (BPO) Sectors",
      "04.11.2020",
      "https://mfa.gov.lk/en/webinar-to-explore-opportunities-in-it-and-business-process-outsourcing-bpo-sectors/",
      "A webinar titled \"Sri Lanka: Business Opportunities in IT and Outsourcing\" was organized by the Chamber of Commerce (IHK) Frankfurt am Main and the Consulate General of Sri Lanka in Germany. The event, initiated by the Embassy of Sri Lanka, aimed to explore opportunities in the IT and Business Process Outsourcing (BPO) sectors.",
      "Mission News"
    ],
    [
      "Sri Lankan Embassy in Washington D.C. Organizes a Buddha Pooja and Dhamma Sermon  to Observe Vap Poya Day",
      "02.11.2020",
      "https://mfa.gov.lk/en/sri-lankan-embassy-in-washington-d-c-organizes-a-buddha-pooja-and-dhamma-sermon-to-observe-vap-poya-day/",
      "The Sri Lankan Embassy in Washington D.C. organized a Buddha Pooja and Dhamma Sermon on 30 October 2020 to observe Vap Poya Day, marking the end of the Vas-Rainy Retreat. The event took place at the Embassy premises.",
      "Mission News"
    ],
    [
      "‘Ceylon Tea’ promoted in Australia as an essential immunity booster to fight COVID-19 pandemic",
      "30.10.2020",
      "https://mfa.gov.lk/en/ceylon-tea-promoted-in-australia-as-an-essential-immunity-booster-to-fight-covid-19-pandemic/",
      "'Ceylon Tea' was promoted in Australia as a key immunity booster to combat the COVID-19 pandemic during a well-attended 'Virtual Ceylon Tea Evening' organized by the Consulate General of Sri Lanka. The event highlighted the significance of tea consumption for boosting immunity during these challenging times.",
      "Mission News"
    ],
    [
      "Katina Ceremony at the Embassy of Sri Lanka in Vienna",
      "30.10.2020",
      "https://mfa.gov.lk/en/katina-ceremony-at-the-embassy-of-sri-lanka-in-vienna/",
      "The Embassy of Sri Lanka in Vienna conducted a Katina Ceremony on October 26, 2020, featuring heel dana for the Maha Sangha followed by a Pirith Chanting Ceremony. The event took place at the Embassy, where offerings were made to the monks as part of the traditional ceremony.",
      "Mission News"
    ],
    [
      "Ambassador Ameer Ajwad Calls on the Minister of Commerce, Industry and Investment Promotion of Oman",
      "26.10.2020",
      "https://mfa.gov.lk/en/ambassador-ameer-ajwad-calls-on-the-minister-of-commerce-industry-and-investment-promotion-of-oman/",
      "Sri Lanka’s Ambassador to Oman, Ameer Ajwad, met with the new Minister of Commerce, Industry, and Investment Promotion, Qais bin Mohammed Al Yousef, on October 20, 2020. The meeting aimed to strengthen bilateral relations between the two countries.",
      "Mission News"
    ],
    [
      "Sri Lanka-Oman Collaboration in Manufacturing Fibreglass Products Mooted",
      "26.10.2020",
      "https://mfa.gov.lk/en/sri-lanka-oman-collaboration-in-manufacturing-fibreglass-products-mooted/",
      "Sri Lanka Embassy in Oman and the Export Development Board of Sri Lanka (EDB) collaborated to organize a B2B virtual meeting with Al Hilal Fiber & Acrylic Industry LLC, a prominent manufacturer of fiberglass and acrylic products. The meeting aimed to explore potential collaborations in manufacturing fiberglass products between Sri Lanka and Oman.",
      "Mission News"
    ],
    [
      "Promoting the best of Ceylon Cinnamon, Black Pepper and Sri Lankan Spices in Jordan",
      "26.10.2020",
      "https://mfa.gov.lk/en/promoting-the-best-of-ceylon-cinnamon-black-pepper-and-sri-lankan-spices-in-jordan/",
      "The Sri Lanka Embassy in Jordan is promoting the best of Ceylon Cinnamon, Black Pepper, and other Sri Lankan spices to highlight the value of these agricultural commodities. This initiative aims to raise awareness about the quality and benefits of Sri Lankan spices in the Jordanian market.",
      "Mission News"
    ],
    [
      "Sri Lanka Appoints An Honorary Consul in Texas, U.S.A.",
      "26.10.2020",
      "https://mfa.gov.lk/en/sri-lanka-appoints-an-honorary-consul-in-texas-u-s-a/",
      "Sri Lanka's Ambassador to the U.S., Rodney Perera, presented the Commission of Appointment from Foreign Minister Dinesh Gunawardena to Dakshini Se, the newly appointed Honorary Consul in Texas. This appointment strengthens Sri Lanka's representation in the U.S. and enhances diplomatic ties between the two countries.",
      "Mission News"
    ],
    [
      "Sri Lanka Participates at the “e-Connect” online B2B Platform in India",
      "24.10.2020",
      "https://mfa.gov.lk/en/sri-lanka-participates-at-the-e-connect-online-b2b-platform-in-india/",
      "The Sri Lanka Deputy High Commission in Chennai facilitated the participation of Sri Lankan electronic and electrical manufacturers at the \"e-Connect\" online B2B meetings platform organized by the Indian Electrical and Electronics Manufacturers' Association. Sri Lanka actively engaged with the Indian industry through this virtual platform to enhance business connections and opportunities.",
      "Mission News"
    ],
    [
      "‘Need for social protection has never been greater’ Sri Lanka tells the UNESCAP Committee on Social Development (CSD)",
      "24.10.2020",
      "https://mfa.gov.lk/en/need-for-social-protection-has-never-been-greater-sri-lanka-tells-the-unescap-committee-on-social-development-csd/",
      "Sri Lanka emphasized the urgent need for social protection during its leadership of the UNESCAP Committee on Social Development. The country was elected as Chair of the sixth session, highlighting the importance of addressing social challenges in the Asia-Pacific region.",
      "Mission News"
    ],
    [
      "Development assistance from Norwegian Investment Fund (Norfund) to Sri Lanka",
      "24.10.2020",
      "https://mfa.gov.lk/en/development-assistance-from-norwegian-investment-fund-norfund-to-sri-lanka/",
      "Norwegian Investment Fund (Norfund) is considering providing development assistance to Sri Lanka following a meeting between Ambassador Godfrey Cooray and CEO Tellef Thorleifsson on October 9, 2020. The discussion aimed to explore opportunities for increased investment and development in the country.",
      "Mission News"
    ],
    [
      "Ceylon Tea Dyed/Branded masks distributed at the “Salon Zen” Exhibition",
      "22.10.2020",
      "https://mfa.gov.lk/en/ceylon-tea-dyed-branded-masks-distributed-at-the-salon-zen-exhibition/",
      "At the \"Salon Zen\" Exhibition in Paris from 1 to 5 October 2020, Ceylon Tea Dyed/Branded masks were distributed. The event is known for focusing on personal development and the art of living.",
      "Mission News"
    ],
    [
      "Establishment of Sri Lankan Entrepreneurs Association in Qatar",
      "18.10.2020",
      "https://mfa.gov.lk/en/establishment-of-sri-lankan-entrepreneurs-association-in-qatar/",
      "Sri Lankan importers in Doha have founded the Sri Lankan Entrepreneurs Association in Qatar, which is now affiliated with the Embassy of Sri Lanka in Doha. The Association aims to foster significant growth opportunities for its members in Qatar.",
      "Mission News"
    ],
    [
      "Ambassador of Sri Lanka to the Republic of Cuba Presents Credentials",
      "18.10.2020",
      "https://mfa.gov.lk/en/ambassador-of-sri-lanka-to-the-republic-of-cuba-presents-credentials/",
      "Ambassador Lakshitha Ratnayake of Sri Lanka presented his credentials to President Miguel Mario Diaz-Canel Bermúdez of Cuba on October 14, 2020, at the Palacio de la Revolución, marking the official start of his diplomatic duties in Cuba.",
      "Mission News"
    ],
    [
      "Consul General Lakshman Hulugalle meets the Governor of New South Wales",
      "16.10.2020",
      "https://mfa.gov.lk/en/consul-general-lakshman-hulugalle-meets-the-governor-of-new-south-wales/",
      "Consul General Lakshman Hulugalle met with the Governor of New South Wales, Honourable Margaret Beazley AC QC, on October 13, 2020. During the meeting, he conveyed best wishes from the President and the Prime Minister.",
      "Mission News"
    ],
    [
      "Medical Faculty of University of Peradeniya Collaborates with Moscow City Clinical Hospital",
      "15.10.2020",
      "https://mfa.gov.lk/en/medical-faculty-of-university-of-peradeniya-collaborates-with-moscow-city-clinical-hospital/",
      "The Medical Faculty of University of Peradeniya collaborated with Moscow City Clinical Hospital in a video-conference to discuss specified areas for further collaboration. The experts exchanged opinions and explored opportunities for partnership.",
      "Mission News"
    ],
    [
      "Webinar on Market Enhancement for Sri Lankan Products and Services in Australia",
      "12.10.2020",
      "https://mfa.gov.lk/en/webinar-on-market-enhancement-for-sri-lankan-products-and-services-in-australia/",
      "The Consulate General of Sri Lanka in Sydney, in collaboration with the Export Development Board (EDB), hosted a webinar titled \"Market Enhancement for Sri Lankan Products and Services in Australia\" on October 7, 2020. The objective of the webinar was to promote Sri Lankan products and services in the Australian market, fostering trade relations between the two countries.",
      "Mission News"
    ],
    [
      "Prominent Sri Lankan and Omani Boat Building Companies agrees to collaborate at a B2B webinar",
      "09.10.2020",
      "https://mfa.gov.lk/en/prominent-sri-lankan-and-omani-boat-building-companies-agrees-to-collaborate-at-a-b2b-webinar/",
      "Prominent Sri Lankan and Omani boat building companies collaborated at a successful B2B webinar on October 8, 2020, aiming to promote cooperation between the two countries' boat building industries.",
      "Mission News"
    ],
    [
      "Sri Lanka Ambassador visits Luxembourg Stock Exchange",
      "07.10.2020",
      "https://mfa.gov.lk/en/sri-lanka-ambassador-visits-luxembourg-stock-exchange/",
      "Sri Lanka Ambassador to Luxembourg, Grace Asirwatham, visited the Luxembourg Stock Exchange on 23 September 2020. During her visit, she met with the Secretary General, Maurice Bauer, to discuss various matters. Head of Relationship Management was also present during the meeting.",
      "Mission News"
    ],
    [
      "Sri Lanka’s  Permanent Representative to  the African Union  Ambassador Sugeeshwara Gunaratna Presents Credentials",
      "07.10.2020",
      "https://mfa.gov.lk/en/sri-lankas-permanent-representative-to-the-african-union-ambassador-sugeeshwara-gunaratna-presents-credentials/",
      "Sri Lanka’s Permanent Representative to the African Union, Ambassador Sugeeshwara Gunaratna, presented credentials to the Chairperson of the African Union Commission, His Excellency Moussa Faki Mahamat, on October 6, 2020.",
      "Mission News"
    ],
    [
      "Exploring synergies for bilateral trade with the Philippines",
      "07.10.2020",
      "https://mfa.gov.lk/en/exploring-synergies-for-bilateral-trade-with-the-philippines/",
      "Sri Lankan Ambassador Shobini Gunasekera recently met with Philippine Chamber of Commerce and Industry President Benedicto V. Yujuico on October 1, 2020, to discuss enhancing bilateral trade relations between the two countries. The meeting aimed to explore synergies that could benefit both nations.",
      "Mission News"
    ],
    [
      "Sri Lanka, a Window to Larger Markets of India and EU for Agri Products and Processed food  – Sri Lankan Agripreneurs",
      "07.10.2020",
      "https://mfa.gov.lk/en/sri-lanka-a-window-to-larger-markets-of-india-and-eu-for-agri-products-and-processed-food-sri-lankan-agripreneurs/",
      "Sri Lankan Agripreneurs have launched a program to promote their agricultural products and processed food in the Indian market, aligning with President Gotabaya Rajapaksa's Export Economic Policy. The initiative aims to leverage Sri Lanka's strategic location as a gateway to larger markets in India and the EU. This effort was kicked off with a webinar in Mumbai last week.",
      "Mission News"
    ],
    [
      "Ambassador Asirwatham meets President of European Investment Bank in Luxembourg",
      "05.10.2020",
      "https://mfa.gov.lk/en/ambassador-asirwatham-meets-president-of-european-investment-bank-in-luxembourg/",
      "Ambassador Asirwatham met with Dr. Werner Ho, the President of the European Investment Bank in Luxembourg, following the recent meeting between the Foreign Ministers of Sri Lanka and Luxembourg in Colombo on January 31, 2020. The meeting aimed to strengthen ties between Sri Lanka and the European Investment Bank.",
      "Mission News"
    ],
    [
      "Sri Lankan Embassy in Washington D.C. Organizes a Buddha Pooja and Dhamma Sermon in view of Adhi Vap Poya Day",
      "05.10.2020",
      "https://mfa.gov.lk/en/sri-lankan-embassy-in-washington-d-c-organizes-a-buddha-pooja-and-dhamma-sermon-in-view-of-adhi-vap-poya-day/",
      "The Sri Lankan Embassy in Washington D.C. organized a Buddha Pooja and Dhamma Sermon on October 1, 2020, at the Embassy premises to mark Adhi Vap Poya Day. This event marked the first Dhamma Sermon organized by the Embassy.",
      "Mission News"
    ],
    [
      "Sports and fitness products manufactured with Sri Lankan natural latex rubber get exposure in the Jordan market.",
      "04.10.2020",
      "https://mfa.gov.lk/en/sports-and-fitness-products-manufactured-with-sri-lankan-natural-latex-rubber-get-exposure-in-the-jordan-market/",
      "Ambassador Shanika Dissanayake promoted Sri Lankan fitness products made with natural latex rubber in the Jordan market, including those from Textrip (Pvt) Ltd and Elasto Group. This initiative aimed to secure export orders for these companies and enhance commercial engagements between Sri Lanka and Jordan.",
      "Mission News"
    ],
    [
      "Ambassador meets Deputy Minister of Industry and Technology Hasan Buyukdede",
      "02.10.2020",
      "https://mfa.gov.lk/en/ambassador-meets-deputy-minister-of-industry-and-technology-hasan-buyukdede/",
      "Ambassador M. Rizvi Hassen met with Deputy Minister of Industry and Technology Hasan Buyukdede on September 29, 2020. The Ambassador briefed the Deputy Minister on trade matters during the meeting.",
      "Mission News"
    ],
    [
      "Ambassador Ameer Ajwad calls on the new Labour Minister of Oman",
      "30.09.2020",
      "https://mfa.gov.lk/en/ambassador-ameer-ajwad-calls-on-the-new-labour-minister-of-oman/",
      "Ambassador Ameer Ajwad of Sri Lanka visited the new Minister of Labour of Oman, Prof. Mahad Said bin Ali Baawain, on September 27, 2020, for a courtesy call. The meeting aimed to strengthen diplomatic relations between the two countries.",
      "Mission News"
    ],
    [
      "Sri Lanka calls for a paradigm shift on how tourism and travel is perceived in China",
      "29.09.2020",
      "https://mfa.gov.lk/en/sri-lanka-calls-for-a-paradigm-shift-on-how-tourism-and-travel-is-perceived-in-china/",
      "Consul General of Sri Lanka, Manorie Mallikaratchy, emphasized the need for a paradigm shift in how tourism and travel are perceived in China. In a presentation promoting Sri Lanka as a tourist destination, she highlighted the importance of adapting to the new normal era.",
      "Mission News"
    ],
    [
      "Sri Lanka participates in Guangdong 21st Century Maritime Silk Road International Exposition",
      "29.09.2020",
      "https://mfa.gov.lk/en/sri-lanka-participates-in-guangdong-21st-century-maritime-silk-road-international-exposition/",
      "Sri Lanka took part in the Guangdong 21st Century Maritime Silk Road International Exposition 2020 held from September 24-26 at the Canton Fair complex in Guangzhou. The event was organized by the China Council for the Promotion of International Trade, showcasing maritime trade opportunities.",
      "Mission News"
    ],
    [
      "Mission donates publications on Sri Lanka to the National Library of Turkey",
      "29.09.2020",
      "https://mfa.gov.lk/en/mission-donates-publications-on-sri-lanka-to-the-national-library-of-turkey/",
      "Ambassador M. Rizvi Hassen donated publications about Sri Lanka to the National Library of Turkey during a courtesy call on Director General Hamdi Turşucu of the Ministry of Culture and Tourism.",
      "Mission News"
    ],
    [
      "Meeting between the Suez Canal Authority and  the Embassy of Sri Lanka in Egypt",
      "25.09.2020",
      "https://mfa.gov.lk/en/meeting-between-the-suez-canal-authority-and-the-embassy-of-sri-lanka-in-egypt/",
      "The Ambassador of Sri Lanka in Egypt, Damayanthie Rajapakse, along with First Secretary (Commercial) Shiwanthi Abeyrathne and Trade Assistant Ahmed Selim, visited the Suez Canal Authority in Egypt to discuss collaboration opportunities. The meeting aimed to strengthen ties between Sri Lanka and Egypt through potential trade partnerships and mutual cooperation.",
      "Mission News"
    ],
    [
      "Ambassador Ameer Ajwad Meets with Dr. Said Al Saqri, new Minister for Economy of the Sultanate of Oman",
      "25.09.2020",
      "https://mfa.gov.lk/en/ambassador-ameer-ajwad-meets-with-dr-said-al-saqri-new-minister-for-economy-of-the-sultanate-of-oman/",
      "Ambassador Ameer Ajwad of Sri Lanka met with Dr. Said Al Saqri, the new Minister for Economy of the Sultanate of Oman on September 24, 2020. During the courtesy call, they discussed bilateral relations and cooperation between the two countries.",
      "Mission News"
    ],
    [
      "Webinar on “Market Opportunities and Strategies for Successful Market Entry to Brazil”.",
      "24.09.2020",
      "https://mfa.gov.lk/en/webinar-on-market-opportunities-and-strategies-for-successful-market-entry-to-brazil/",
      "The Embassy of Sri Lanka in Brazil, along with the Export Development Board (EDB) and the Department of Commerce of Sri Lanka, hosted a webinar on \"Market Opportunities and Strategies for Successful Market Entry to Brazil\" on September 15, 2020. The webinar aimed to provide insights for successful market entry into Brazil.",
      "Mission News"
    ],
    [
      "Sri Lanka participates in 2nd International Forum on Spice Route",
      "24.09.2020",
      "https://mfa.gov.lk/en/sri-lanka-participates-in-2nd-international-forum-on-spice-route/",
      "Sri Lanka took part in the 2nd International Forum on Spice Route, organized by The Spice Route Foundation and the Ministry of Education and Culture of Indonesia. The forum focused on celebrating diversity and promoting intercultural understanding.",
      "Mission News"
    ],
    [
      "Sri Lanka Embassy finalises certification for export of Sri Lankan Cinnamon  in bark form to Brazilian market",
      "21.09.2020",
      "https://mfa.gov.lk/en/the-embassy-of-sri-lanka-finalises-export-certification-process-of-sri-lankan-cinnamon-in-bark-form/",
      "The Sri Lanka Embassy in Brasilia has completed the certification process for exporting Sri Lankan Cinnamon in bark form to the Brazilian market. This allows Sri Lankan exporters to now access the Brazilian market with their cinnamon products.",
      "Mission News"
    ],
    [
      "Permanent Representative Majintha Jayesinghe Presents Credentials to the Comprehensive Nuclear-Test-Ban Treaty Organization (CTBTO)",
      "17.09.2020",
      "https://mfa.gov.lk/en/permanent-representative-majintha-jayesinghe-presents-credentials-to-the-comprehensive-nuclear-test-ban-treaty-organization-ctbto/",
      "Ambassador Majintha Jayesinghe presented her credentials to Dr. Lassina Zerbo, Executive Secretary of the Comprehensive Nuclear-Test-Ban Treaty Organization (CTBTO) on September 10, 2020, at the Vienna International Centre. This formal presentation signifies her official recognition as the Permanent Representative to the CTBTO.",
      "Mission News"
    ],
    [
      "Promotion of Tourism at the China (Guangdong) International Tourism Industry Exposition",
      "16.09.2020",
      "https://mfa.gov.lk/en/promotion-of-tourism-at-the-china-guangdong-international-tourism-industry-exposition/",
      "The Consulate General of Sri Lanka in Guangzhou collaborated with the Sri Lankan Guangdong Sunshine Holiday International Travel Agency Co. LTD to showcase tourism opportunities at the China (Guangdong) International Tourism Industry Exposition (CITIE). This partnership aimed to promote tourism between Sri Lanka and China, enhancing cultural exchange and travel experiences for visitors.",
      "Mission News"
    ],
    [
      "High-profile webinar on economy, business environment, joint ventures and bilateral trade between  Sri Lanka and South Korea",
      "16.09.2020",
      "https://mfa.gov.lk/en/high-profile-webinar-on-economy-business-environment-joint-ventures-and-bilateral-trade-between-sri-lanka-and-south-korea/",
      "A high-profile webinar on the economy, business environment, joint ventures, and bilateral trade between Sri Lanka and South Korea was organized by the Embassy of Sri Lanka in the Republic of Korea in collaboration with the Ceylon Chamber of Commerce (CCC), Korea Importers Association (KOIMA), and Korea Business Council. The event aimed to facilitate discussions and strengthen economic ties between the two countries.",
      "Mission News"
    ],
    [
      "Official Inauguration of the Honorary Consulate of Sri Lanka in Gdansk, Poland",
      "15.09.2020",
      "https://mfa.gov.lk/en/official-inauguration-of-the-honorary-consulate-of-sri-lanka-in-gdansk-poland/",
      "The Honorary Consulate of Sri Lanka, the only one in Northern Poland, was officially inaugurated on September 11, 2020, in Gdansk. Gdansk, a dynamic commercial city in the Pomera region, now hosts this consulate to strengthen bilateral relations.",
      "Mission News"
    ],
    [
      "Sri Lankan cuisine showcased at “Lulu Food Festival”, Bahrain",
      "14.09.2020",
      "https://mfa.gov.lk/en/sri-lankan-cuisine-showcased-at-lulu-food-festival-bahrain/",
      "Sri Lankan cuisine was highlighted at the \"Lulu Food Festival\" in Bahrain, organized by Lulu Hypermarket Bahrain, the largest regional hypermarket chain. The festival, held over weekends from August to September 2020 under the theme \"Food is Good,\" featured cuisines from a dozen countries.",
      "Mission News"
    ],
    [
      "Riyadh Chamber of Commerce lists Sri Lankan companies in their new online catalogue",
      "14.09.2020",
      "https://mfa.gov.lk/en/riyadh-chamber-of-commerce-lists-sri-lankan-companies-in-their-new-online-catalogue/",
      "The Riyadh Chamber of Commerce (RCC) has included Sri Lankan companies in their new online catalogue as part of their International Trade Cooperation initiative. This move aims to facilitate business linkages between Sri Lankan and Saudi companies, providing valuable assistance to interested parties.",
      "Mission News"
    ],
    [
      "Temasek Foundation of Singapore donates one million Livinguard face masks to Sri Lanka",
      "12.09.2020",
      "https://mfa.gov.lk/en/temasek-foundation-of-singapore-donates-one-million-livinguard-face-masks-to-sri-lanka/",
      "Temasek Foundation of Singapore donated one million Livinguard reusable masks to Sri Lanka in support of the country's fight against COVID-19. The masks were presented to Sri Lanka’s High Commissioner to Singapore, Sashikala Pre.",
      "Mission News"
    ],
    [
      "Destination Promotion in Vienna",
      "10.09.2020",
      "https://mfa.gov.lk/en/destination-promotion-in-vienna/",
      "The Embassy and Sri Lanka Tourism Promotion Bureau collaborated to promote the destination at the prestigious Welt Museum in Vienna. The event was attended by a large number of invitees, including representatives from the Diplomatic Corps and Government Institutions. The promotion aimed to showcase Sri Lanka as a desirable travel destination.",
      "Mission News"
    ],
    [
      "Permanent Representative Majintha Jayesinghe Presents Credentials to the International Atomic Energy Agency (IAEA)",
      "09.09.2020",
      "https://mfa.gov.lk/en/permanent-representative-majintha-jayesinghe-presents-credentials-to-the-international-atomic-energy-agency-iaea/",
      "Ambassador Majintha Jayesinghe presented her credentials to Rafael Mariano Grossi, Director General of the International Atomic Energy Agency (IAEA) on August 28, 2020, at the Vienna International Centre. This accreditation officially recognizes her as the Permanent Representative to the IAEA.",
      "Mission News"
    ],
    [
      "Permanent Representative Majintha Jayesinghe Presents Credentials United Nations Office in Vienna (UNOV) and UNODC",
      "09.09.2020",
      "https://mfa.gov.lk/en/permanent-representative-majintha-jayesinghe-presents-credentials-united-nations-office-in-vienna-unov-and-unodc/",
      "Ambassador Majintha Jayesinghe presented credentials to Ghada Fathi Waly, Director General of the United Nations Office in Vienna (UNOV), and the Executive Director of the UNODC on behalf of the Secretary-General of the United Nations. This signifies the official recognition of Ambassador Jayesinghe in her role at the UN offices in Vienna.",
      "Mission News"
    ],
    [
      "Ambassador Prof M.D. Lamawansa visits the modern facilities of Kursk State Medical University, the Oncological Hospital and Kursk State University of Russia",
      "08.09.2020",
      "https://mfa.gov.lk/en/ambassador-prof-m-d-lamawansa-visits-the-modern-facilities-of-kursk-state-medical-university-the-oncological-hospital-and-kursk-state-university-of-russia/",
      "Ambassador Prof M.D. Lamawansa visited modern facilities at Kursk State Medical University, the Oncological Hospital, and Kursk State University in Russia. The trip was organized by Sri Lanka’s Honorary Consul in Kursk, Mohamed Chahine, to strengthen ties in political, trade, tourism, culture, and education between the two countries.",
      "Mission News"
    ],
    [
      "Ambassador of Sri Lanka to Russia Prof. M.D. Lamawansa meets the Governor of the Kursk region and a government delegation.",
      "08.09.2020",
      "https://mfa.gov.lk/en/ambassador-of-sri-lanka-to-russia-prof-m-d-lamawansa-meets-the-governor-of-the-kursk-region-and-a-government-delegation/",
      "Ambassador of Sri Lanka to Russia Prof. M.D. Lamawansa led a delegation from the Sri Lankan Embassy on their first official visit to Kursk and the Kursk region from August 29 to September 2, 2020. During the visit, they met with the Governor of the Kursk region and other government officials.",
      "Mission News"
    ],
    [
      "Ambassador Dr. Nalin de Silva presented the Letter of Credence",
      "08.09.2020",
      "https://mfa.gov.lk/en/ambassador-dr-nalin-de-silva-presented-the-letter-of-credence/",
      "Ambassador Dr. Nalin de Silva presented the Letter of Credence to President Win Myint of Myanmar on September 1, 2020, at the Presidential palace in Nay Pyi Taw. This formal presentation marks the official start of Dr. Nalin de Silva's diplomatic role in Myanmar.",
      "Mission News"
    ],
    [
      "Consulate General of Sri Lanka in Guangzhou participates in 28th Guangzhou Fair",
      "04.09.2020",
      "https://mfa.gov.lk/en/consulate-general-of-sri-lanka-in-guangzhou-participates-in-28th-guangzhou-fair/",
      "The Consulate General of Sri Lanka in Guangzhou took part in the 28th Guangzhou Fair from August 25-31, 2020. The fair was organized by the Guangzhou Municipal People’s Government to showcase and promote Sri Lanka's economy and culture.",
      "Mission News"
    ],
    [
      "Sri Lankan Embassy in Washington D.C. Organizes a Special Event to Unveil the Statue of Lord Buddha and to Venerate the Sacred Jaya Sri Maha Bodhi Tree Sapling at the Embassy Premises",
      "04.09.2020",
      "https://mfa.gov.lk/en/sri-lankan-embassy-in-washington-d-c-organizes-a-special-event-to-unveil-the-statue-of-lord-buddha-and-to-venerate-the-sacred-jaya-sri-maha-bodhi-tree-sapling-at-the-embassy-premises/",
      "The Sri Lankan Embassy in Washington D.C. held a special event on September 2, 2020, to unveil the statue of Lord Buddha and venerate the sacred Jaya Sri Maha Bodhi Tree Sapling at the Embassy premises.",
      "Mission News"
    ],
    [
      "Ambassador Ameer Ajwad Meets with the newly appointed President of Oman Investment Authority (OIA)",
      "02.09.2020",
      "https://mfa.gov.lk/en/ambassador-ameer-ajwad-meets-with-the-newly-appointed-president-of-oman-investment-authority-oia/",
      "Ambassador Ameer Ajwad of Sri Lanka met with the newly appointed President of Oman Investment Authority (OIA), Abdulsalam Al-Murshidi, on August 31, 2020. They discussed potential bilateral cooperation between the two countries.",
      "Mission News"
    ],
    [
      "Meeting between Ambassador Godfrey Cooray and Managing Director of Norwegian Lobster Farm",
      "31.08.2020",
      "https://mfa.gov.lk/en/meeting-between-ambassador-godfrey-cooray-and-managing-director-of-norwegian-lobster-farm/",
      "Ambassador Godfrey Cooray met with Asbjøn Drenstig, the Managing Director of Norwegian Lobster Farm, a prominent figure in the lobster farming industry in Norway. Mr. Drenstig is actively engaged in the Sri Lanka-Norway Business match, fostering business relations between the two countries.",
      "Mission News"
    ],
    [
      "Ambassador Meets with the Norwegian Shipowners’ Association",
      "31.08.2020",
      "https://mfa.gov.lk/en/ambassador-meets-with-the-norwegian-shipowners-association/",
      "Ambassador Godfrey Cooray met with the Norwegian Shipowners’ Association, where Chief Executive Officer Harald Solberg and Helene Tofte, Director of International Cooperation and Climate, represented the Norwegian shipowners. The meeting aimed to discuss cooperation and climate initiatives within the maritime industry.",
      "Mission News"
    ],
    [
      "Ambassador Gunasekera delivers Key Note address at the Webinar on “Sustainable/eco-Tourism in Archipelagic and Island States Post COVID-19 Pandemic”",
      "31.08.2020",
      "https://mfa.gov.lk/en/ambassador-gunasekera-delivers-key-note-address-at-the-webinar-on-sustainable-eco-tourism-in-archipelagic-and-island-states-post-covid-19-pandemic/",
      "Ambassador Gunasekera delivered a keynote address at the Webinar on \"Sustainable/Eco-Tourism in Archipelagic and Island States Post COVID-19 Pandemic.\" The AIS Forum, established on November 1, 2018, in Manado, Indonesia, incorporates several Sustainable Development Goals, including SDG14.",
      "Mission News"
    ],
    [
      "Embassy of Sri Lanka in Jakarta organizes an Online Business Forum",
      "31.08.2020",
      "https://mfa.gov.lk/en/embassy-of-sri-lanka-in-jakarta-organizes-an-online-business-forum/",
      "The Embassy of Sri Lanka in Jakarta hosted an online Business Forum on August 27, 2020, in partnership with the Federation of Chambers of Commerce and Industry of Sri Lanka (FCCISL) and Hippindo, the Premier Retail Association. The forum aimed to facilitate business discussions and collaborations among participants.",
      "Mission News"
    ],
    [
      "Sri Lanka donates Ceylon Tea to the Royal Hospital Chelsea",
      "28.08.2020",
      "https://mfa.gov.lk/en/sri-lanka-donates-ceylon-tea-to-the-royal-hospital-chelsea/",
      "Sri Lanka donated Ceylon Tea to the Royal Hospital Chelsea on August 26, 2020, as a gesture of goodwill towards the British Army veterans. The donation was made to appreciate the service rendered by the iconic veterans.",
      "Mission News"
    ],
    [
      "Consul General of Sri Lanka calls on the State Secretary of the Federal State of Saarland",
      "25.08.2020",
      "https://mfa.gov.lk/en/consul-general-of-sri-lanka-calls-on-the-state-secretary-of-the-federal-state-of-saarland/",
      "The Consul General of Sri Lanka in Frankfurt, Madurika Joseph Weninger, met with the State Secretary of the German Federal State of Saarland, Henrik Eitel, at the State Chancellery in Saarbrucken. During the meeting, Weninger presented the Commission.",
      "Mission News"
    ],
    [
      "Furtherance of Cooperation with Hainan Province in Southern China",
      "25.08.2020",
      "https://mfa.gov.lk/en/furtherance-of-cooperation-with-hainan-province-in-southern-china/",
      "The Consul General of Sri Lanka, Priyangika Dharmasena, along with 72 Ambassadors, Consul Generals, and diplomatic representatives, visited Hainan Province in Southern China at the invitation of the Foreign Affairs Office. This visit aimed to further enhance cooperation between Sri Lanka and Hainan Province.",
      "Mission News"
    ],
    [
      "Ambassador designate Dr. Nalin de Silva met with the senior officials of the Ministry of Foreign Affairs of Myanmar",
      "25.08.2020",
      "https://mfa.gov.lk/en/ambassador-designate-dr-nalin-de-silva-met-with-the-senior-officials-of-the-ministry-of-foreign-affairs-of-myanmar/",
      "Ambassador designate Dr. Nalin de Silva met with senior officials of the Ministry of Foreign Affairs of Myanmar during his visit to Nay Pyi Taw to attend the opening ceremony of the fourth session of the Union pea. The meeting aimed to strengthen diplomatic ties between the two countries.",
      "Mission News"
    ],
    [
      "Sri Lanka High Commission in London celebrates Ganesh Chaturthi at Sri Vel Murugan Temple in Lewisham",
      "25.08.2020",
      "https://mfa.gov.lk/en/sri-lanka-high-commission-in-london-celebrates-ganesh-chaturthi-at-sri-velmurugan-temple-in-lewisham/",
      "The Sri Lanka High Commission in London celebrated Ganesh Chaturthi at Sri Vel Murugan Temple in Lewisham on August 22, 2020. Ganesh Chaturthi is a significant Hindu festival marking the birth of Lord Ganesha. The event brought together members of the community to observe and participate in the festivities.",
      "Mission News"
    ],
    [
      "Ambassador Manori Unambuwe presents Credentials",
      "24.08.2020",
      "https://mfa.gov.lk/en/ambassador-manori-unambuwe-presents-credentials/",
      "Ambassador Manori Unambuwe presented her credentials to the Federal President, Frank-Walter Steinmeier, officially becoming the Ambassador of the Democratic Socialist Republic of Sri Lanka to the Federal Republic of Germany on August 20.",
      "Mission News"
    ],
    [
      "Ambassador met Chairman of Foreign Relations Committee of AK Party",
      "21.08.2020",
      "https://mfa.gov.lk/en/ambassador-met-chairman-of-foreign-relations-committee-of-ak-party/",
      "Ambassador M. Rizvi Hassen met with Cevdet Yilmaz, the Chairman of the Foreign Relations Committee of the ruling AK Party, on August 17, 2020, in Ankara. They exchanged views on longstanding issues during the meeting.",
      "Mission News"
    ],
    [
      "Sri Lankan Embassy in Washington D.C. Discusses Strategies to Increase Exports to the U.S. with the Export Development Board, Sri Lanka",
      "21.08.2020",
      "https://mfa.gov.lk/en/sri-lankan-embassy-in-washington-d-c-discusses-strategies-to-increase-exports-to-the-u-s-with-the-export-development-board-sri-lanka/",
      "The Sri Lankan Embassy in Washington D.C. and the Export Development Board of Sri Lanka, represented by Ambassador Rodney Perera and Chairman Prabhash Subasinghe, respectively, collaborated on strategies to enhance and diversify Sri Lanka's exports to the United States. Their discussions aimed to align with the vision of increasing trade between the two countries.",
      "Mission News"
    ],
    [
      "“Sri Lanka is a very good friend of Nepal”: Prime Minister K. P. Sharma Oli",
      "20.08.2020",
      "https://mfa.gov.lk/en/sri-lanka-is-a-very-good-friend-of-nepal-prime-minister-k-p-sharma-oli/",
      "Prime Minister K.P. Sharma Oli emphasized the longstanding bilateral relations between Nepal and Sri Lanka, describing Sri Lanka as a \"very good friend\" of Nepal. His remarks highlight the strong historical ties between the two countries.",
      "Mission News"
    ],
    [
      "Viet Nam donates medical equipment to Sri Lanka",
      "14.08.2020",
      "https://mfa.gov.lk/en/viet-nam-donates-medical-equipment-to-sri-lanka/",
      "Viet Nam donated medical supplies worth USD 30,000 (over Rs. 5 million) to support Sri Lanka's fight against the COVID-19 pandemic on 14 August 2020. The donation was made by the Government of Viet Nam to aid Sri Lanka in combating the ongoing health crisis.",
      "Mission News"
    ],
    [
      "The Ambassador of Sri Lanka to Russia, Prof. M.D. Lamawansa visits the Moscow Clinical Centre for Infectious Diseases",
      "11.08.2020",
      "https://mfa.gov.lk/en/the-ambassador-of-sri-lanka-to-russia-prof-m-d-lamawansa-visits-the-moscow-clinical-centre-for-infectious-diseases/",
      "Ambassador Lamawansa visited the Moscow Clinical Centre for Infectious Diseases in Voronovskoye, Moscow region. He handed over 46 boxes of Ceylon tea as a token of appreciation from Sri Lanka. The gesture aimed to strengthen ties between the two countries.",
      "Mission News"
    ],
    [
      "Ambassador of Sri Lanka to Russia Prof. M.D. Lamawansa presents copies of credentials to Deputy Foreign Minister, Russian Ministry of Foreign Affairs",
      "11.08.2020",
      "https://mfa.gov.lk/en/ambassador-of-sri-lanka-to-russia-prof-m-d-lamawansa-presents-copies-of-credentials-to-deputy-foreign-minister-russian-ministry-of-foreign-affairs/",
      "On August 6, 2020, Sri Lanka's Ambassador to Russia, Prof. M.D. Lamawansa, presented his credentials to Russian Deputy Foreign Minister Igor V. Morgulov, officially assuming his duties.",
      "Mission News"
    ],
    [
      "Sri Lankan Embassy in Washington D.C. Organizes Dhamma Sermons to Observe Vassana Dhamma Programme 2020 and to Invoke Blessings on New Government, People of Sri Lanka and those Affected by COVID-19",
      "11.08.2020",
      "https://mfa.gov.lk/en/sri-lankan-embassy-in-washington-d-c-organizes-dhamma-sermons-to-observe-vassana-dhamma-programme-2020-and-to-invoke-blessings-on-new-government-people-of-sri-lanka-and-those-affected-by-covid-19/",
      "The Sri Lankan Embassy in Washington, D.C., along with the Buddhist Viharaya, organized a 'Buddha Pooja' and 'Dhamma Sermons' to observe the 'Vassana Dhamma Programme 2020'. The event aimed to invoke blessings on the new government, people of Sri Lanka, and those affected by COVID-19.",
      "Mission News"
    ],
    [
      "Ambassador designate of Sri Lanka to Myanmar discusses with the top management of Myanmar Airways International  on establishing direct air connectivity between the two countries",
      "10.08.2020",
      "https://mfa.gov.lk/en/ambassador-designate-of-sri-lanka-to-myanmar-discusses-with-the-top-management-of-myanmar-airways-international-on-establishing-direct-air-connectivity-between-the-two-countries/",
      "Ambassador-designate of Sri Lanka to Myanmar, Dr. Nalin de Silva, met with the top management of Myanmar Airways International to discuss establishing direct air connectivity between the two countries. They explored opportunities to enhance travel between Sri Lanka and Myanmar through direct flights.",
      "Mission News"
    ],
    [
      "Ambassador designate paid a Call on the Head of the Sitagu International Buddhist Academy in Myanmar",
      "07.08.2020",
      "https://mfa.gov.lk/en/ambassador-designate-paid-a-call-on-the-head-of-the-sitagu-international-buddhist-academy-in-myanmar/",
      "Ambassador-designate of Sri Lanka to Myanmar, Dr. Nalin de Silva, visited the Sitagu International Buddhist Academy in Yangon. The academy is known for providing undergraduate education and is one of the most popular Buddhist educational institutes in the region.",
      "Mission News"
    ],
    [
      "Sri Lankan Business and Professionals Society in Russia pays tribute to World War II Veterans and Labour Veterans",
      "05.08.2020",
      "https://mfa.gov.lk/en/sri-lankan-business-and-professionals-society-in-russia-pays-tribute-to-world-war-ii-veterans-and-labour-veterans/",
      "The Sri Lankan Business and Professionals Society in Russia honored World War II Veterans and Labour Veterans at Podolsk City's First Clinical Hospital. Representatives from the Sri Lankan Community in Moscow presented a consignment of Ceylon Tea, Sweets, and other food products to the Association. The gesture was a tribute to the veterans for their service and sacrifice.",
      "Mission News"
    ],
    [
      "Sri Lanka Ambassador felicitates the Doctor who performed critical surgery on a Sri Lankan migrant worker to deliver triplet babies in Oman amid COVID-19 challenges",
      "05.08.2020",
      "https://mfa.gov.lk/en/sri-lanka-ambassador-felicitates-the-doctor-who-performed-critical-surgery-on-a-sri-lankan-migrant-worker-to-deliver-triplet-babies-in-oman-amid-covid-19-challenges/",
      "Sri Lanka Ambassador to Oman, O.L. Ameer Ajwad, honored Dr. Tahira Kazmi, a Senior Consultant Obstetrician and Gynecologist, for successfully performing a critical surgery at Khoula Hospital. The surgery involved delivering triplet babies for a Sri Lankan migrant worker amidst COVID-19 challenges.",
      "Mission News"
    ],
    [
      "REVITALIZING BILATERAL TRADE AND INVESTMENT BETWEEN SRI LANKA AND GERMANY",
      "05.08.2020",
      "https://mfa.gov.lk/en/revitalizing-bilateral-trade-and-investment-between-sri-lanka-and-germany/",
      "The Consulate General of Sri Lanka in Frankfurt am Main organized a Business Forum on July 31, 2020, during the visit of Ambassador-designate Manori Unambuwe to Germany to revitalize bilateral trade and investment between Sri Lanka and Germany. The forum aimed to strengthen economic ties and promote collaboration between the two countries.",
      "Mission News"
    ],
    [
      "Virtual dialogue Konya Chamber of Commerce and the Ceylon Chamber of Commerce to enhance trade and investment between Sri Lanka and Turkey",
      "29.07.2020",
      "https://mfa.gov.lk/en/virtual-dialogue-konya-chamber-of-commerce-and-the-ceylon-chamber-of-commerce-to-enhance-trade-and-investment-between-sri-lanka-and-turkey/",
      "The Embassy of Sri Lanka in Turkey facilitated a virtual meeting between the Konya Chamber of Commerce of Turkey and the Ceylon Chamber of Commerce to boost trade and investment between Sri Lanka and Turkey. The dialogue aimed to establish a foundation for future partnerships and collaboration.",
      "Mission News"
    ],
    [
      "Third largest conglomerate in South Korea eager to commit investments in Sri Lanka",
      "29.07.2020",
      "https://mfa.gov.lk/en/third-largest-conglomerate-in-south-korea-eager-to-commit-investments-in-sri-lanka/",
      "The Ambassador of Sri Lanka to the Republic of Korea, Dr. A. Saj U. Mendis, met with the top management of SK Group, the third largest conglomerate in South Korea, to discuss potential investments and foreign direct investment (FDI) opportunities in Sri Lanka. The SK Group expressed eagerness to commit investments in Sri Lanka, signaling potential economic cooperation between the two countries.",
      "Mission News"
    ],
    [
      "Ambassador meets Heads of prominent Trade Chambers in Konya",
      "23.07.2020",
      "https://mfa.gov.lk/en/ambassador-meets-heads-of-prominent-trade-chambers-in-konya/",
      "Ambassador M. Rizvi Hassen met with the Chairmen of the Konya Chamber of Commerce, Selçuk Öztürk, and the Chamber of Industry Konya, Memis Kutukcu, along with their executive committee members on July 17, 2020. The meeting aimed to discuss trade relations and cooperation between the chambers and the ambassador.",
      "Mission News"
    ],
    [
      "Ambassador Asirwatham calls on Executive Director of Europol in The Hague",
      "23.07.2020",
      "https://mfa.gov.lk/en/ambassador-asirwatham-calls-on-executive-director-of-europol-in-the-hague/",
      "Ambassador Grace Asirwatham met with Europol's Executive Director Catherine De Bolle in The Hague on July 16, 2020. Europol is the European Union's Agency for Law Enforcement Cooperation, responsible for handling criminal intelligence and combating organized crime. The meeting aimed to discuss collaboration and strategies to enhance law enforcement efforts.",
      "Mission News"
    ],
    [
      "Buddhist Religious Observances in Brussels",
      "22.07.2020",
      "https://mfa.gov.lk/en/buddhist-religious-observances-in-brussels/",
      "Buddhist religious observances, including Dhamma deshana and sanghika dana, were organized by the Embassy of Sri Lanka in Brussels, Belgium on July 19, 2020. Venerable members of the Buddhist clergy led the event at the Official Residence.",
      "Mission News"
    ],
    [
      "Ambassador visits Necmettin Erbakan University and Selcuk University in Konya",
      "21.07.2020",
      "https://mfa.gov.lk/en/ambassador-visits-necmettin-erbakan-university-and-selcuk-university-in-konya/",
      "Ambassador M. Rizvi Hassen visited Necmettin Erbakan University and Selcuk University in Konya to promote cultural and educational diplomacy between Sri Lanka and Turkey. During the visit, he met with the Rector of Selcuk University to explore opportunities in the higher education sector.",
      "Mission News"
    ],
    [
      "Ambassador Lamawansa discusses Russia – Sri Lanka relations on ‘Global Talk”",
      "21.07.2020",
      "https://mfa.gov.lk/en/ambassador-lamawansa-discusses-russia-sri-lanka-relations-on-global-talk/",
      "Sri Lanka Ambassador to Russia M. D. Lamawansa highlighted the strong bonds of friendship and trust between Sri Lanka and Russia during an episode of 'Global Talk.' These ties have continued to strengthen despite changes in the global and regional landscape.",
      "Mission News"
    ],
    [
      "Consulate General of Sri Lanka in Dubai continuous to provide welfare assistance to Sri Lankan expatriates",
      "17.07.2020",
      "https://mfa.gov.lk/en/consulate-general-of-sri-lanka-in-dubai-continuous-to-provide-welfare-assistance-to-sri-lankan-expatriates/",
      "The Consulate General of Sri Lanka in Dubai and Northern Emirates is actively providing welfare assistance to Sri Lankan expatriates facing hardships due to the current situation. Their efforts aim to support and alleviate the challenges experienced by the expatriate community.",
      "Mission News"
    ],
    [
      "‘World Youth Skills Day 2020’ celebrated by the  UN Headquarters in New York",
      "16.07.2020",
      "https://mfa.gov.lk/en/world-youth-skills-day-2020-celebrated-by-the-un-headquarters-in-new-york-2/",
      "The UN Headquarters in New York celebrated 'World Youth Skills Day 2020'. Lessons from the COVID-19 pandemic should be used to enhance TVET skills development and lifelong learning, offering new teaching and learning solutions for a positive impact. These innovations could greatly benefit education and skill-building efforts worldwide.",
      "Mission News"
    ],
    [
      "Ambassador Lamawansa hands over Ceylon Tea to leading hospitals in Russia",
      "13.07.2020",
      "https://mfa.gov.lk/en/ambassador-lamawansa-hands-over-ceylon-tea-to-leading-hospitals-in-russia/",
      "Ambassador Designate Prof. M. D. Lamawansa delivered 40,800 Ceylon tea bags to Moscow Clinical Hospital No. 40, also known as the Kommunarka Hospital in Russia. The tea donation aims to support the healthcare workers and patients at the leading hospitals in Russia.",
      "Mission News"
    ],
    [
      "Ambassador Prasanna Gamage meets with Mr. Vu Duc Giang, Chairman of Viet Nam Textile & Apparel Association",
      "12.07.2020",
      "https://mfa.gov.lk/en/ambassador-prasanna-gamage-meets-with-mr-vu-duc-giang-chairman-of-viet-nam-textile-apparel-association/",
      "Ambassador Prasanna Gamage met with Mr. Vu Duc Giang, Chairman of Viet Nam Textile & Apparel Association, in Ha Noi on 09 July 2020. They discussed cooperation between Sri Lanka and VITAS.",
      "Mission News"
    ],
    [
      "Laying of the foundation stone for a stupa at the Birmingham Buddhist Maha Vihara",
      "10.07.2020",
      "https://mfa.gov.lk/en/laying-of-the-foundation-stone-for-a-stupa-at-the-birmingham-buddhist-maha-vihara/",
      "The foundation stone for a stupa at the Birmingham Buddhist Maha Vihara was laid on July 5, 2020, by High Commissioner Saroja Sirisena and diplomatic officers from the Sri Lanka High Commission in London. This event marks a significant milestone for the Birmingham Buddhist community.",
      "Mission News"
    ],
    [
      "Ambassador-designate of Sri Lanka to Germany assumes duties",
      "08.07.2020",
      "https://mfa.gov.lk/en/ambassador-designate-of-sri-lanka-to-germany-assumes-duties/",
      "Manori Unambuwe, the Ambassador-designate of Sri Lanka to Germany, officially began her duties at the Sri Lankan Embassy in Berlin on July 6, 2020. She was warmly welcomed upon her arrival at the Embassy.",
      "Mission News"
    ],
    [
      "The United Nations marks 20 years of the Commemoration of the International Day of Vesak",
      "03.07.2020",
      "https://mfa.gov.lk/en/the-united-nations-marks-20-years-of-the-commemoration-of-the-international-day-of-vesak/",
      "The United Nations marked the 20th anniversary of the International Day of Vesak virtually on 2 July 2020 in New York due to the COVID-19 pandemic. Member States were unable to gather at the UN General Assembly Hall for the commemoration.",
      "Mission News"
    ],
    [
      "Ambassador Majintha Jayesinghe presented Letters of Credence in Austria",
      "03.07.2020",
      "https://mfa.gov.lk/en/ambassador-majintha-jayesinghe-presented-letters-of-credence-in-austria/",
      "Ambassador Majintha Jayesinghe presented her Letters of Credence to the Federal President of Austria, Dr. Alexander Van der Bellen, at the Hofburg Palace in Vienna. She assumed her role as the Ambassador Extraordinary and Plenipotentiary during the ceremony.",
      "Mission News"
    ],
    [
      "Ambassador-Designate Prof. M.D. Lamawansa meets his Uzbekistan counterpart H.E. Botirzhon Asadov",
      "03.07.2020",
      "https://mfa.gov.lk/en/ambassador-designate-prof-m-d-lamawansa-meets-his-uzbekistan-counterpart-h-e-botirzhon-asadov/",
      "Ambassador-Designate Prof. M.D. Lamawansa met with his Uzbekistan counterpart, Ambassador Botirzhon Asadov, on June 30, 2020. The meeting took place as part of Lamawansa's preparations for his role as Sri Lanka's Ambassador to the Russian Federation.",
      "Mission News"
    ],
    [
      "Prime Minister Meets African Heads of Mission and Discusses Further Strengthening Relations and Issues Faced by the Afro-Lankan Community",
      "01.07.2020",
      "https://mfa.gov.lk/en/prime-minister-meets-african-heads-of-mission-and-discusses-further-strengthening-relations-and-issues-faced-by-the-afro-lankan-community/",
      "Prime Minister held a meeting with African Heads of Mission to discuss enhancing relations and addressing challenges faced by the Afro-Lankan community. The discussions focused on strengthening ties and resolving issues affecting the community.",
      "Mission News"
    ],
    [
      "Sri Lankan chicken sale kicks off in Omani market",
      "29.06.2020",
      "https://mfa.gov.lk/en/sri-lankan-chicken-sale-kicks-off-in-omani-market/",
      "The Ambassador of Sri Lanka to Oman, O.L. Ameer Ajwad, inaugurated the first sale of Sri Lankan chicken in Oman at Al Hamadi Trading & Contracting LLC. The company recently imported frozen chicken from Sri Lanka, marking the beginning of its availability in the Omani market.",
      "Mission News"
    ],
    [
      "Ambassador Shani Calyaneratne Karunaratne calls on Minister of Foreign Affairs and Emigrants of the Republic of Lebanon",
      "25.06.2020",
      "https://mfa.gov.lk/en/ambassador-shani-calyaneratne-karunaratne-calls-on-minister-of-foreign-affairs-and-emigrants-of-the-republic-of-lebanon/",
      "Ambassador Shani Calyaneratne Karunaratne met with Minister of Foreign Affairs and Emigrants of Lebanon, Nassif Hitti, on June 24, 2020, at the Ministry of Foreign Affairs premises for discussions.",
      "Mission News"
    ],
    [
      "Ambassador Godfrey Cooray Presents Credentials",
      "24.06.2020",
      "https://mfa.gov.lk/en/ambassador-godfrey-cooray-presents-credentials/",
      "Ambassador Godfrey Cooray presented his credentials to King Harald V at the Royal Palace in Oslo on June 22, 2020, as the newly appointed Ambassador of Sri Lanka to Norway. The Ambassador was warmly received in the royal setting.",
      "Mission News"
    ],
    [
      "Ambassador-designate of Sri Lanka to the Kingdom of Norway Godfrey Cooray assumes duties",
      "17.06.2020",
      "https://mfa.gov.lk/en/ambassador-designate-of-sri-lanka-to-the-kingdom-of-norway-godfrey-cooray-assumes-duties/",
      "Godfrey Cooray, the newly appointed Ambassador-designate of Sri Lanka to the Kingdom of Norway, assumed his duties at the Mission on 15 June 2020. His inauguration was commemorated with a simple ceremony.",
      "Mission News"
    ],
    [
      "Poson Celebrations in Ho Chi Minh City – Viet Nam",
      "17.06.2020",
      "https://mfa.gov.lk/en/poson-celebrations-in-ho-chi-minh-city-viet-nam/",
      "The Sri Lankan expatriate community in Ho Chi Minh City, Viet Nam, along with members of Sri Lanka Sports Club (SSC), organized a Dhamma Sermon, Alms Giving, and Dansela to commemorate the introduction of Buddhism. The event celebrated Poson, an important festival in Sri Lanka, and aimed to promote cultural exchange and unity among participants.",
      "Mission News"
    ],
    [
      "Statement of the High Commission of Sri Lanka on the Private Member Bill 104 presented to the Ontario Legislative Assembly",
      "10.06.2020",
      "https://mfa.gov.lk/en/statement-of-the-high-commission-of-sri-lanka-on-the-private-member-bill-104-presented-to-the-ontario-legislative-assembly/",
      "The High Commission of Sri Lanka in Ottawa has noted media reports about Private Member Bill 104 introduced in 2019 to the Ontario Legislative Assembly. The High Commission is actively monitoring the situation and working closely with relevant authorities to address any concerns.",
      "Mission News"
    ],
    [
      "Sri Lanka and Thailand reassures partnership in bilateral and multilateral spheres",
      "10.06.2020",
      "https://mfa.gov.lk/en/sri-lanka-and-thailand-reassures-partnership-in-bilateral-and-multilateral-spheres/",
      "Sri Lankan Ambassador Samantha K. Jayasuriya met with Thai Foreign Affairs Minister Don Pramudwinai to discuss enhancing cooperation in both bilateral and multilateral relations. The meeting aimed to strengthen the partnership between Sri Lanka and Thailand in various spheres.",
      "Mission News"
    ],
    [
      "Sri Lanka Embassy in Oman initiates the first ever Sri Lankan export of poultry product to Oman",
      "10.06.2020",
      "https://mfa.gov.lk/en/sri-lanka-embassy-in-oman-initiates-the-first-ever-sri-lankan-export-of-poultry-product-to-oman/",
      "The Sri Lanka Embassy in Oman has facilitated the first-ever export of Sri Lankan poultry products to Oman under the Economic Diplomacy Programme of the Ministry of Foreign Relations. This marks a significant milestone in bilateral trade relations between the two countries.",
      "Mission News"
    ],
    [
      "Lebanon agrees to conduct free PCR tests for Sri Lankans seeking to be repatriated",
      "06.06.2020",
      "https://mfa.gov.lk/en/lebanon-agrees-to-conduct-free-pcr-tests-for-sri-lankans-seeking-to-be-repatriated/",
      "Lebanon has agreed to provide free PCR tests for Sri Lankans seeking repatriation. This decision aligns with Sri Lanka's policy on bringing back its citizens from abroad. Ambassador Shani Calyaneratne Karunarat confirmed the arrangement.",
      "Mission News"
    ],
    [
      "Justice Anthony Francis Tissa Fernando sworn in as the President of the Court of Appeal in Seychelles",
      "04.06.2020",
      "https://mfa.gov.lk/en/justice-anthony-francis-tissa-fernando-sworn-in-as-the-president-of-the-court-of-appeal-in-seychelles/",
      "Justice Anthony Francis Tissa Fernando, holding dual Sri Lankan and Seychellois citizenship, was sworn in as the President of the Court of Appeal in Seychelles on June 1, 2020, by the President of the Republic of Seychelles.",
      "Mission News"
    ],
    [
      "Welfare of Sri Lankans in Jordan utmost priority",
      "31.05.2020",
      "https://mfa.gov.lk/en/welfare-of-sri-lankans-in-jordan-utmost-priority/",
      "The Embassy of Sri Lanka is closely monitoring the Covid-19 situation in Jordan and taking necessary measures to safeguard the welfare of Sri Lankans in the country. They are committed to ensuring the safety and well-being of Sri Lankan citizens residing in Jordan.",
      "Mission News"
    ],
    [
      "Sri Lanka and Cambodia mark 68 years of diplomatic relations",
      "29.05.2020",
      "https://mfa.gov.lk/en/sri-lanka-and-cambodia-mark-68-years-of-diplomatic-relations/",
      "Sri Lanka and Cambodia celebrated the 68th Anniversary of their diplomatic relations on May 28. Ravinatha Aryasinha, Secretary to the Ministry of Foreign Affairs, conveyed felicitations on this occasion.",
      "Mission News"
    ],
    [
      "NHS UK enjoys a cup of Ceylon Tea while working round the clock",
      "27.05.2020",
      "https://mfa.gov.lk/en/nhs-uk-enjoys-a-cup-of-ceylon-tea-while-working-round-the-clock/",
      "The National Health Service (NHS) UK, working tirelessly during the Covid-19 pandemic, received a donation of Ceylon tea as a gesture of support and appreciation for their efforts in saving lives.",
      "Mission News"
    ],
    [
      "Sri Lanka plays an active role at the CS 76 in Bangkok",
      "25.05.2020",
      "https://mfa.gov.lk/en/sri-lanka-plays-an-active-role-at-the-cs-76-in-bangkok/",
      "Sri Lanka actively participated in the seventy-sixth session (CS 76) of the Economic and Social Commission for Asia and the Pacific (ESCAP) held virtually for the first time due to the COVID-19 situation. The session took place in Bangkok, marking a historic shift in the format of the event.",
      "Mission News"
    ],
    [
      "Sri Lanka elected as Chair of the Seventh Asia Pacific Forum on Sustainable Development (APFSD), in Bangkok",
      "22.05.2020",
      "https://mfa.gov.lk/en/sri-lanka-elected-as-chair-of-the-seventh-asia-pacific-forum-on-sustainable-development-apfsd-in-bangkok/",
      "Sri Lanka was elected as the Chair of the Seventh Asia Pacific Forum on Sustainable Development (APFSD) during a virtual meeting held on 20 May in Bangkok, Thailand. This marked the first time the forum was held virtually in response to the COVID-19 pandemic, adapting to the 'new normal'.",
      "Mission News"
    ],
    [
      "Cuban Doctors to provide Medical Assistance to Sri Lankan Migrant Workers in Haiti",
      "10.05.2020",
      "https://mfa.gov.lk/en/cuban-doctors-to-provide-medical-assistance-to-sri-lankan-migrant-workers-in-haiti/",
      "Cuban doctors have been dispatched by the Cuban Government, in response to a request from the Sri Lankan Government, to provide medical assistance to Sri Lankan migrant workers in Haiti. The five-member medical team arrived on the 7th of March to attend to the healthcare needs of the workers.",
      "Mission News"
    ],
    [
      "20th Anniversary of the International Recognition of Vesak commemorated in Geneva",
      "09.05.2020",
      "https://mfa.gov.lk/en/20th-anniversary-of-the-international-recognition-of-vesak-commemorated-in-geneva/",
      "The 20th Anniversary of the International Recognition of Vesak was commemorated in Geneva today, marking the International Day of Vesak and the adoption of UN General Assembly resolution 54/115. The event celebrated the global recognition of Vesak and its significance.",
      "Mission News"
    ],
    [
      "Webinar with the Sri Lanka –China Business Council of the Ceylon Chamber of Commerce",
      "30.04.2020",
      "https://mfa.gov.lk/en/webinar-with-the-sri-lanka-china-business-council-of-the-ceylon-chamber-of-commerce/",
      "The Sri Lanka-China Business Council of the Ceylon Chamber of Commerce held a webinar titled \"COVID-19: China’s experience\" on April 30, 2020. The event featured the participation of the Consul General of Sri Lanka in Shanghai, Manorie Ma.",
      "Mission News"
    ],
    [
      "Consul General Melbourne Says Students In Australia Are Safe And Short Term Visa Holders May Apply For Visa Extensions",
      "17.04.2020",
      "https://mfa.gov.lk/en/consul-general-melbourne-says-students-in-australia-are-safe-and-short-term-visa-holders-may-apply-for-visa-extensions/",
      "The Consul General in Melbourne reassures that students in Australia are safe and short-term visa holders can apply for extensions. Sri Lankan community organizations and well-wishers are offering assistance to those affected in Melbourne.",
      "Mission News"
    ],
    [
      "Sri Lanka Embassy in Thailand initiates virtual meetings to stay close to the Sri Lankan student community in the fight against Covid-19 pandemic",
      "03.04.2020",
      "https://mfa.gov.lk/en/sri-lanka-embassy-in-thailand-initiates-virtual-meetings-to-stay-close-to-the-sri-lankan-student-community-in-the-fight-against-covid-19-pandemic/",
      "The Sri Lanka Embassy in Thailand has launched virtual meetings to support Sri Lankan students during the Covid-19 pandemic. They have established a 24/7 emergency contact and social media groups for Sri Lankan communities in Thailand and Laos. This initiative aims to stay connected and provide assistance during these challenging times.",
      "Mission News"
    ],
    [
      "Sri Lankan Community in China and Chinese Friends of Sri Lanka Donate Essential Medical Supplies",
      "03.04.2020",
      "https://mfa.gov.lk/en/sri-lankan-community-in-china-and-chinese-friends-of-sri-lanka-donate-essential-medical-supplies/",
      "The Sri Lanka Embassy in Beijing, along with the Sri Lankan community in China and Chinese friends of Sri Lanka, donated essential medical supplies including surgical masks, forehead thermometers, disposable face masks, and N95 masks. This initiative aims to support healthcare efforts in both countries during the ongoing pandemic.",
      "Mission News"
    ],
    [
      "Guangdong Province Science and Technology Cooperation Award 2019, presented to Sri Lankan Scientist",
      "31.03.2020",
      "https://mfa.gov.lk/en/guangdong-province-science-and-technology-cooperation-award-2019-presented-to-sri-lankan-scientist/",
      "Sri Lankan Scientist, Professor Tilak P.D. Gamage from the University of Ruhuna's Faculty of Fishery and Marine Sciences and Technology, received the Guangdong Province Science and Technology Cooperation Award 2019 on March 25, 2020.",
      "Mission News"
    ],
    [
      "Sri Lanka High Commission in Singapore facilitates the sending of 12500 urgently needed COVID 19 test kits to Sri Lanka",
      "31.03.2020",
      "https://mfa.gov.lk/en/sri-lanka-high-commission-in-singapore-facilitates-the-sending-of-12500-urgently-needed-covid-19-test-kits-to-sri-lanka/",
      "The Sri Lanka High Commission in Singapore facilitated the dispatch of 12,500 urgently needed COVID-19 test kits to Sri Lanka. The consignment, including over 20,000 reagents for testing 7,500 samples, arrived in Colombo this morning, aiding the country's testing efforts.",
      "Mission News"
    ],
    [
      "Sri Lankan Community in Eastern China and the Sri Lanka Consulate in Shanghai donate essential medical equipment to frontline medical workers",
      "31.03.2020",
      "https://mfa.gov.lk/en/sri-lankan-community-in-eastern-china-and-the-sri-lanka-consulate-in-shanghai-donate-essential-medical-equipment-to-frontline-medical-workers/",
      "The Sri Lanka Consulate in Shanghai, along with the Sri Lankan community in Eastern China, donated essential medical equipment and protective clothing to frontline medical workers. This collaborative effort aimed to support and assist healthcare professionals in their fight against the ongoing challenges posed by the pandemic.",
      "Mission News"
    ],
    [
      "Updates on Sri Lankan Students in Southern India",
      "27.03.2020",
      "https://mfa.gov.lk/en/updates-on-sri-lankan-students-in-southern-india/",
      "The Sri Lanka Deputy High Commission is compiling information on Sri Lankan students in South India to ensure their safety and welfare. There are approximately 600 Sri Lankan students across India, and efforts are being made to support them.",
      "Mission News"
    ],
    [
      "COVID-19 Outbreak   Donation to Sri Lanka by Temasek Foundation, Singapore",
      "24.03.2020",
      "https://mfa.gov.lk/en/covid-19-outbreak-donation-to-sri-lanka-by-temasek-foundation-singapore/",
      "Temasek Foundation, Singapore has donated 5000 Fortitude Kit 2.0 (COVID-19 test kits) to the Ministry of Health in Sri Lanka to support the country during the COVID-19 outbreak. This donation aims to assist Sri Lanka in managing the evolving situation and enhancing testing capabilities.",
      "Mission News"
    ],
    [
      "Ambassador of Sri Lanka to Viet Nam calls on Secretary of Ho Chi Minh City Party Committee Dr.  Nguyen Thien Nhan",
      "18.03.2020",
      "https://mfa.gov.lk/en/ambassador-of-sri-lanka-to-viet-nam-calls-on-secretary-of-ho-chi-minh-city-party-committee-dr-nguyen-thien-nhan/",
      "Ambassador of Sri Lanka to Viet Nam, Prasanna Gamage, visited Ho Chi Minh City and met with Secretary of the Ho Chi Minh City Party Committee, Dr. Nguyen Thien Nhan, on March 10, 2020.",
      "Mission News"
    ],
    [
      "Ambassador of Sri Lanka to Viet Nam meets with Chairman of the Ho Chi Minh City People’s Committee Nguyen Thang Phong",
      "18.03.2020",
      "https://mfa.gov.lk/en/ambassador-of-sri-lanka-to-viet-nam-meets-with-chairman-of-the-ho-chi-minh-city-peoples-committee-nguyen-thang-phong/",
      "Ambassador of Sri Lanka to Viet Nam, Prasanna Gamage, met with Chairman of the Ho Chi Minh City People’s Committee, Nguyen Thang Phong, during his official visit to the city on March 12, 2020. The meeting aimed to discuss bilateral cooperation and strengthen ties between the two countries.",
      "Mission News"
    ],
    [
      "Ambassador meets Governor of Nevsehir and the Chairman of Nevsehir Chamber of Commerce and Industry",
      "18.03.2020",
      "https://mfa.gov.lk/en/ambassador-meets-governor-of-nevsehir-and-the-chairman-of-nevsehir-chamber-of-commerce-and-industry/",
      "Ambassador M. Rizvi Hassen met with Governor Ilhami Aktas of Nevsehir region and the Chairman of Nevsehir Chamber of Commerce and Industry on March 13, 2020. During the meeting, the Ambassador requested the Governor's support for a specific initiative.",
      "Mission News"
    ],
    [
      "Embassy of Sri Lanka in Moscow celebrates  International Women’s Day",
      "12.03.2020",
      "https://mfa.gov.lk/en/embassy-of-sri-lanka-in-moscow-celebrates-international-womens-day/",
      "The Embassy of Sri Lanka in Moscow celebrated International Women’s Day on March 9, 2020, with an event attended by over 50 participants, including Sri Lankan students.",
      "Mission News"
    ],
    [
      "Conferring the “Aggamahapanditha”  religious title to the Most Venerable Prof. Kotapitiye Rahula Annunayake Thero by the Government of Myanmar",
      "12.03.2020",
      "https://mfa.gov.lk/en/conferring-the-aggamahapanditha-religious-title-to-the-most-venerable-prof-kotapitiye-rahula-annunayake-thero-by-the-government-of-myanmar/",
      "The Government of Myanmar conferred the \"Aggamahapanditha\" religious title upon Most Venerable Prof. Kotapitiye Rahula Anunayake Thero of Sri Lanka on March 9, 2020. The ceremony took place at the State Pariyatti S.",
      "Mission News"
    ],
    [
      "Sri Lanka’s new High Commissioner pledges to enhance ties with the Bahamas",
      "12.03.2020",
      "https://mfa.gov.lk/en/sri-lankas-new-high-commissioner-pledges-to-enhance-ties-with-the-bahamas/",
      "Sri Lanka's non-resident High Commissioner to the Bahamas, Kshenuka Senewiratne, presented credentials to the Governor General of the Commonwealth of the Bahamas, Cornelius A. Smith, ON, on March 4. Senewiratne pledged to enhance ties between Sri Lanka and the Bahamas in her new role.",
      "Mission News"
    ],
    [
      "High Commissioner of Sri Lanka to the United Kingdom Saroja Sirisena presents Letters of Credence to Queen Elizabeth II",
      "12.03.2020",
      "https://mfa.gov.lk/en/high-commissioner-of-sri-lanka-to-the-united-kingdom-saroja-sirisena-presents-letters-of-credence-to-queen-elizabeth-ii/",
      "On March 10, 2020, Sri Lanka's High Commissioner to the United Kingdom, Saroja Sirisena, presented her Letters of Credence to Queen Elizabeth II at Buckingham Palace. The ceremonial event marked the official accreditation of High Commissioner Sirisena to the Queen.",
      "Mission News"
    ],
    [
      "Sri Lanka Embassy in Tokyo introduces Information Tracking System for Consular services",
      "12.03.2020",
      "https://mfa.gov.lk/en/sri-lanka-embassy-in-tokyo-introduces-information-tracking-system-for-consular-services/",
      "The Sri Lanka Embassy in Tokyo introduced an Information Tracking System for consular service recipients in March. The main objective of this initiative is to provide a user-friendly system for tracking information efficiently and effectively. This system aims to enhance the overall experience of individuals seeking consular services at the embassy.",
      "Mission News"
    ],
    [
      "Sri Lanka Single Country Exhibition in Jordan garners attention",
      "05.03.2020",
      "https://mfa.gov.lk/en/sri-lanka-single-country-exhibition-in-jordan-garners-attention/",
      "The Embassy of Sri Lanka, in collaboration with the Sri Lanka Export Development Board, arranged a Familiarization tour of the Jordan market for a 13-member delegation of Sri Lankan entrepreneurs from February 25 to 27. The exhibition garnered significant attention in Jordan.",
      "Mission News"
    ],
    [
      "72nd Anniversary of Sri Lanka’s Independence celebrated in Oman",
      "04.03.2020",
      "https://mfa.gov.lk/en/72nd-anniversary-of-sri-lankas-independence-celebrated-in-oman/",
      "Ambassador of Sri Lanka to Oman, Lebbe Ameer Ajwad, hosted a diplomatic reception at the Grand Hyatt Hotel in Muscat to celebrate Sri Lanka's 72nd Independence Anniversary. The event marked the occasion with dignitaries and guests in attendance.",
      "Mission News"
    ],
    [
      "High Commissioner-designate of Sri Lanka to the United Kingdom Saroja Sirisena assumes duties",
      "04.03.2020",
      "https://mfa.gov.lk/en/high-commissioner-designate-of-sri-lanka-to-the-united-kingdom-saroja-sirisena-assumes-duties/",
      "Saroja Sirisena, the High Commissioner-designate of Sri Lanka to the United Kingdom, began her duties on March 2, 2020. She was welcomed at London Heathrow Airport by the Special Representative of the U.K. government.",
      "Mission News"
    ],
    [
      "Embassy of Sri Lanka in Bahrain Organizes “Taste of Sri Lanka” Sri Lankan Produce and Food Mart",
      "03.03.2020",
      "https://mfa.gov.lk/en/embassy-of-sri-lanka-in-bahrain-organizes-taste-of-sri-lanka-sri-lankan-produce-and-food-mart/",
      "The Embassy of Sri Lanka in Bahrain recently organized the \"Taste of Sri Lanka\" event, showcasing Sri Lankan produce and food. This multifaceted promotional event covered trade, tourism, and culture, highlighting the rich offerings of Sri Lanka in collaboration with local partners.",
      "Mission News"
    ],
    [
      "Business Networking Event and Market Familiarization Programme for the Sri Lankan Exporters in Egypt",
      "03.03.2020",
      "https://mfa.gov.lk/en/business-networking-event-and-market-familiarization-programme-for-the-sri-lankan-exporters-in-egypt/",
      "The Embassy of Sri Lanka in Egypt organized a business networking event from February 23 to 25, 2020. The event included an 11-member delegation of Sri Lankan exporters, facilitated by the Sri Lanka Export Development. Sri Lankan exporters participated in the event to enhance market familiarization and networking opportunities in Egypt.",
      "Mission News"
    ],
    [
      "Sri Lanka appoints a new Honorary Consul of Sri Lanka to Bursa",
      "28.02.2020",
      "https://mfa.gov.lk/en/sri-lanka-appoints-a-new-honorary-consul-of-sri-lanka-to-bursa/",
      "Sri Lanka appointed Ahmed Yildiz as the new Honorary Consul to Bursa, Marmara region, with Ambassador Rizvi Hassen presenting the Commission of Appointment on February 24, 2020. The Mission has now established a new Honorary Consulate in the area.",
      "Mission News"
    ],
    [
      "Sri Lanka Promoted as an Exotic Travel Destination in Sweden",
      "28.02.2020",
      "https://mfa.gov.lk/en/sri-lanka-promoted-as-an-exotic-travel-destination-in-sweden/",
      "The Embassy of Sri Lanka in Sweden, in collaboration with Lotus Travel, hosted an informative session on Sri Lanka tourism on February 19 at the Embassy. This event marks the beginning of a series of customer events aimed at promoting Sri Lanka as an exotic travel destination in Sweden.",
      "Mission News"
    ],
    [
      "Sri Lanka featured in 53rd Diplomatic Red Cross Bazaar",
      "28.02.2020",
      "https://mfa.gov.lk/en/sri-lanka-featured-in-53rd-diplomatic-red-cross-bazaar/",
      "The Embassy of Sri Lanka participated in the 53rd Diplomatic Red Cross Bazaar at the Royal Paragon Hall in Bangkok on February 22-23, 2020. The event showcased Sri Lankan culture and products to visitors at the Siam Paragon Mall.",
      "Mission News"
    ],
    [
      "Sri Lanka signs a bilateral agreement with Israel to streamline the recruitment of Sri Lankan Caregivers to Israel",
      "28.02.2020",
      "https://mfa.gov.lk/en/sri-lanka-signs-a-bilateral-agreement-with-israel-to-streamline-the-recruitment-of-sri-lankan-caregivers-to-israel/",
      "Sri Lanka and Israel have signed a bilateral agreement to facilitate the recruitment of Sri Lankan caregivers to work in specific labor market sectors in Israel. This agreement marks a significant milestone in the bilateral relations between the two countries, aiming to streamline the temporary employment process for Sri Lankan workers in Israel.",
      "Mission News"
    ],
    [
      "Trade, Investment and Tourism Promotion in Black Sea Region",
      "28.02.2020",
      "https://mfa.gov.lk/en/trade-investment-and-tourism-promotion-in-black-sea-region/",
      "The Embassy of Sri Lanka organized a trade, investment, and tourism promotional event in Trabzon, Black Sea region on February 18, 2022, as part of the 72nd Anniversary of Sri Lanka's Independence celebration.",
      "Mission News"
    ],
    [
      "Sri Lanka High Commission promotes Tourism in Canberra",
      "28.02.2020",
      "https://mfa.gov.lk/en/sri-lanka-high-commission-promotes-tourism-in-canberra/",
      "The Sri Lanka High Commission in Canberra organized a successful tourism promotion event at the Annual National Multicultural Festival on February 22, 2020. The festival is an annual event that showcases diverse cultures and traditions.",
      "Mission News"
    ],
    [
      "Sri Lanka as a Resplendent Destination at Danish Travel Show 2020",
      "28.02.2020",
      "https://mfa.gov.lk/en/sri-lanka-as-a-resplendent-destination-at-danish-travel-show-2020/",
      "Sri Lanka Tourism Promotion Bureau and the Embassy of Sri Lanka in Sweden collaborated to showcase Sri Lankan Destination Management Companies (DMCs) at the Danish Travel Show in Herning. The event aimed to promote Sri Lanka as a premier travel destination, highlighting its diverse offerings to Danish travelers.",
      "Mission News"
    ],
    [
      "THE 72ND ANNIVERSARY OF SRI LANKA’S INDEPENDENCE CELEBRATED IN FRANKFURT GERMANY",
      "28.02.2020",
      "https://mfa.gov.lk/en/the-72nd-anniversary-of-sri-lankas-independence-celebrated-in-frankfurt-germany/",
      "The 72nd Anniversary of Sri Lanka’s Independence was celebrated at the Consulate General of Sri Lanka in Frankfurt, Germany on February 4, 2020. The event was attended by the Sri Lankan expatriate community residing in the region, marking the occasion with pride and unity.",
      "Mission News"
    ],
    [
      "Sri Lanka High Commission in Canada hosts Reception to celebrate Sri Lanka’s National Day",
      "28.02.2020",
      "https://mfa.gov.lk/en/sri-lanka-high-commission-in-canada-hosts-reception-to-celebrate-sri-lankas-national-day/",
      "The Sri Lanka High Commission in Canada hosted a reception on February 24, 2020, to celebrate Sri Lanka's National Day. The event was attended by Members of Parliament, the Diplomatic Community, and senior officials of the Government of Canada. It was a gathering to honor and commemorate Sri Lanka's national heritage and achievements.",
      "Mission News"
    ],
    [
      "Ambassador Perera says articulating a position on the appointment of  Lt. Gen. Shavendra Silva based on allegations, is regrettable and contrary to the principles of natural justice",
      "26.02.2020",
      "https://mfa.gov.lk/en/ambassador-perera-says-articulating-a-position-on-the-appointment-of-lt-gen-shavendra-silva-based-on-allegations-is-regrettable-and-contrary-to-the-principles-of-natural-justice/",
      "Ambassador of Sri Lanka to the United States of America, Rodney Perera, stated on February 18, 2020, that expressing a stance on Lt. Gen. Shavendra Silva's appointment based on allegations goes against the principles of natural justice and is regrettable. Perera emphasized that the decision regarding the Army Commander is a sovereign matter.",
      "Mission News"
    ],
    [
      "Highlights of Miss Sri Lanka – Russia 2020",
      "26.02.2020",
      "https://mfa.gov.lk/en/highlights-of-miss-sri-lanka-russia-2020/",
      "The Sri Lankan Students Union at RUDN University organized the Miss Sri Lanka – Russia 2020 \"Sri Lankan Beauty\" Contest on February 15, 2020. The event took place during Sri Lanka week at the Peoples' Friendship University.",
      "Mission News"
    ],
    [
      "Cultural Event to mark the 72nd Independence Day of Sri Lanka in Toronto",
      "26.02.2020",
      "https://mfa.gov.lk/en/cultural-event-to-mark-the-72nd-independence-day-of-sri-lanka-in-toronto/",
      "The Consulate General of Sri Lanka in Toronto organized a cultural event at the Ontario Science Centre on February 15, 2020, to celebrate the 72nd Independence Day of Sri Lanka. The event included the participation of religious leaders.",
      "Mission News"
    ],
    [
      "Embassy of Sri Lanka in Berlin celebrates the 72nd Anniversary  of the  Independence of Sri Lanka",
      "26.02.2020",
      "https://mfa.gov.lk/en/embassy-of-sri-lanka-in-berlin-celebrates-the-72nd-anniversary-of-the-independence-of-sri-lanka/",
      "The Embassy of Sri Lanka in Berlin marked the 72nd Anniversary of Sri Lanka's Independence with a flag hoisting ceremony on 04 February. Additionally, an event was organized by the Embassy on 07 February to commemorate the occasion.",
      "Mission News"
    ],
    [
      "Sri Lanka represents BIT International Travel Exhibition in Milan, Italy",
      "26.02.2020",
      "https://mfa.gov.lk/en/sri-lanka-represents-bit-international-travel-exhibition-in-milan-italy/",
      "Sri Lanka represented at the BIT International Travel Exhibition in Milan, Italy from 09 to 11 February 2020. The Sri Lanka Country Pavilion, sponsored by the Sri Lanka Tourism Promotion Bureau, showcased the country's attractions. The exhibition was held at Fieramilanocity in Milan.",
      "Mission News"
    ],
    [
      "Sri Lanka’s National Chamber of Commerce and Kuwait Chamber of Commerce sign a Memorandum of Understanding",
      "26.02.2020",
      "https://mfa.gov.lk/en/sri-lankas-national-chamber-of-commerce-and-kuwait-chamber-of-commerce-sign-a-memorandum-of-understanding/",
      "Sri Lanka's National Chamber of Commerce (NCCSL) and Kuwait Chamber of Commerce and Industry (KCCI) recently signed a Memorandum of Understanding (MOU) to promote trade, technical cooperation, and economic relations between the two countries. The MOU aims to strengthen ties and facilitate business opportunities for both chambers.",
      "Mission News"
    ],
    [
      "Ambassador of Sri Lanka to Viet Nam calls on Senior Lieutenant-General, Professor To Lam, Minister of Public Security of the Viet Nam",
      "26.02.2020",
      "https://mfa.gov.lk/en/ambassador-of-sri-lanka-to-viet-nam-calls-on-senior-lieutenant-general-professor-to-lam-minister-of-public-security-of-the-viet-nam/",
      "On February 19, 2020, Ambassador Prasanna Gamage of Sri Lanka met with Senior Lieutenant General To Lam, the Minister of Public Security of Viet Nam, at the Ministry. The meeting aimed to strengthen diplomatic ties between the two countries.",
      "Mission News"
    ],
    [
      "Embassy organises Sri Lanka Tourism Media Conference in Tokyo",
      "24.02.2020",
      "https://mfa.gov.lk/en/embassy-organises-sri-lanka-tourism-media-conference-in-tokyo/",
      "The Embassy of Sri Lanka in Tokyo, with the support of the Sri Lanka Tourism Promotion Bureau, organized a Media Conference on February 12. The event aimed to invite Japanese media experts to write about and visit Sri Lanka, with around 70 attendees participating.",
      "Mission News"
    ],
    [
      "72nd Anniversary of Sri Lanka’s Independence Celebrated in Washington D.C.",
      "21.02.2020",
      "https://mfa.gov.lk/en/72nd-anniversary-of-sri-lankas-independence-celebrated-in-washington-d-c/",
      "The Embassy of Sri Lanka in Washington D.C. organized a special event at the University of the District of Columbia to celebrate the 72nd Anniversary of Sri Lanka’s Independence on February 8, 2020. The event was attended by dignitaries and members of the Sri Lankan community.",
      "Mission News"
    ],
    [
      "Sri Lanka Embassy in Israel Celebrates 72nd Independence Anniversary of Sri Lanka",
      "20.02.2020",
      "https://mfa.gov.lk/en/sri-lanka-embassy-in-israel-celebrates-72nd-independence-anniversary-of-sri-lanka/",
      "The Sri Lanka Embassy in Tel Aviv, Israel marked Sri Lanka's 72nd Independence Anniversary on February 4, 2020, with the Sri Lankan community in Israel and Israeli well-wishers at the Embassy premises. The event celebrated the milestone with a gathering of attendees from both communities.",
      "Mission News"
    ],
    [
      "Sri Lanka Participates at 26th International Mediterranean Tourism Market (IMTM) 2020 in Israel",
      "20.02.2020",
      "https://mfa.gov.lk/en/sri-lanka-participates-at-26th-international-mediterranean-tourism-market-imtm-2020-in-israel/",
      "Sri Lanka participated in the 26th International Mediterranean Tourism Market (IMTM) 2020 in Israel, organized by the Embassy of Sri Lanka in coordination with the Sri Lanka Tourism Promotion Bureau (SLTPB). The event aimed to promote Sri Lanka as a tourist destination and strengthen ties with the international tourism market.",
      "Mission News"
    ],
    [
      "MEETING WITH GOVERNOR OF NEW SOUTH WALES   HONOURABLE MARGARET BEAZLEY AO QC",
      "20.02.2020",
      "https://mfa.gov.lk/en/meeting-with-governor-of-new-south-wales-honourable-margaret-beazley-ao-qc/",
      "The Sri Lankan Consulate General Office in Sydney requested a meeting with the Governor of New South Wales, Hon. Margaret Beazley AO QC. In response, Consul General M.H.M.N. Bandara and Consul (Commercial) M.M. Abdul Raheem have been invited to visit the Governor's office.",
      "Mission News"
    ],
    [
      "Actg. High Commissioner in Pretoria Speaks on Business Opportunities in Sri Lanka in Free State, South Africa",
      "20.02.2020",
      "https://mfa.gov.lk/en/actg-high-commissioner-in-pretoria-speaks-on-business-opportunities-in-sri-lanka-in-free-state-south-africa/",
      "Acting High Commissioner in Pretoria, Priyangani Hewarathna, discussed business opportunities in Sri Lanka at the International Trade Workshop in Bloemfontein, Free State, South Africa on February 18, 2020. The workshop aimed to promote bilateral trade relations between the two countries.",
      "Mission News"
    ],
    [
      "“So Sri Lanka: The Next Travel Destination for Filipinos” at the PTAA Travel Tour Expo 2020",
      "20.02.2020",
      "https://mfa.gov.lk/en/so-sri-lanka-the-next-travel-destination-for-filipinos-at-the-ptaa-travel-tour-expo-2020/",
      "The Embassy of Sri Lanka in Manila and the Sri Lanka Tourism Promotion Bureau showcased Sri Lanka as the next travel destination for Filipinos at the PTAA Travel Tour Expo 2020 held at SMX Convention Center from February 7-9, 2020.",
      "Mission News"
    ],
    [
      "Independence Day celebrations at the Embassy of Sri Lanka in Jordan and at the Mabarrat Um Al Hussein Orphanage in Jordan",
      "18.02.2020",
      "https://mfa.gov.lk/en/independence-day-celebrations-at-the-embassy-of-sri-lanka-in-jordan-and-at-the-mabarrat-um-al-hussein-orphanage-in-jordan/",
      "The Embassy of Sri Lanka in Jordan celebrated Sri Lanka's 72nd Independence Day at the Chancery premises on February 4. The event was attended by a large gathering of Sri Lankans from the community and well-wishers, as well as at the Mabarrat Um Al Hussein Orphanage in Jordan.",
      "Mission News"
    ],
    [
      "SRI LANKA AT BIOFACH 2020 IN NUREMBERG, GERMANY",
      "18.02.2020",
      "https://mfa.gov.lk/en/sri-lanka-at-biofach-2020-in-nuremberg-germany/",
      "The Consulate General of Sri Lanka in Frankfurt supported the Export Development Board in setting up the Sri Lanka Pavilion at BIOFACH 2020 in Nuremberg, Germany. BIOFACH is known as the world's leading trade fair for organic food and natural beauty products.",
      "Mission News"
    ],
    [
      "Ambassador calls on Speaker of Parliament Mustafa Sentop",
      "18.02.2020",
      "https://mfa.gov.lk/en/ambassador-calls-on-speaker-of-parliament-mustafa-sentop/",
      "Ambassador Mohamed Rizvi Hassen visited Speaker of the Turkish Parliament, Mustafa Sentop, in Ankara on February 3, 2020. During the meeting, the Ambassador conveyed greetings from the President of Sri Lanka, Gotabaya Rajapaksa.",
      "Mission News"
    ],
    [
      "LARGEST COMMERCIAL BANK OF SOUTH KOREA IS KEEN TO ENGAGE WITH SRI LANKA",
      "18.02.2020",
      "https://mfa.gov.lk/en/largest-commercial-bank-of-south-korea-is-keen-to-engage-with-sri-lanka/",
      "The Co-CEO and Senior Managing Director of KB Financial Group of Kookmin Bank discussed priority sectors for investments, including in Sri Lanka, with the Ambassador of Sri Lanka at the Corporate Head Office. The largest commercial bank in South Korea is eager to engage with Sri Lanka for potential investment opportunities.",
      "Mission News"
    ],
    [
      "High Commission of Sri Lanka in New Delhi organizes art exhibition to commemorate Independence",
      "18.02.2020",
      "https://mfa.gov.lk/en/high-commission-of-sri-lanka-in-new-delhi-organizes-art-exhibition-to-commemorate-independence/",
      "The High Commission of Sri Lanka in New Delhi organized an art exhibition to commemorate the 72nd anniversary of Sri Lanka's Independence. The two-day exhibition, titled \"Cultural Tapestry of Sri Lanka,\" showcased various paintings.",
      "Mission News"
    ],
    [
      "Sri Lanka Food Festival – Islamabad and Rawalpindi",
      "18.02.2020",
      "https://mfa.gov.lk/en/sri-lanka-food-festival-islamabad-and-rawalpindi/",
      "The Marriot Hotel in Islamabad and the Pearl Continental Hotel in Rawalpindi, with the support of the Sri Lanka High Commission, organized a Sri Lanka food festival on February 5 and 6, 2020. The event showcased Sri Lankan cuisine in Islamabad and Rawalpindi.",
      "Mission News"
    ],
    [
      "Sri Lanka Participates at Tourest Travel Fair in Estonia",
      "18.02.2020",
      "https://mfa.gov.lk/en/sri-lanka-participates-at-tourest-travel-fair-in-estonia/",
      "Sri Lanka Tourism Promotion Bureau, in collaboration with the Embassy of Sri Lanka in Sweden, facilitated the participation of Sri Lankan Destination Management Companies (DMCs) at Tourest 2020 in Tallinn, Estonia. The event aimed to promote Sri Lanka as a travel destination and strengthen ties with the Estonian tourism market.",
      "Mission News"
    ],
    [
      "Sri Lankan Cultural Week Commences at the People’s Friendship University of Russia",
      "18.02.2020",
      "https://mfa.gov.lk/en/sri-lankan-cultural-week-commences-at-the-peoples-friendship-university-of-russia/",
      "Sri Lankan students at the People’s Friendship University of Russia are organizing the Sri Lankan Cultural Week from February 10-15, 2020, to showcase the country's rich historical and cultural heritage. The event aims to promote cultural exchange and understanding between Sri Lanka and Russia.",
      "Mission News"
    ],
    [
      "Ambassador pays courtesy call on newly appointed  Minister of State  for  Foreign Affairs of Ethiopia",
      "18.02.2020",
      "https://mfa.gov.lk/en/ambassador-pays-courtesy-call-on-newly-appointed-minister-of-state-for-foreign-affairs-of-ethiopia/",
      "Ambassador Sugeeshwara Gunaratna visited the newly appointed Minister of State for Foreign Affairs, Redwan Hussien, on February 12 at the Ministry of Foreign Affairs in Ethiopia to extend congratulations.",
      "Mission News"
    ],
    [
      "“So Sri Lanka: The Resplendent Island” Tourism Promotion and High-Level Networking Session",
      "18.02.2020",
      "https://mfa.gov.lk/en/so-sri-lanka-the-resplendent-island-tourism-promotion-and-high-level-networking-session/",
      "The Embassy of Sri Lanka in Manila, in collaboration with the Sri Lanka Tourism Promotion Bureau (SLTPB), hosted a tourism promotion and high-level networking session titled \"So Sri Lanka: The Resplendent Island.\" The event aimed to showcase Sri Lanka's beauty and attract visitors.",
      "Mission News"
    ],
    [
      "Sri Lanka Food Festival in Turkey",
      "18.02.2020",
      "https://mfa.gov.lk/en/sri-lanka-food-festival-in-turkey/",
      "The Sri Lanka Food Festival 2020 in Turkey concluded on a high note in Ankara. The event was organized by the Embassy of Sri Lanka in Ankara in collaboration with the Hilton Hotel Colombo to celebrate the 72nd Anniversary of Sri Lanka's Independence.",
      "Mission News"
    ],
    [
      "Celebration of the 72nd Anniversary of Independence of Sri Lanka in Stockholm",
      "18.02.2020",
      "https://mfa.gov.lk/en/celebration-of-the-72nd-anniversary-of-independence-of-sri-lanka-in-stockholm/",
      "The Embassy of Sri Lanka in Stockholm celebrated the 72nd Anniversary of Sri Lanka's Independence by organizing two events. The celebrations were held in collaboration with the Sri Lankan community in Stockholm, marking the significant milestone.",
      "Mission News"
    ],
    [
      "Sri Lanka- Turkey successfully concluded negotiations on the Elimination of Double Taxation with respect to taxes on income and the prevention of tax evasion and avoidance",
      "18.02.2020",
      "https://mfa.gov.lk/en/sri-lanka-turkey-successfully-concluded-negotiations-on-the-elimination-of-double-taxation-with-respect-to-taxes-on-income-and-the-prevention-of-tax-evasion-and-avoidance/",
      "Sri Lanka and Turkey successfully concluded negotiations on the elimination of double taxation regarding income taxes and the prevention of tax evasion and avoidance in Ankara from January 21 to 24, 2020. This agreement aims to enhance cooperation between the two countries in tax matters and promote economic relations.",
      "Mission News"
    ],
    [
      "Thailand Stands Ready to support Sri Lanka’s Development says Thai PM",
      "17.02.2020",
      "https://mfa.gov.lk/en/thailand-stands-ready-to-support-sri-lankas-development-says-thai-pm/",
      "Thai Prime Minister General Prayut Chan-o-cha reaffirmed Thailand's commitment to supporting Sri Lanka's development initiatives, highlighting the strong bilateral relationship between the two countries. His remarks underscored Thailand's readiness to assist Sri Lanka in its development endeavors.",
      "Mission News"
    ],
    [
      "72nd Anniversary of Sri Lanka’s independence celebrated in Geneva",
      "17.02.2020",
      "https://mfa.gov.lk/en/72nd-anniversary-of-sri-lankas-independence-celebrated-in-geneva/",
      "The Permanent Mission of Sri Lanka to the United Nations and the World Trade Organisation in Geneva celebrated the 72nd anniversary of Sri Lanka’s independence. The event was held at a special ceremony in Geneva.",
      "Mission News"
    ],
    [
      "Pirith chanting and Alms giving ceremony in Ankara to celebrate  72nd Independence of Sri Lanka",
      "15.02.2020",
      "https://mfa.gov.lk/en/pirith-chanting-and-alms-giving-ceremony-in-ankara-to-celebrate-72nd-independence-of-sri-lanka/",
      "The Embassy of Sri Lanka in Turkey organized an alms-giving and Pirith Chanting ceremony in Ankara to celebrate the 72nd Independence Day of Sri Lanka. This event marked the first time such a ceremony was held by the Embassy since its establishment in Turkey.",
      "Mission News"
    ],
    [
      "“Timelines evolved externally would hinder process of reconciliation”:  Sri Lanka’s envoy tell the UN Security Council",
      "14.02.2020",
      "https://mfa.gov.lk/en/un-security-council-eng/",
      "Sri Lanka's envoy informed the UN Security Council that externally imposed timelines for achieving objectives could impede the reconciliation process by ignoring ground realities.",
      "Mission News"
    ],
    [
      "72th National Day Celebrations of Sri Lanka in Malaysia",
      "13.02.2020",
      "https://mfa.gov.lk/en/72th-national-day-celebrations-of-sri-lanka-in-malaysia/",
      "The Sri Lanka High Commission in Malaysia marked the 72nd National Day of Sri Lanka on February 4, 2020, with the Sri Lankan community in Malaysia. The event included celebrations at the High Commission, bringing together Sri Lankans living in Malaysia to commemorate the occasion.",
      "Mission News"
    ],
    [
      "Sri Lanka flag flies high at the “Bahrain for All” Festival",
      "13.02.2020",
      "https://mfa.gov.lk/en/sri-lanka-flag-flies-high-at-the-bahrain-for-all-festival/",
      "The Embassy of Sri Lanka in Bahrain coordinated Sri Lanka's participation at the \"Bahrain for All\" festival in Bahrain Bay on February 6-7, 2020. The event was held under the theme \"Leaving No One Behind,\" showcasing Sri Lankan culture and heritage.",
      "Mission News"
    ],
    [
      "Sri Lankans Celebrated 72nd Independence Day in Pretoria, South Africa",
      "13.02.2020",
      "https://mfa.gov.lk/en/sri-lankans-celebrated-72nd-independence-day-in-pretoria-south-africa/",
      "Sri Lankans in Pretoria, South Africa celebrated their country's 72nd Independence Day with two events organized by the High Commission of Sri Lanka on February 4th and 8th, 2020. The celebrations included a Flag hoisting Ceremony at the High Commission Premises.",
      "Mission News"
    ],
    [
      "High Commission of Sri Lanka in Singapore celebrates the 72nd Independence Day and the 50 anniversary of the establishment of diplomatic relation with Singapore",
      "13.02.2020",
      "https://mfa.gov.lk/en/high-commission-of-sri-lanka-in-singapore-celebrates-the-72nd-independence-day-and-the-50-anniversary-of-the-establishment-of-diplomatic-relation-with-singapore/",
      "The High Commission of Sri Lanka in Singapore celebrated the 72nd Independence Day and the 50th anniversary of diplomatic relations with Singapore through a series of events. The celebrations marked significant milestones in the relationship between the two countries.",
      "Mission News"
    ],
    [
      "72nd Independence Day of Sri Lanka celebrated at the  High Commission of Sri Lanka in Dhaka, Bangladesh",
      "13.02.2020",
      "https://mfa.gov.lk/en/72nd-independence-day-of-sri-lanka-celebrated-at-the-high-commission-of-sri-lanka-in-dhaka-bangladesh/",
      "The 72nd Independence Day of Sri Lanka was celebrated at the High Commission of Sri Lanka in Dhaka, Bangladesh on February 4, 2020. The event was inaugurated by the Charge d’Affaires, marking the occasion with dignitaries and guests in attendance.",
      "Mission News"
    ],
    [
      "Sri Lanka Embassy in Ankara celebrates the 72nd Independence of Sri Lanka",
      "13.02.2020",
      "https://mfa.gov.lk/en/sri-lanka-embassy-in-ankara-celebrates-the-72nd-independence-of-sri-lanka/",
      "The Sri Lanka Embassy in Ankara marked the 72nd Independence Day with religious dignitaries, the Sri Lankan community in Turkey and Georgia, and the Honorary Consul of Sri Lanka in Turkey. The event celebrated the anniversary with the participation of various groups, emphasizing the significance of Sri Lanka's independence.",
      "Mission News"
    ],
    [
      "Sri Lanka donates tea for the Australian bushfire victims",
      "13.02.2020",
      "https://mfa.gov.lk/en/sri-lanka-donates-tea-for-the-australian-bushfire-victims/",
      "Sri Lanka donated four tons of \"Ceylon Tea\" to Australia today as a goodwill gesture for the victims of the recent bushfires. President Gotabaya Rajapaksa made the donation to support those affected by the devastating fires in Australia.",
      "Mission News"
    ],
    [
      "Sri Lanka Embassy in Manila celebrates 72nd Independence Day",
      "13.02.2020",
      "https://mfa.gov.lk/en/sri-lanka-embassy-in-manila-celebrates-72nd-independence-day/",
      "The Sri Lanka Embassy in Manila celebrated the country's 72nd Independence Day at the Makati Shangri-La Hotel on February 5, 2020. The event was graced by the Foreign Affairs Secretary of the Philippines, Teodoro L. Locsin, Jr.",
      "Mission News"
    ],
    [
      "SRI LANKA AT THE WORLD´S LEADING TRADE FAIR FOR CONSUMER GOODS IN FRANKFURT",
      "13.02.2020",
      "https://mfa.gov.lk/en/sri-lanka-at-the-worlds-leading-trade-fair-for-consumer-goods-in-frankfurt/",
      "Sri Lanka was represented by five companies, including Dankotuwa Porcelain, at Ambiente 2020, the world's leading trade fair for consumer goods in Frankfurt, Germany from 07 to 11 February 2020. The event featured over 4,815 exhibitors from 95 countries.",
      "Mission News"
    ],
    [
      "Ambassador-Designate Jayasuriya presented Credentials in Lao PDR",
      "13.02.2020",
      "https://mfa.gov.lk/en/ambassador-designate-jayasuriya-presented-credentials-in-lao-pdr/",
      "Ambassador of Sri Lanka to Lao PDR, Samantha K. Jayasuriya, presented her credentials to President Bounnhang Vorachith. She is accredited with residence in Bangkok.",
      "Mission News"
    ],
    [
      "Sri Lanka represented at Brussels Holiday Fair – 2020 in Belgium",
      "13.02.2020",
      "https://mfa.gov.lk/en/sri-lanka-represented-at-brussels-holiday-fair-2020-in-belgium/",
      "The Embassy of Sri Lanka in Brussels represented Sri Lanka at the 62nd edition of ‘Vakantie Salon Vacances 2020’ (Holiday Fair at Brussels Expo) in Belgium from February 6 to 9, 2020. The participation was sponsored by the Sri Lanka Tour. Sri Lanka showcased its tourism offerings at the event.",
      "Mission News"
    ],
    [
      "Sri Lanka Embassy in Thailand Joins the National Tree Planting Programme to Mark 72nd Independence Day",
      "13.02.2020",
      "https://mfa.gov.lk/en/sri-lanka-embassy-in-thailand-joins-the-national-tree-planting-programme-to-mark-72nd-independence-day/",
      "The Sri Lanka Embassy in Bangkok participated in the National Tree Planting Programme to celebrate the 72nd Independence Day under the theme 'A Secured Nation – A Prosperous Country'. The event aimed to promote environmental conservation and national pride.",
      "Mission News"
    ],
    [
      "Sri Lankan tea companies participate in the PRODEXPO Exhibition 2020 to promote Ceylon Tea in Russia",
      "13.02.2020",
      "https://mfa.gov.lk/en/sri-lankan-tea-companies-participate-in-the-prodexpo-exhibition-2020-to-promote-ceylon-tea-in-russia/",
      "Sri Lankan tea companies are participating in the PRODEXPO Exhibition 2020 in Moscow to promote Ceylon Tea in Russia. The exhibition started on February 10, 2020, and will run until February 14, 2020 at the Expocentre Fairground.",
      "Mission News"
    ],
    [
      "72nd Anniversary of National Independence Day of Sri Lanka Celebrated in Nepal",
      "12.02.2020",
      "https://mfa.gov.lk/en/72nd-anniversary-of-national-independence-day-of-sri-lanka-celebrated-in-nepal/",
      "The 72nd Anniversary of Sri Lanka's National Independence was celebrated in Nepal on 04 February 2020 at the Embassy premises. The event began with Ambassador Himale hoisting the national flag, marking the commencement of the program.",
      "Mission News"
    ],
    [
      "Sri Lanka Embassy in Brussels celebrates National Day",
      "12.02.2020",
      "https://mfa.gov.lk/en/sri-lanka-embassy-in-brussels-celebrates-national-day/",
      "The Sri Lanka Embassy in Belgium marked the 72nd National Day of Sri Lanka in Brussels with a flag hoisting ceremony on 04 February 2020, attended by the Sri Lankan community in Belgium.",
      "Mission News"
    ],
    [
      "National Independence Day Celebrations – 2020, at the Consulate General of Sri Lanka, Milan",
      "12.02.2020",
      "https://mfa.gov.lk/en/national-independence-day-celebrations-2020-at-the-consulate-general-of-sri-lanka-milan/",
      "The Consulate General of Sri Lanka in Milan celebrated the 72nd National Independence Day on February 4, 2020, by hoisting the National Flag at its premises. The event marked the occasion with patriotic songs and cultural performances, showcasing the spirit of Sri Lankan independence.",
      "Mission News"
    ],
    [
      "Celebration of the 72nd Independence Day in Cairo",
      "12.02.2020",
      "https://mfa.gov.lk/en/celebration-of-the-72nd-independence-day-in-cairo-egypt-on-04-and-06-february-2020/",
      "The Sri Lanka Embassy in Cairo, Egypt celebrated Sri Lanka's 72nd Independence Day on February 4, 2020, at the Embassy premises with Sri Lankans living in Egypt. The event marked the country's 72nd Anniversary of Independence.",
      "Mission News"
    ],
    [
      "Unity is the Strength: Sri Lankan Community in Cyprus Celebrate the 72nd National Day",
      "12.02.2020",
      "https://mfa.gov.lk/en/unity-is-the-strength-sri-lankan-community-in-cyprus-celebrate-the-72nd-national-day/",
      "The Sri Lankan Community in Cyprus united to celebrate the 72nd National Day in Nicosia on February 2, 2020, setting aside racial and religious differences. The event showcased unity and harmony among the community members.",
      "Mission News"
    ],
    [
      "72nd Independence Ceremony – Embassy of Sri Lanka, Warsaw",
      "12.02.2020",
      "https://mfa.gov.lk/en/72nd-independence-ceremony-embassy-of-sri-lanka-warsaw/",
      "The Embassy of Sri Lanka in Warsaw marked the 72nd Independence anniversary on February 8, 2020, with the Sri Lankan community, embassy officials, and their families in attendance at the embassy premises. The event celebrated the occasion with participation from various groups, fostering a sense of unity and pride among attendees.",
      "Mission News"
    ],
    [
      "Sri Lanka Consulate General in Sydney celebrates the 72nd Independence Day at the Great Hall of University of Sydney",
      "12.02.2020",
      "https://mfa.gov.lk/en/sri-lanka-consulate-general-in-sydney-celebrates-the-72nd-independence-day-at-the-great-hall-of-university-of-sydney/",
      "The Sri Lanka Consulate General in Sydney celebrated the 72nd Independence Day at the Great Hall of the University of Sydney. The event was attended by over 350 people, including the Governor of the NSW Government, Margaret Beazley AO QC, and her spouse, Dennis Wil. It was a grand gathering to mark the occasion.",
      "Mission News"
    ],
    [
      "Embassy positions Sri Lanka tourism at “2020 Fukuoka Travel Exposition”",
      "12.02.2020",
      "https://mfa.gov.lk/en/embassy-positions-sri-lanka-tourism-at-2020-fukuoka-travel-exposition/",
      "The Embassy of Sri Lanka in Tokyo, with the support of the Sri Lanka Tourism Promotion Bureau, showcased Sri Lanka Tourism at the \"2020 Fukuoka Travel Exposition\" in Fukuoka, located approximately 1200 km away from Tokyo. This event aimed to promote Sri Lanka as a travel destination.",
      "Mission News"
    ],
    [
      "Sri Lanka Embassy in Ethiopia celebrates 72nd Anniversary of Independence",
      "12.02.2020",
      "https://mfa.gov.lk/en/sri-lanka-embassy-in-ethiopia-celebrates-72nd-anniversary-of-independence/",
      "The Sri Lanka Embassy in Ethiopia celebrated Sri Lanka's 72nd Independence Day on February 4, 2020, at its premises. The event was attended by the Permanent Secretary of the Ethiopian Ministry of Foreign Affairs.",
      "Mission News"
    ],
    [
      "SRI LANKAN ENVOY ADDRESSES INTERNATIONAL YOUTH FELLOWSHIP OF SOUTH KOREA ON TOURISM OF SRI LANKA",
      "12.02.2020",
      "https://mfa.gov.lk/en/sri-lankan-envoy-addresses-international-youth-fellowship-of-south-korea-on-tourism-of-sri-lanka/",
      "Sri Lankan Ambassador Dr. A. Saj U. Mendis addressed the International Youth Fellowship of South Korea on tourism in Sri Lanka during the Lunar New Year holidays. He delivered a Special Lecture highlighting the attractions of Sri Lanka to the audience.",
      "Mission News"
    ],
    [
      "The Embassy of Sri Lanka in Riyadh celebrates the 72nd anniversary of  Sri Lanka’s Independence",
      "12.02.2020",
      "https://mfa.gov.lk/en/the-embassy-of-sri-lanka-in-riyadh-celebrates-the-72nd-anniversary-of-sri-lankas-independence/",
      "The Sri Lankan community in Riyadh, Saudi Arabia gathered at the Embassy of Sri Lanka to celebrate the country's 72nd Independence Day on February 4, 2020. The event was inaugurated by the Charge d’Affaires of the Embassy.",
      "Mission News"
    ],
    [
      "72nd Anniversary of Independence of Sri Lanka",
      "12.02.2020",
      "https://mfa.gov.lk/en/72nd-anniversary-of-independence-of-sri-lanka/",
      "The Sri Lanka Deputy High Commission in Chennai celebrated the 72nd Anniversary of Independence on 04 February 2020 by hoisting the National Flag.",
      "Mission News"
    ],
    [
      "Flag Hoisting Ceremony to Mark the 72nd Independence Day of Sri Lanka in Toronto",
      "12.02.2020",
      "https://mfa.gov.lk/en/flag-hoisting-ceremony-to-mark-the-72nd-independence-day-of-sri-lanka-in-toronto/",
      "The Consulate General of Sri Lanka in Toronto organized a Flag Hoisting Ceremony at the Legislative Assembly of Ontario on February 4, 2020, to celebrate the 72nd Independence Day of Sri Lanka.",
      "Mission News"
    ],
    [
      "Sri Lanka Embassy in Yangon celebrates the 72nd Anniversary of  Independence Day of Sri Lanka",
      "10.02.2020",
      "https://mfa.gov.lk/en/sri-lanka-embassy-in-yangon-celebrates-the-72nd-anniversary-of-independence-day-of-sri-lanka/",
      "The 72nd Anniversary of Sri Lanka's Independence Day was celebrated at the Sri Lanka Embassy in Yangon on February 4, 2020, under the direction of Charge d’Affaires K.H.C. Sankapali. The event was attended by dignitaries and guests.",
      "Mission News"
    ],
    [
      "Sri Lanka High Commission in Canada celebrates the 72nd Anniversary of Independence and National Day of Sri Lanka in Ottawa",
      "10.02.2020",
      "https://mfa.gov.lk/en/sri-lanka-high-commission-in-canada-celebrates-the-72nd-anniversary-of-independence-and-national-day-of-sri-lanka-in-ottawa/",
      "The Sri Lanka High Commission in Canada celebrated the 72nd Anniversary of Independence and National Day of Sri Lanka on February 4, 2020, in Ottawa. The event took place at the Official Residence of the High Commissioner, with a large gathering in attendance. It was a festive occasion marking the country's independence and national pride.",
      "Mission News"
    ],
    [
      "Consulate General in Jeddah Celebrates the 72nd Independence Day of Sri Lanka",
      "10.02.2020",
      "https://mfa.gov.lk/en/consulate-general-in-jeddah-celebrates-the-72nd-independence-day-of-sri-lanka/",
      "The Consulate General in Jeddah celebrated Sri Lanka's 72nd Independence Day with a flag hoisting ceremony on February 4, 2020. The event began with the National flag being raised by Coun. This marked a significant occasion for Sri Lankan nationals in Jeddah.",
      "Mission News"
    ],
    [
      "High Commission of Sri Lanka to Seychelles celebrates 72nd Independence Day",
      "08.02.2020",
      "https://mfa.gov.lk/en/high-commission-of-sri-lanka-to-seychelles-celebrates-72nd-independence-day/",
      "The High Commission of Sri Lanka to Seychelles marked Sri Lanka's 72nd Independence Day at the Official Residence in Machabe on February 4, 2020. The event was attended by religious leaders and dignitaries.",
      "Mission News"
    ],
    [
      "The Embassy of Sri Lanka in Moscow Celebrates 72nd Anniversary of the Independence Day",
      "08.02.2020",
      "https://mfa.gov.lk/en/the-embassy-of-sri-lanka-in-moscow-celebrates-72nd-anniversary-of-the-independence-day/",
      "The Embassy of Sri Lanka in Moscow celebrated the 72nd Anniversary of Independence Day on February 4, 2020. The Sri Lankan community in Russia gathered at the Embassy's premises, where Charge d' Affaires Mohamed Anas hoisted the National Flag, and the attendees sang the National Anthem.",
      "Mission News"
    ],
    [
      "Embassy of Sri Lanka celebrates the Independence Day and the 60th anniversary of diplomatic relations with Brazil",
      "08.02.2020",
      "https://mfa.gov.lk/en/embassy-of-sri-lanka-celebrates-the-independence-day-and-the-60th-anniversary-of-diplomatic-relations-with-brazil/",
      "The Embassy of Sri Lanka in Brasília celebrated the 72nd anniversary of Sri Lanka's Independence Day on February 4, 2020, along with the 60th anniversary of diplomatic relations with Brazil. The event was attended by the Sri Lankan expatriate community and embassy officials, marking a significant milestone in the bilateral relations between the two countries.",
      "Mission News"
    ],
    [
      "72nd Sri Lanka’s Independence Day celebrated in Washington DC",
      "08.02.2020",
      "https://mfa.gov.lk/en/39777-2/",
      "The Embassy of Sri Lanka in Washington DC celebrated the 72nd Anniversary of Sri Lanka’s Independence with an official ceremony at the Chancery premises on February 4, 2020. The ceremony included various events to mark the occasion.",
      "Mission News"
    ],
    [
      "Consulate General of Sri Lanka to Dubai and Northern Emirates celebrates 72nd Independence Day",
      "07.02.2020",
      "https://mfa.gov.lk/en/consulate-general-of-sri-lanka-to-dubai-and-northern-emirates-celebrates-72nd-independence-day/",
      "The Consulate General of Sri Lanka to Dubai and Northern Emirates celebrated the 72nd Independence Day on February 4, 2020, at their premises. The event was organized with ceremonial activities to mark the occasion.",
      "Mission News"
    ],
    [
      "The Permanent Mission of Sri Lanka to the United Nations celebrates  the 72nd Anniversary of Independence in New York",
      "07.02.2020",
      "https://mfa.gov.lk/en/the-permanent-mission-of-sri-lanka-to-the-united-nations-celebrates-the-72nd-anniversary-of-independence-in-new-york/",
      "The Permanent Mission of Sri Lanka to the United Nations in New York celebrated Sri Lanka's 72nd Anniversary of Independence by hosting an evening reception for numerous foreign diplomats and representatives. The event was held to commemorate the occasion and strengthen diplomatic ties.",
      "Mission News"
    ],
    [
      "High Commission of Sri Lanka in Canberra celebrates the 72nd Anniversary of Independence Day of Sri Lanka",
      "07.02.2020",
      "https://mfa.gov.lk/en/high-commission-of-sri-lanka-in-canberra-celebrates-the-72nd-anniversary-of-independence-day-of-sri-lanka/",
      "The High Commission of Sri Lanka in Canberra celebrated the 72nd Anniversary of Sri Lanka's Independence Day with a formal flag hoisting ceremony. The event was attended by a diverse group representing the Sri Lankan community.",
      "Mission News"
    ],
    [
      "CONSULATE GENERAL OF SRI LANKA CELEBRATES 72ND INDEPENDENCE DAY IN LOS ANGELES",
      "07.02.2020",
      "https://mfa.gov.lk/en/consulate-general-of-sri-lanka-celebrates-72nd-independence-day-in-los-angeles/",
      "The Consulate General of Sri Lanka in Los Angeles celebrated Sri Lanka's 72nd Independence Day on February 4, 2020, at the Consulate General premises. The event was attended by a large gathering of Sri Lankans and friends, marking the significant anniversary.",
      "Mission News"
    ],
    [
      "The Sri Lanka Embassy in Beijing commemorates 72 Anniversary of Independence",
      "07.02.2020",
      "https://mfa.gov.lk/en/the-sri-lanka-embassy-in-beijing-commemorates-72-anniversary-of-independence/",
      "The Sri Lanka Embassy in Beijing celebrated the 72nd Anniversary of Independence on February 4, 2020, with the Embassy staff in attendance. The event marked a significant milestone in Sri Lanka's history.",
      "Mission News"
    ],
    [
      "72nd Independence Day Celebrations in Ha Noi, Viet Nam",
      "07.02.2020",
      "https://mfa.gov.lk/en/72nd-independence-day-celebrations-in-ha-noi-viet-nam/",
      "Ambassador of Sri Lanka to Viet Nam, Prasanna Gamage, and embassy staff, along with the Sri Lankan community in Ha Noi, celebrated the 72nd Independence Day. The event also saw the participation of senior officials from the Government of Sri Lanka.",
      "Mission News"
    ],
    [
      "Sri Lanka’s 72nd Anniversary of Independence celebrated in Bahrain",
      "07.02.2020",
      "https://mfa.gov.lk/en/sri-lankas-72nd-anniversary-of-independence-celebrated-in-bahrain/",
      "The Embassy of Sri Lanka in Bahrain celebrated the country's 72nd Anniversary of Independence on February 4, 2020, with the participation of Sri Lankan residents and friends. The event took place at the Embassy premises.",
      "Mission News"
    ],
    [
      "72nd Independence Day Celebrations in Syria",
      "07.02.2020",
      "https://mfa.gov.lk/en/72nd-independence-day-celebrations-in-syria/",
      "The Embassy of Sri Lanka in Lebanon, along with the Honorary Consulate in Syria, marked the 72nd Independence Day with a well-attended celebration. The event was held under the patronage of Ambassador Shani Calyane.",
      "Mission News"
    ],
    [
      "Sri Lanka High Commission in London Celebrates the 72nd Anniversary of the Independence with the Sri Lankan community",
      "07.02.2020",
      "https://mfa.gov.lk/en/sri-lanka-high-commission-in-london-celebrates-the-72nd-anniversary-of-the-independence-with-the-sri-lankan-community/",
      "The Sri Lanka High Commission in London celebrated the 72nd Anniversary of Sri Lanka's Independence with the Sri Lankan community. Acting High Commissioner Samantha Pathirana hoisted the National Flag of Sri Lanka during the event, marking the occasion.",
      "Mission News"
    ],
    [
      "Sri Lanka Independence Day Celebration in Oslo – 2020",
      "07.02.2020",
      "https://mfa.gov.lk/en/sri-lanka-independence-day-celebration-in-oslo-2020/",
      "The Embassy of Sri Lanka in Oslo celebrated Sri Lanka Independence Day with a Flag Hoisting Ceremony on 04 February 2020 at the Chancery. Chargé d'Affaires a.i. Samanmali Atalugama read the President's speech during the event.",
      "Mission News"
    ],
    [
      "72nd Anniversary of Independence Celebrates in Beirut",
      "06.02.2020",
      "https://mfa.gov.lk/en/72nd-anniversary-of-independence-celebrates-in-beirut/",
      "The Embassy of Sri Lanka in Beirut commemorated the 72nd Anniversary of Sri Lanka's Independence Day on February 4, 2020, with two sessions. The morning session took place at the Chancery premises for Sri Lankans residing in Lebanon. The event marked a significant celebration for the Sri Lankan community in Beirut.",
      "Mission News"
    ],
    [
      "72nd Independence Day celebrations in Tokyo",
      "06.02.2020",
      "https://mfa.gov.lk/en/72nd-independence-day-celebrations-in-tokyo/",
      "The Embassy of Sri Lanka in Tokyo marked the 72nd Independence Day at the \"Reiyukai\" Institute on February 4. The event was attended by senior Japanese government officials, former Japanese Ambassadors to Sri Lanka, and Buddhist monks. The celebrations highlighted the strong cultural ties between the two nations.",
      "Mission News"
    ],
    [
      "72nd National Independence Day Celebrations in Jakarta, Indonesia",
      "06.02.2020",
      "https://mfa.gov.lk/en/72nd-national-independence-day-celebrations-in-jakarta-indonesia/",
      "The Embassy of Sri Lanka in Jakarta hosted a reception on February 4, 2020, to celebrate the 72nd National Independence Day with the Sri Lankan community. The event took place at the Embassy premises, marking a significant milestone in the country's history.",
      "Mission News"
    ],
    [
      "Sri Lanka’s 72nd Independence Day Ceremony in Oman",
      "06.02.2020",
      "https://mfa.gov.lk/en/sri-lankas-72nd-independence-day-ceremony-in-oman/",
      "The Embassy of Sri Lanka in Oman organized a flag hoisting ceremony to celebrate Sri Lanka's 72nd Independence Day on February 4, 2020. The event took place at the Embassy premises, marking the anniversary with a simple yet dignified ceremony.",
      "Mission News"
    ],
    [
      "Ceylon Tea Promotion at the 8th Annual Toronto Tea Festival 2020",
      "06.02.2020",
      "https://mfa.gov.lk/en/ceylon-tea-promotion-at-the-8th-annual-toronto-tea-festival-2020/",
      "The Consulate General of Sri Lanka in Toronto organized the 8th Annual Toronto Tea Festival at Toronto Reference Library as part of its 2020 Ceylon tea promotional campaign. The event was held in coordination with the Tea Guild of Toronto, showcasing the rich heritage of Ceylon tea to festival attendees.",
      "Mission News"
    ],
    [
      "PRESIDENT OF SAEMAUL GLOBALIZATION FOUNDATION OF SOUTH KOREA DISCUSSES ASSISTANCE AND POTENTIAL OF  SRI LANKA WITH AMBASSADOR",
      "06.02.2020",
      "https://mfa.gov.lk/en/president-of-saemaul-globalization-foundation-of-south-korea-discusses-assistance-and-potential-of-sri-lanka-with-ambassador/",
      "President of Saemaul Globalization Foundation, Dr. Chang Donghee, met with Ambassador Dr. Mendis at the Embassy to discuss the potential and assistance that Saemaul Undong could offer to Sri Lanka. They explored ways to enhance collaboration for the development of Sri Lanka.",
      "Mission News"
    ],
    [
      "Sri Lanka Showcased at Adventur Travel Fair in Lithuania",
      "03.02.2020",
      "https://mfa.gov.lk/en/sri-lanka-showcased-at-adventur-travel-fair-in-lithuania/",
      "Sri Lanka was featured at the Adventur Travel Fair in Lithuania through the efforts of the Sri Lanka Tourism Promotion Bureau (SLTPB) and the Embassy of Sri Lanka in Sweden. Sri Lankan Destination Management Companies (DMCs) participated in the event held in Vilnius, Lithuania, showcasing the country's tourism offerings.",
      "Mission News"
    ],
    [
      "Tourism Advertisement Campaign on Metro Trains in Toronto",
      "03.02.2020",
      "https://mfa.gov.lk/en/tourism-advertisement-campaign-on-metro-trains-in-toronto/",
      "The Consulate General, with support from the Ministry of Foreign Relations, Sri Lanka, conducted a one-month tourism advertising campaign on Metro trains in Toronto. The campaign aimed to promote Sri Lanka's tourism industry under the Economic Diplomacy Program.",
      "Mission News"
    ],
    [
      "ICC Women’s T20 World Cup 2020 Trophy tour to Canberra",
      "03.02.2020",
      "https://mfa.gov.lk/en/icc-womens-t20-world-cup-2020-trophy-tour-to-canberra/",
      "The staff of the Sri Lanka High Commission in Canberra welcomed a delegation led by Sam Watson, General Manager of the Australian Organising Committee of the ICC Women’s T20 World Cup 2020 during the Trophy tour to Canberra.",
      "Mission News"
    ],
    [
      "Prime Minister’s Senior Advisor on Economic Affairs discusses economic cooperation with UK’s political leadership",
      "31.01.2020",
      "https://mfa.gov.lk/en/prime-ministers-senior-advisor-on-economic-affairs-discusses-economic-cooperation-with-uks-political-leadership/",
      "Senior Advisor on Economic Affairs to the Prime Minister of Sri Lanka, Ajith Nivard Cabraal, visited the United Kingdom and met with the Minister of State for International Trade, The Rt Hon Conor Burns MP, to discuss economic cooperation. The meeting aimed to strengthen economic ties between the two countries.",
      "Mission News"
    ],
    [
      "Sri Lanka Participated at the FITUR, International Travel Fair in Spain",
      "31.01.2020",
      "https://mfa.gov.lk/en/sri-lanka-participated-at-the-fitur-international-travel-fair-in-spain/",
      "Sri Lanka participated in the 40th Edition of the FITUR International Travel Fair in Spain from 22 to 26 January 2022. The event was organized jointly by the Sri Lanka Tourism Promotion Bureau and the Embassy of Sri Lanka in France, showcasing the country's tourism offerings.",
      "Mission News"
    ],
    [
      "Sri Lankan Embassy conducts free Medical Camp and Clinic for Community Members",
      "31.01.2020",
      "https://mfa.gov.lk/en/sri-lankan-embassy-conducts-free-medical-camp-and-clinic-for-community-members/",
      "The Sri Lankan Embassy in Bahrain, in collaboration with the American Mission Hospital (AMH) and Sri Lanka Engineering Society (SLES), organized a free Medical Camp and Clinic at the Embassy premises on January 24, 2020. Community members were able to access medical services and support during the event.",
      "Mission News"
    ],
    [
      "Sri Lanka participates at CMT 2020",
      "30.01.2020",
      "https://mfa.gov.lk/en/sri-lanka-participates-at-cmt-2020/",
      "Sri Lanka Tourism, in collaboration with the Embassy of Sri Lanka in Berlin and Consulate General of Sri Lanka in Frankfurt, participated in the CMT Consumer Fair 2020 in Stuttgart, Germany from January 11-19, 2020. The event showcased Sri Lanka's tourism offerings to a wide audience.",
      "Mission News"
    ],
    [
      "Sri Lankan High Commissioner pays farewell call on Commonwealth Secretary-General",
      "28.01.2020",
      "https://mfa.gov.lk/en/sri-lankan-high-commissioner-pays-farewell-call-on-commonwealth-secretary-general/",
      "Sri Lanka's outgoing High Commissioner to the UK, Manisha Gunasekera, bid farewell to Commonwealth Secretary-General Patricia Scotland QC on January 21, 2020, at Marl.",
      "Mission News"
    ],
    [
      "Thai Pongal Celebrations 2020 at the Embassy of Sri Lanka in Lebanon",
      "28.01.2020",
      "https://mfa.gov.lk/en/thai-pongal-celebrations-2020-at-the-embassy-of-sri-lanka-in-lebanon/",
      "The Embassy of Sri Lanka in Lebanon, along with the Sri Lankan migrant community, celebrated Thai Pongal on January 19, 2020. More than 100 migrant workers took part in the festivities at the Embassy premises. The event marked a joyous occasion for all participants.",
      "Mission News"
    ],
    [
      "Shani Calyaneratne Karunaratne Presents Credentials as the Non-resident Ambassador of Sri Lanka to the Syrian Arab Republic",
      "28.01.2020",
      "https://mfa.gov.lk/en/shani-calyaneratne-karunaratne-presents-credentials-as-the-non-resident-ambassador-of-sri-lanka-to-the-syrian-arab-republic/",
      "Shani Calyaneratne Karunaratne presented her Letters of Credence as the Non-resident Ambassador of Sri Lanka to the Syrian Arab Republic to Bashar Al-Assad, the Deputy Prime Minister and Foreign Affairs Minister.",
      "Mission News"
    ],
    [
      "Thaipongal Celebrations at the Consulate General of Sri Lanka, Milan, Italy",
      "28.01.2020",
      "https://mfa.gov.lk/en/thaipongal-celebrations-at-the-consulate-general-of-sri-lanka-milan-italy/",
      "The Sri Lankan community in Milan, Italy celebrated Thaipongal for the first time at a ceremony organized by the Consulate General of Sri Lanka on January 19, 2020. The event took place at the Consulate General premises, marking a significant cultural celebration for the community.",
      "Mission News"
    ],
    [
      "SRI LANKA PAVILION AT THE WORLD’S LEADING ‘BOAT SHOW’ IN DUSSELDORF, GERMANY",
      "28.01.2020",
      "https://mfa.gov.lk/en/sri-lanka-pavilion-at-the-worlds-leading-boat-show-in-dusseldorf-germany/",
      "The Consulate General of Sri Lanka in Frankfurt collaborated with the Export Development Board to organize the Sri Lanka Pavilion at the world's largest international indoor fair for boats, held in Dusseldorf, Germany. The event showcased Sri Lanka's presence and offerings in the global boating industry.",
      "Mission News"
    ],
    [
      "Sri Lanka Embassy in Bahrain conducts an Interactive Meeting with Foreign Recruitment Agencies",
      "27.01.2020",
      "https://mfa.gov.lk/en/sri-lanka-embassy-in-bahrain-conducts-an-interactive-meeting-with-foreign-recruitment-agencies/",
      "The Sri Lanka Embassy in Bahrain, along with the Sri Lanka Bureau of Foreign Employment (SLBFE) and the Labour Market Regulatory Authority (LMRA) of Bahrain, organized an Interactive Meeting with Foreign Recruitment Agencies. The meeting aimed to enhance cooperation and communication between the agencies for better foreign employment opportunities.",
      "Mission News"
    ],
    [
      "SRI LANKAN AMBASSADOR HIGHLIGHTS TOURISM OF SRI LANKA AT THE DIPLOMATIC INTERNATIONAL FORUM OF SEOUL",
      "27.01.2020",
      "https://mfa.gov.lk/en/sri-lankan-ambassador-highlights-tourism-of-sri-lanka-at-the-diplomatic-international-forum-of-seoul/",
      "Sri Lankan Ambassador to the Republic of Korea, Dr. A. Saj U. Mendis, highlighted Sri Lanka's tourism sector during a recent keynote address at the Diplomatic International Forum of Seoul. The ambassador elaborated on the country's touristic attractions and opportunities for international visitors.",
      "Mission News"
    ],
    [
      "Winter clothes drive organized by Sri Lanka Embassy in Jordan",
      "24.01.2020",
      "https://mfa.gov.lk/en/winter-clothes-drive-organized-by-sri-lanka-embassy-in-jordan/",
      "The Sri Lanka Embassy in Jordan organized a winter clothes drive, with EAM Maliban Textiles Company donating complete sets of winter clothing to Sri Lankans in need. The initiative was led by Ambassador Shanika Dissanayake to support the community during the cold season.",
      "Mission News"
    ],
    [
      "Sri Lanka takes centre stage at the TITF-2020 Tour Fair in Bangkok",
      "24.01.2020",
      "https://mfa.gov.lk/en/sri-lanka-takes-centre-stage-at-the-titf-2020-tour-fair-in-bangkok/",
      "Sri Lanka was prominently featured at the TITF-2020 Tour Fair in Bangkok, with the Embassy of Sri Lanka and the SLTPB facilitating the participation of twelve Sri Lankan travel and tour companies. The event showcased the diverse offerings of Sri Lanka's tourism industry to a global audience.",
      "Mission News"
    ],
    [
      "Promote Sri Lanka through cultural icons: Japanese learn and sing  Sri Lankan National Anthem",
      "22.01.2020",
      "https://mfa.gov.lk/en/promote-sri-lanka-through-cultural-icons-japanese-learn-and-sing-sri-lankan-national-anthem/",
      "The Embassy staff and the 'National Anthem Ring Project' team in Tokyo hosted a cultural exchange program at the Sri Lankan Embassy with over 60 Japanese participants on January 18. As part of the event, the Japanese attendees learned and sang the Sri Lankan National Anthem, promoting cultural understanding between the two nations.",
      "Mission News"
    ],
    [
      "Sri Lanka High Commission in Canada celebrates Thai Pongal",
      "22.01.2020",
      "https://mfa.gov.lk/en/sri-lanka-high-commission-in-canada-celebrates-thai-pongal/",
      "The Sri Lanka High Commission in Canada celebrated Thai Pongal on January 19, 2020, at the Official Residence of the High Commissioner with a large gathering. The event began with a welcome address, followed by traditional festivities and cultural performances. The celebration highlighted the significance of Thai Pongal in Sri Lankan culture and fostered community spirit among attendees.",
      "Mission News"
    ],
    [
      "Ambassador of Sri Lanka to Viet Nam meets with Deputy Chief of   Viet Nam Coast Guard Senior Colonel Tran Quang Tuan",
      "22.01.2020",
      "https://mfa.gov.lk/en/ambassador-of-sri-lanka-to-viet-nam-meets-with-deputy-chief-of-viet-nam-coast-guard-senior-colonel-tran-quang-tuan/",
      "Ambassador of Sri Lanka to Viet Nam, Prasanna Gamage, met with Deputy Chief of Viet Nam Coast Guard, Senior Colonel Tran Quang Tuan, on January 15, 2020, at the Department of Foreign Relations of the Ministry of Foreign Affairs. The meeting aimed to discuss cooperation and strengthen ties between the two countries' coast guard forces.",
      "Mission News"
    ],
    [
      "Sri Lanka participates at ‘Vakanz’ Tourism Fair 2020 in Luxembourg",
      "22.01.2020",
      "https://mfa.gov.lk/en/sri-lanka-participates-at-vakanz-tourism-fair-2020-in-luxembourg/",
      "Sri Lanka, represented by the Embassy in Brussels and sponsored by the Sri Lanka Tourism Promotion Bureau, took part in the 29th edition of the 'Vakanz' Tourism Fair in Luxembourg at Luxexpo. The event aimed to promote Sri Lanka as a tourist destination and strengthen ties with the Luxembourg tourism market.",
      "Mission News"
    ],
    [
      "Sri Lankan High Commissioner pays farewell call on the UK Minister of State for the Commonwealth, UN and South Asia",
      "22.01.2020",
      "https://mfa.gov.lk/en/sri-lankan-high-commissioner-pays-farewell-call-on-the-uk-minister-of-state-for-the-commonwealth-un-and-south-asia/",
      "Sri Lanka's outgoing High Commissioner to the UK, Manisha Gunasekera, bid farewell in a meeting with Lord Tariq Ahmad of Wimbledon, the Minister of State for the Commonwealth, the United Nations, and South Asia.",
      "Mission News"
    ],
    [
      "Sri Lanka Participates in South Asia’s Travel and Tourism Exchange (SATTE) 2020 – International Travel Trade Show, India",
      "16.01.2020",
      "https://mfa.gov.lk/en/sri-lanka-participates-in-south-asias-travel-and-tourism-exchange-satte-2020-international-travel-trade-show-india/",
      "Sri Lanka Tourism Promotion Bureau participated in SATTE 2020, the International Travel Trade Show in India, showcasing the country's travel, tourism, and hospitality industry. The event was held in association with the High Commission of Sri Lanka, highlighting Sri Lanka's offerings to the global travel market.",
      "Mission News"
    ],
    [
      "Furthering Cooperation with Shenzhen",
      "14.01.2020",
      "https://mfa.gov.lk/en/furthering-cooperation-with-shenzhen/",
      "Consul General of Sri Lanka in Guangzhou, Priyangika Dharmasena, attended the opening ceremony of the 8th Session of the 6th Shenzhen on the invitation of the Shenzhen Foreign Affairs Office. This event aimed to further cooperation between Sri Lanka and Shenzhen.",
      "Mission News"
    ],
    [
      "Bahrain Chambers to Assist Sri Lanka in Trade and Investment",
      "14.01.2020",
      "https://mfa.gov.lk/en/bahrain-chambers-to-assist-sri-lanka-in-trade-and-investment/",
      "Bahrain Chambers of Commerce and Industry (BCCI) Chairman Sameer Nass met with Sri Lanka’s Ambassador Pradeepa Saram at Bait Al Tijjar on January 7, 2020. The meeting aimed to enhance trade and investment cooperation between the two countries.",
      "Mission News"
    ],
    [
      "Ceremonial Commencement of Work for the New Year 2020 took place at the Embassy of Sri Lanka in the Russian Federation",
      "14.01.2020",
      "https://mfa.gov.lk/en/ceremonial-commencement-of-work-for-the-new-year-2020-took-place-at-the-embassy-of-sri-lanka-in-the-russian-federation/",
      "The Embassy of Sri Lanka in the Russian Federation held a ceremonial commencement of work for the New Year 2020 on January 9. The event marked the beginning of the Mission's operations for the year.",
      "Mission News"
    ],
    [
      "High Commissioner Girihagama hosts the Deputy Speaker and the Chief of Staff and Deputy Secretary General of the Parliament of Sri Lanka",
      "14.01.2020",
      "https://mfa.gov.lk/en/high-commissioner-girihagama-hosts-the-deputy-speaker-and-the-chief-of-staff-and-deputy-secretary-general-of-the-parliament-of-sri-lanka/",
      "High Commissioner Girihagama hosted the Deputy Speaker J. M. Ananda Kumarasiri and the Chief of Staff and Deputy Secretary General of the Parliament of Sri Lanka, Neil Iddawala. They participated in the 25th Conference of Speakers and Presiding Officers. The event aimed to discuss important parliamentary matters.",
      "Mission News"
    ],
    [
      "Minister of Foreign Relations Dinesh Gunawardena successfully concludes  the first official visit to India",
      "10.01.2020",
      "https://mfa.gov.lk/en/first-official-visit-to-india-eng/",
      "Minister of Foreign Relations Dinesh Gunawardena successfully concluded his first official visit to India from 9-10 January 2020. The visit was undertaken at the invitation of the Minister of External Affairs, marking an important diplomatic engagement between the two countries.",
      "Mission News"
    ],
    [
      "Annual Pirith Ceremony held at the Embassy of Sri Lanka in Kuwait",
      "07.01.2020",
      "https://mfa.gov.lk/en/annual-pirith-ceremony-held-at-the-embassy-of-sri-lanka-in-kuwait/",
      "The Embassy of Sri Lanka in Kuwait, along with the Sri Lanka Association for Funeral Assistance & Social Services, held the annual Pirith ceremony for the 4th consecutive year. The ceremony took place at the Embassy premises, marking a significant tradition for the Sri Lankan community in Kuwait.",
      "Mission News"
    ],
    [
      "Ceremonial Commencement of Work for the Year 2020  Consulate General of Sri Lanka – Jeddah",
      "07.01.2020",
      "https://mfa.gov.lk/en/ceremonial-commencement-of-work-for-the-year-2020-consulate-general-of-sri-lanka-jeddah/",
      "The Consulate General of Sri Lanka in Jeddah ceremonially commenced work for the year 2020 on January 1st. Counsellor T.F.M. Aashiq hoisted the National Flag, followed by the singing of the national anthem at the Consulate General Premises. The event marked the official start of operations for the new year.",
      "Mission News"
    ],
    [
      "Christmas event organized by the  Sri Lanka Deputy High Commission, Chennai",
      "06.01.2020",
      "https://mfa.gov.lk/en/christmas-event-organized-by-the-sri-lanka-deputy-high-commission-chennai/",
      "The Sri Lanka Deputy High Commission in Chennai organized a Christmas event on December 9, 2019. The event was attended by Deputy High Commissioner V. Krishnamoorthy, Christian clergy, and officials from the Sri Lankan establishment, celebrating the festive season.",
      "Mission News"
    ],
    [
      "Business and Investment Promotion Programme in Kerala by Sri Lanka Deputy High Commission in Chennai",
      "06.01.2020",
      "https://mfa.gov.lk/en/business-and-investment-promotion-programme-in-kerala-by-sri-lanka-deputy-high-commission-in-chennai-2/",
      "The Sri Lanka Deputy High Commission in Chennai, led by Deputy High Commissioner V. Krishnamoorthy and Minister (Commercial) Yasantha De Silva, conducted a Business and Investment Promotion Programme in Kerala from 18-20 December, 2019. The objective of the visit was to highlight opportunities for business and investment in the region, fostering economic ties between Sri Lanka and Kerala.",
      "Mission News"
    ],
    [
      "Ceremonial Commencement of Work at the Sri Lanka Consulate General in Frankfurt",
      "06.01.2020",
      "https://mfa.gov.lk/en/ceremonial-commencement-of-work-at-the-sri-lanka-consulate-general-in-frankfurt/",
      "The staff of the Sri Lanka Consulate General in Frankfurt am Main started work for 2020 with a special program on January 2, 2020, including the hoisting of the national flag.",
      "Mission News"
    ],
    [
      "The Embassy of Sri Lanka in Oman Commences the Work Year 2020",
      "06.01.2020",
      "https://mfa.gov.lk/en/the-embassy-of-sri-lanka-in-oman-commences-the-work-year-2020/",
      "The Embassy of Sri Lanka in Oman began the work year 2020 with a ceremony where staff members pledged their commitment to implementing public policies and goals by taking the oath of allegiance to public service. The event was held at the Embassy.",
      "Mission News"
    ],
    [
      "Commencement of Work for the Year 2020 at Sri Lanka High Commission in Pretoria",
      "06.01.2020",
      "https://mfa.gov.lk/en/commencement-of-work-for-the-year-2020-at-sri-lanka-high-commission-in-pretoria/",
      "The Sri Lanka High Commission in Pretoria started its operations for 2020 on January 2, 2020. High Commissioner Kumar Mallimaratchi inaugurated the official ceremony by raising the national flag.",
      "Mission News"
    ],
    [
      "Ceremonial Commencement of Work-Year 2020, at the Embassy of  Sri Lanka in Jakarta",
      "03.01.2020",
      "https://mfa.gov.lk/en/ceremonial-commencement-of-work-year-2020-at-the-embassy-of-sri-lanka-in-jakarta/",
      "The staff of the Sri Lanka Embassy in Indonesia ceremonially began work for 2020 with a special program at the Embassy premises on January 2, 2020. The program included a flag hoisting ceremony and marked the official start of the work-year.",
      "Mission News"
    ],
    [
      "Ambassador Ameer Ajwad calls on  Minister Responsible for Foreign Affairs of the Sultanate of Oman Yusuf bin Alawi bin Abdullah",
      "03.01.2020",
      "https://mfa.gov.lk/en/ambassador-ameer-ajwad-calls-on-minister-responsible-for-foreign-affairs-of-the-sultanate-of-oman-yusuf-bin-alawi-bin-abdullah/",
      "Ambassador of Sri Lanka to Oman, O.L. Ameer Ajwad, met with the Minister Responsible for Foreign Affairs of Oman, Yusuf bin Alawi bin Abdullah, on January 2, 2020, at the Ministry of Foreign Affairs.",
      "Mission News"
    ],
    [
      "Embassy of Sri Lanka in Berlin ceremonially commences work for the year 2020",
      "03.01.2020",
      "https://mfa.gov.lk/en/embassy-of-sri-lanka-in-berlin-ceremonially-commences-work-for-the-year-2020/",
      "The Embassy of Sri Lanka in Berlin officially began its work for 2020 with a special event at its premises. The event commenced with the hoisting of the National Flag by Charge d’Affaires.",
      "Mission News"
    ],
    [
      "The Embassy of Sri Lanka in Paris celebrates Christmas",
      "03.01.2020",
      "https://mfa.gov.lk/en/the-embassy-of-sri-lanka-in-paris-celebrates-christmas/",
      "The Embassy of Sri Lanka in Paris celebrated Christmas on December 20, 2019, with Reverends Prabath Thamel and Janith Kaushalya at the Embassy premises. The event commenced with a keynote speech delivered by the Ambassador. It was a festive occasion bringing together the Sri Lankan community in France.",
      "Mission News"
    ],
    [
      "The Ceremonial Commencement of First Working Day of Year 2020 Embassy of Sri Lanka in Warsaw",
      "03.01.2020",
      "https://mfa.gov.lk/en/the-ceremonial-commencement-of-first-working-day-of-year-2020-embassy-of-sri-lanka-in-warsaw/",
      "The Embassy of Sri Lanka in Warsaw held a ceremonial commencement of the first working day of 2020 on January 2, 2020, with the participation of the Ambassador and all staff members. The event included the hoisting of the national flag and a gathering to mark the beginning of the new year.",
      "Mission News"
    ],
    [
      "Ceremonial Commencement of Work – Year 2020  at the Consulate General of Sri Lanka in Toronto",
      "03.01.2020",
      "https://mfa.gov.lk/en/ceremonial-commencement-of-work-year-2020-at-the-consulate-general-of-sri-lanka-in-toronto/",
      "The Consulate General of Sri Lanka in Toronto officially started its work for 2020 with a ceremonial program on January 2, 2020, at its premises. The Consul General presided over the commencement ceremony, marking the beginning of the new year's activities at the consulate.",
      "Mission News"
    ],
    [
      "Commencement of work in the New Year 2020",
      "03.01.2020",
      "https://mfa.gov.lk/en/commencement-of-work-in-the-new-year-2020/",
      "The Embassy of Sri Lanka in Brussels started work in the New Year 2020 with a brief ceremony, where Ambassador Grace Asirwatham hoisted the National Flag followed by singing. The event marked the official commencement of activities for the year.",
      "Mission News"
    ],
    [
      "Embassy in Washington DC commences work in the new year with a firm resolve",
      "03.01.2020",
      "https://mfa.gov.lk/en/embassy-in-washington-dc-commences-work-in-the-new-year-with-a-firm-resolve/",
      "The Embassy of Sri Lanka in Washington DC officially started its work in the new year 2020 with a special program at the chancery building on January 2nd. The program commenced with a ceremony, showcasing the embassy's firm resolve for the year ahead.",
      "Mission News"
    ],
    [
      "High Commissioner Girihagama attends religious observances to invoke blessings for the New Year",
      "03.01.2020",
      "https://mfa.gov.lk/en/high-commissioner-girihagama-attends-religious-observances-to-invoke-blessings-for-the-new-year/",
      "Sri Lanka’s High Commissioner to Canada, Asoka Girihagama, participated in special religious observances at two Buddhist temples in Ottawa: the Ottawa Buddhist Vihara and Hilda Jayewardenarama, to seek blessings for the New Year.",
      "Mission News"
    ],
    [
      "Commencement of the work year 2020 at Sri Lanka  High Commission in Kuala Lumpur",
      "03.01.2020",
      "https://mfa.gov.lk/en/commencement-of-the-work-year-2020-at-sri-lanka-high-commission-in-kuala-lumpur/",
      "The work year 2020 at the Sri Lanka High Commission in Kuala Lumpur began with High Commissioner Air Chief Marshal Kapila Veedhiya Bandara hosting the national flag on 01 January 2020. The High Commissioner marked the commencement of the year at the High Commission.",
      "Mission News"
    ],
    [
      "Ceremonial commencement of Work- 2020",
      "03.01.2020",
      "https://mfa.gov.lk/en/ceremonial-commencement-of-work-2020/",
      "The staff of the Sri Lanka Embassy in Egypt ceremonially started work for 2020 with a special program at the Embassy Premises on January 1st. The program began with a religious observance, marking the beginning of the new year.",
      "Mission News"
    ],
    [
      "Sri Lanka Embassy in Tokyo commenced 2020 with a consular mobile service",
      "03.01.2020",
      "https://mfa.gov.lk/en/sri-lanka-embassy-in-tokyo-commenced-2020-with-a-consular-mobile-service/",
      "The Sri Lanka Embassy in Tokyo kicked off 2020 by offering a consular mobile service at Sawara “Lankaji” Temple in Chiba Prefecture. Approximately 100 Sri Lankan expatriates received various consular services during the event. This initiative aimed to assist and support the Sri Lankan community living in Japan.",
      "Mission News"
    ],
    [
      "Commencement of Work on January 1st at the Sri Lanka High Commission in Canberra",
      "02.01.2020",
      "https://mfa.gov.lk/en/commencement-of-work-on-january-1st-at-the-sri-lanka-high-commission-in-canberra/",
      "The staff at the Sri Lanka High Commission in Canberra began work on January 1st with a special morning program at the premises. The program marked the commencement of activities for the new year.",
      "Mission News"
    ],
    [
      "Ceremonial Commencement of Work – Year 2020, at the Embassy of Sri Lanka in Bahrain",
      "02.01.2020",
      "https://mfa.gov.lk/en/ceremonial-commencement-of-work-year-2020-at-the-embassy-of-sri-lanka-in-bahrain/",
      "The staff of the Sri Lanka Embassy in Bahrain ceremonially commenced work for the year 2020 with a special program at the Embassy premises on January 1, 2020. The program marked the beginning of their official duties for the new year.",
      "Mission News"
    ],
    [
      "Commencement of First Working Day, Year – 2020",
      "02.01.2020",
      "https://mfa.gov.lk/en/commencement-of-first-working-day-year-2020/",
      "The first working day of 2020 commenced with an official ceremony at the Embassy of Sri Lanka in Yangon on 01 January 2020, led by Ambassador Nandimithra Ekanayake.",
      "Mission News"
    ],
    [
      "The Commencement of Work Year 2020 at the Embassy of Sri Lanka in Lebanon",
      "02.01.2020",
      "https://mfa.gov.lk/en/the-commencement-of-work-year-2020-at-the-embassy-of-sri-lanka-in-lebanon/",
      "The Embassy of Sri Lanka in Lebanon started its work for 2020 with a ceremonial program on January 1, 2020, at the Embassy premises. Ambassador Shani Calyaneratne Karunarat led the commencement ceremony.",
      "Mission News"
    ],
    [
      "Christmas Celebrations in Mumbai",
      "02.01.2020",
      "https://mfa.gov.lk/en/christmas-celebrations-in-mumbai-3/",
      "The Consulate General of Sri Lanka in Mumbai hosted its Annual Christmas Celebrations on December 20, 2019, at the Mission Premises. The event was well-attended by a large gathering of Sri Lankans, including representatives from the Sri Lanka Navy. It was a festive and joyous occasion for all participants.",
      "Mission News"
    ],
    [
      "Sri Lanka is recognized as Asia’s Best Nation for Wildlife Tourism at the Top Asia Corporate Ball 2019",
      "01.01.2020",
      "https://mfa.gov.lk/en/sri-lanka-is-recognized-as-asias-best-nation-for-wildlife-tourism-at-the-top-asia-corporate-ball-2019/",
      "Sri Lanka has been named Asia's Best Nation for Wildlife Tourism at the Top Asia Corporate Ball 2019, as recognized by Top 10 Asia's premier publications. The High Commissioner of Sri Lanka, Kapila Jayampathy, accepted the prestigious award on behalf of the country.",
      "Mission News"
    ],
    [
      "Sri Lanka Embassy in Israel Celebrates Christmas",
      "01.01.2020",
      "https://mfa.gov.lk/en/sri-lanka-embassy-in-israel-celebrates-christmas/",
      "The Sri Lanka Embassy in Tel Aviv celebrated Christmas on 29 December 2019 with the Sri Lankan community in Israel at the Embassy premises. The event included a gathering led by Rev. Father Harald Leo Meril Peiris from the Diocese of Colombo.",
      "Mission News"
    ],
    [
      "Christmas Celebration 2019",
      "01.01.2020",
      "https://mfa.gov.lk/en/christmas-celebration-2019/",
      "The Embassy of Sri Lanka in Lebanon celebrated Christmas on 29 December 2019 with over 100 migrant workers from the Sri Lankan community. The celebration took place at the Embassy premises, bringing together the migrant workers for a festive event.",
      "Mission News"
    ]
  ]
}