{
  "columns": [
    "Title",
    "Date",
    "Link",
    "Summary",
    "Category"
  ],
  "rows": [
    [
      "The message of H.E. Ranil Wickremesinghe, President of Sri Lanka for Christmas 2023",
      "25.12.2023",
      "https://mfa.gov.lk/en/the-message-of-h-e-ranil-wickremesinghe-president-of-sri-lanka-for-christmas-2023/",
      "President of Sri Lanka, H.E. Ranil Wickremesinghe, delivered Christmas Day messages in English, Sinhala, and Tamil for Christmas 2023. The messages were aimed at conveying his wishes and spreading festive cheer to the people of Sri Lanka.",
      "Ministry News"
    ],
    [
      "Inaugural Session of Sri Lanka-Nepal Joint Commission at Foreign Ministers’ Level successfully concluded in Kathmandu",
      "22.12.2023",
      "https://mfa.gov.lk/en/inaugural-session-sl-nepal/",
      "Foreign Minister Ali Sabry successfully concluded a two-day official visit to Nepal on December 21 and 22, 2023. During the visit, he co-chaired the inaugural session of the Sri Lanka-Nepal Joint Commission at the Foreign Ministers' level in Kathmandu.",
      "Ministry News"
    ],
    [
      "Rescue and Repatriation of Sri Lankan victims of human trafficking in Myanmar",
      "22.12.2023",
      "https://mfa.gov.lk/en/rescue-repatriation-of-sl-myanmar/",
      "The Ministry of Foreign Affairs is addressing the situation in Myanmar where Sri Lankan nationals are victims of human trafficking for cybercrimes. Efforts are being made for the rescue and repatriation of these victims.",
      "Ministry News"
    ],
    [
      "High Commissioner of the Republic of India presents Credentials to Sri Lanka",
      "22.12.2023",
      "https://mfa.gov.lk/en/hc-india-presents-credentials-sl/",
      "The Government of India has appointed Mr. Santosh Jha as the High Commissioner of India to Sri Lanka, based in Colombo. He has presented his credentials to the Sri Lankan government.",
      "Ministry News"
    ],
    [
      "Sri Lanka Foreign Service Association contributes to Lady Ridgeway Children’s Hospital lifesaving initiatives",
      "22.12.2023",
      "https://mfa.gov.lk/en/sri-lanka-foreign-service-association-contributes-to-lady-ridgeway-childrens-hospital-lifesaving-initiatives/",
      "The Sri Lanka Foreign Service Association (SLFSA) successfully concluded two fundraising initiatives to support the Lady Ridgeway Hospital for Children (LRH) in procuring life-saving equipment. The contributions from SLFSA will help enhance the hospital's lifesaving initiatives.",
      "Ministry News"
    ],
    [
      "Foreign Minister Ali Sabry to Visit Kathmandu for the Inaugural Session of the Sri Lanka-Nepal Joint Commission",
      "18.12.2023",
      "https://mfa.gov.lk/en/fmsl-to-visit-kathmandu/",
      "Foreign Minister Ali Sabry is set to visit Kathmandu from December 20-22, 2023, to participate in the Inaugural Session of the Sri Lanka-Nepal Joint Commission at the Foreign Ministers’ level. During the visit, the Foreign Minister will lead the Sri Lankan delegation in discussions aimed at strengthening bilateral ties between the two countries.",
      "Ministry News"
    ],
    [
      "Foreign Minister Ali Sabry attends the Doha Forum-2023 in Qatar",
      "15.12.2023",
      "https://mfa.gov.lk/en/fmsl-attends-doha-forum-2023/",
      "Foreign Minister Ali Sabry visited Qatar to attend the 21st Edition of the Doha Forum with the theme 'Building Shared Futures' on December 10-11, 2023. He was invited by Pri to participate in the event, which aimed to foster international cooperation and dialogue.",
      "Ministry News"
    ],
    [
      "Visit of HRH Princess Anne, the Princess Royal of the UK",
      "14.12.2023",
      "https://mfa.gov.lk/en/visit-of-hrh-princess-anne-uk/",
      "Her Royal Highness Princess Anne, The Princess Royal of the United Kingdom, will visit Sri Lanka from January 10 to 13, 2024. She will be accompanied by her spouse, Vice Admiral Sir Tim Laurence. The visit aims to strengthen diplomatic ties between the UK and Sri Lanka.",
      "Ministry News"
    ],
    [
      "Human Rights Day Message",
      "10.12.2023",
      "https://mfa.gov.lk/en/human-rights-day-message/",
      "Today marks the 75th Anniversary of the Universal Declaration of Human Rights (UDHR), and Sri Lanka sees this milestone as an opportunity to reaffirm the importance of human rights for all. It is a time to reflect on the intrinsic value of human rights and their significance in promoting equality and dignity for everyone.",
      "Ministry News"
    ],
    [
      "Foreign Minister Ali Sabry to participate at the Doha Forum in Qatar",
      "08.12.2023",
      "https://mfa.gov.lk/en/qatar/",
      "Foreign Minister Ali Sabry will visit Qatar from December 9-12, 2023, to participate in the Doha Forum. He is set to engage in high-level discussions during the event.",
      "Ministry News"
    ],
    [
      "International Bazaar & Cultural Extravaganza 2023",
      "07.12.2023",
      "https://mfa.gov.lk/en/international-bazaar-cultural-extravaganza-2023/",
      "The 'International Bazaar & Cultural Extravaganza 2023' took place in Colombo, organized by the Sri Lanka Foreign Service Association and diplomatic missions. The event aimed to raise funds for charitable causes and promote cultural exchange.",
      "Ministry News"
    ],
    [
      "Saudi Minister of Economy and Planning meets with Foreign Minister Ali Sabry",
      "29.11.2023",
      "https://mfa.gov.lk/en/saudiminister/",
      "Saudi Minister of Economy and Planning, Faisal bin Alibrahim, visited Sri Lanka on November 26-27, 2023, where he met with Foreign Minister Ali Sabry. The meeting aimed to discuss bilateral economic cooperation between Saudi Arabia and Sri Lanka.",
      "Ministry News"
    ],
    [
      "New Ambassadors-designate to assume duties",
      "28.11.2023",
      "https://mfa.gov.lk/en/new-ambassadors-designate-to-assume-duties/",
      "The Ministry of Foreign Affairs wrapped up an orientation program for 10 Heads of Mission-designate appointed by President Ranil Wickremesinghe. The Ambassadors-designate then paid a courtesy call on President. The new Ambassadors-designate are now ready to assume their duties.",
      "Ministry News"
    ],
    [
      "Four Sri Lankans stranded in Gaza safely arrived in Sri Lanka",
      "27.11.2023",
      "https://mfa.gov.lk/en/four-sri-lankans-stranded-in-gaza-safely-arrived-in-sl/",
      "Four Sri Lankans, including a family, who were stranded in Gaza, safely arrived in Sri Lanka on November 24, 2023. The Consular Affairs Division of the Ministry of Foreign Affairs facilitated their repatriation.",
      "Ministry News"
    ],
    [
      "Special Envoy of the Chinese President, Shen Yiqin led an official delegation to Sri Lanka",
      "21.11.2023",
      "https://mfa.gov.lk/en/state-councilor-shen-yiqin/",
      "Chinese President Xi Jinping's Special Envoy and State Councilor Shen Yiqin visited Sri Lanka from 19 November 2023 as part of an official delegation. Shen Yiqin, who is also the President of the All-China Women's Federation, led the delegation during the four-day visit.",
      "Ministry News"
    ],
    [
      "Deepavali Celebrations at the Ministry of Foreign Affairs",
      "21.11.2023",
      "https://mfa.gov.lk/en/deepavali-celebrations-mfa/",
      "The Ministry of Foreign Affairs celebrated Deepavali with the Diplomatic Corps and Ministry staff. Foreign Minister Ali Sabry spoke at the event, emphasizing the significance of the occasion. The celebration aimed to foster cultural understanding and strengthen diplomatic ties.",
      "Ministry News"
    ],
    [
      "High level Communist Party delegation from Vietnam call on the Acting Minister of Foreign Affairs",
      "17.11.2023",
      "https://mfa.gov.lk/en/vietnam/",
      "A high-level delegation from the Communist Party of Vietnam, led by Bui Van Nghiem, Member of the Party Central Committee term XIII, and Secretary of the Provincial Party Committee, called on the Acting Minister of Foreign Affairs. The delegation, consisting of 35 members, engaged in discussions with the Acting Minister during the meeting.",
      "Ministry News"
    ],
    [
      "Sri Lanka elected to the Executive Board of the UNESCO",
      "16.11.2023",
      "https://mfa.gov.lk/en/sl-elected-executive-board-unesco/",
      "Sri Lanka has been elected to the Executive Board of UNESCO for the term 2023-2027 during the 42nd General Conference. This appointment highlights Sri Lanka's increased involvement in the inter-governmental organization.",
      "Ministry News"
    ],
    [
      "Foreign Minister Ali Sabry to attend the 3rd Ministerial Conference on Maritime Security and Safety in the Western Indian Ocean in Mauritius",
      "14.11.2023",
      "https://mfa.gov.lk/en/fm-sl-3rd-ministerial-conference/",
      "Foreign Minister Ali Sabry has been invited by Mauritius' Minister of Foreign Affairs to attend the 3rd Ministerial Conference on Maritime Security and Safety in the Western Indian Ocean. The conference will take place in Mauritius.",
      "Ministry News"
    ],
    [
      "​The first round of Sri Lanka – Sweden political consultations concludes successfully on 09 November 2023",
      "13.11.2023",
      "https://mfa.gov.lk/en/1st-round-sl-sweden-political-consultations/",
      "Sri Lanka and Sweden successfully concluded their first round of virtual bilateral political consultations at the senior official level on 09 November 2023. The consultations were held in anticipation of the 75th anniversary of the establishment of diplomatic relations between the two countries.",
      "Ministry News"
    ],
    [
      "Sri Lanka commends Qatar’s Facilitation for Evacuation of 11 Sri Lankans from Gaza",
      "06.11.2023",
      "https://mfa.gov.lk/en/sl-commends-qatars-facilitation/",
      "Sri Lanka's Minister of Foreign Affairs, M.U.M. Ali Sabry, commended Qatar for facilitating the evacuation of 11 Sri Lankans from Gaza. He appreciated the constructive role played by the State of Qatar under the guidance of His Highness Sheikh Tamim bin Hamad Al-Thani, Amir of the State of Qatar.",
      "Ministry News"
    ],
    [
      "Ambassador of Norway presents Credentials to Sri Lanka",
      "05.11.2023",
      "https://mfa.gov.lk/en/ambassador-of-norway-to-sl/",
      "Ms. May-Elin Stener has been appointed as the Ambassador Extraordinary and Plenipotentiary of the Kingdom of Norway to Sri Lanka with the concurrence of the Government of Sri Lanka. She presented her credentials to Sri Lanka as the official representative of Norway.",
      "Ministry News"
    ],
    [
      "Ambassador of Venezuela presents Credentials to Sri Lanka",
      "05.11.2023",
      "https://mfa.gov.lk/en/ambassador-of-venezuela-to-sl/",
      "Ms. Capaya Rodriguez Gonzalez has been appointed as the Ambassador Extraordinary and Plenipotentiary of the Bolivarian Republic of Venezuela to Sri Lanka. The Government of Venezuela, with the approval of Sri Lanka, has confirmed her credentials.",
      "Ministry News"
    ],
    [
      "Ambassador of Finland presents Credentials to Sri Lanka",
      "05.11.2023",
      "https://mfa.gov.lk/en/ambassador-of-finland-to-sl/",
      "The Government of Finland has appointed Mr. Kimmo Lahdevirta as the new Ambassador to Sri Lanka with the approval of the Sri Lankan Government. Mr. Lahdevirta will serve as the Ambassador Extraordinary and Plenipotentiary of Finland in Sri Lanka.",
      "Ministry News"
    ],
    [
      "Ambassador of Angola presents Credentials to Sri Lanka",
      "05.11.2023",
      "https://mfa.gov.lk/en/ambassador-of-angola-to-sl/",
      "Angola's Government appointed Mr. Clemente Pedro Camenha as Ambassador to Sri Lanka with the approval of the Sri Lankan Government. He presented his credentials as the new Ambassador of Angola to Sri Lanka.",
      "Ministry News"
    ],
    [
      "Ambassador of Djibouti presents Credentials to Sri Lanka",
      "05.11.2023",
      "https://mfa.gov.lk/en/ambassador-of-djibouti-to-sl/",
      "Mr. Isse Abdillahi Assoweh has been appointed as the Ambassador Extraordinary and Plenipotentiary of the Republic of Djibouti to Sri Lanka. The Government of Djibouti, with the approval of Sri Lanka, has made this diplomatic appointment official.",
      "Ministry News"
    ],
    [
      "Ambassador of Suriname presents Credentials to Sri Lanka",
      "05.11.2023",
      "https://mfa.gov.lk/en/ambassador-of-suriname-to-sl/",
      "The Government of Suriname has appointed Mr. Arunkoemar Hardien as Ambassador Extraordinary and Plenipotentiary to Sri Lanka with the approval of the Sri Lankan government. Mr. Hardien presented his credentials to Sri Lanka, officially beginning his diplomatic role.",
      "Ministry News"
    ],
    [
      "Ambassador of Portugal presents Credentials to Sri Lanka",
      "05.11.2023",
      "https://mfa.gov.lk/en/ambassador-of-portugal-to-sl/",
      "The Government of the Portuguese Republic, with the approval of the Government of Sri Lanka, has named Mr. Joao Manuel Mendes de Almeida as the new Ambassador Extraordinary and Plenipotentiary of Portugal to Sri Lanka. Mr. Almeida has presented his credentials to the Sri Lankan authorities.",
      "Ministry News"
    ],
    [
      "Ambassador of Cambodia presents Credentials to Sri Lanka",
      "05.11.2023",
      "https://mfa.gov.lk/en/ambassador-of-cambodia-to-sl/",
      "Mr. Koy Kuong has been appointed as the Ambassador Extraordinary and Plenipotentiary of the Kingdom of Cambodia to Sri Lanka with the concurrence of both governments. He presented his credentials to Sri Lanka as the new ambassador.",
      "Ministry News"
    ],
    [
      "Ambassador of Philippines presents Credentials to Sri Lanka",
      "05.11.2023",
      "https://mfa.gov.lk/en/ambassador-of-philippines-to-sl/",
      "The Government of the Republic of the Philippines, with the approval of the Government of Sri Lanka, has designated Mr. Leo Tito Ausan, Jr. as the new Ambassador Extraordinary and Plenipotentiary to Sri Lanka. Mr. Ausan presented his credentials in a formal ceremony to strengthen diplomatic ties between the two countries.",
      "Ministry News"
    ],
    [
      "Ambassador of Latvia presents Credentials to Sri Lanka",
      "05.11.2023",
      "https://mfa.gov.lk/en/ambassador-of-latvia-to-sl/",
      "Mr. Juris Bone has been appointed as the Ambassador Extraordinary and Plenipotentiary of the Republic of Latvia to Sri Lanka. He presented his credentials to the Government of Sri Lanka, officially assuming his diplomatic role.",
      "Ministry News"
    ],
    [
      "Eleven Sri Lankans safely arrived in Colombo from Gaza",
      "05.11.2023",
      "https://mfa.gov.lk/en/11-sl-arrived-cmb-from-gaza/",
      "Eleven Sri Lankan nationals, comprising two adults and nine children from two families, safely arrived in Colombo from the Gaza Strip this morning (05 November). The Consular Affairs Division facilitated their return home.",
      "Ministry News"
    ],
    [
      "Eleven Sri Lankans safely arrived in Egypt from Gaza",
      "03.11.2023",
      "https://mfa.gov.lk/en/11-sl-safty-arrived-egypt-from-gaza/",
      "Eleven Sri Lankan nationals safely arrived in Egypt from Gaza with the assistance of the Embassy of Sri Lanka in Cairo and the Egyptian authorities, along with support from the Sri Lankan Representative in Ramallah.",
      "Ministry News"
    ],
    [
      "Discussion on advancement of women in the context of CEDAW",
      "02.11.2023",
      "https://mfa.gov.lk/en/discussion-on-advancement-of-women-in-the-context-of-cedaw/",
      "Foreign Secretary Aruni Wijewardane chaired a discussion on the advancement of women in the context of CEDAW with eminent Sri Lankan experts who have contributed internationally. The exchange of views focused on matters related to women's progress and empowerment.",
      "Ministry News"
    ],
    [
      "Foreign Minister inaugurates Orientation Programme for Heads of Mission designate of Sri Lanka",
      "02.11.2023",
      "https://mfa.gov.lk/en/orientation-programme-hom-designate-sl/",
      "Foreign Minister Ali Sabry inaugurated a two-week Orientation Programme for the Heads of Mission designate of Sri Lanka at the Ministry of Foreign Affairs on 01 November 2023. During the event, Minister Sabry outlined key aspects of the programme.",
      "Ministry News"
    ],
    [
      "11th Inter-Parliamentary meeting between Sri Lanka and the EU concludes on 31 October 2023",
      "02.11.2023",
      "https://mfa.gov.lk/en/11th-inter-parliamentary-eu-sl/",
      "The 11th Inter-Parliamentary meeting between Sri Lanka and the EU, specifically with the Delegation for relations with the countries of South Asia of the European Parliament (DSAS), concluded on 31 October 2023 at the Sri Lanka Parliament.",
      "Ministry News"
    ],
    [
      "Inaugural Bilateral Consultations between Sri Lanka and France  25 October 2023, Colombo, Sri Lanka  Joint Communiqué",
      "27.10.2023",
      "https://mfa.gov.lk/en/sl-france-bilateral-consultations/",
      "Sri Lanka and France held their first bilateral consultations at the senior official level in Colombo on 25 October 2023. The meeting marked the 75th anniversary of diplomatic relations between the two countries.",
      "Ministry News"
    ],
    [
      "Ministry of Foreign Affairs Launches Hotline Facility for Sri Lankans to seek assistance in connection to the Conflict Situation in the Middle East",
      "27.10.2023",
      "https://mfa.gov.lk/en/mfa-hotline-facility/",
      "The Ministry of Foreign Affairs in Colombo has launched two emergency hotline mobile numbers for Sri Lankans seeking assistance related to the Conflict Situation in the Middle East. This initiative allows Sri Lankan nationals to contact the Ministry of Foreign Affairs promptly for support during this challenging time.",
      "Ministry News"
    ],
    [
      "Consular Affairs Division of Ministry of Foreign Affairs launches Online authentication of GCE O/L & A/L Certificates",
      "27.10.2023",
      "https://mfa.gov.lk/en/mfa-consular-online/",
      "The Consular Affairs Division of the Ministry of Foreign Affairs, in collaboration with the Department of Examinations, has introduced an online authentication service for GCE Ordinary Level (O/L) and Advanced Level (A/L) certificates. This new online service streamlines the process for verifying the authenticity of these certificates.",
      "Ministry News"
    ],
    [
      "Appointment of Ambassador of the Islamic Republic of Iran to Sri Lanka",
      "24.10.2023",
      "https://mfa.gov.lk/en/ambassador-of-iran-to-sl/",
      "Dr. Alireza Delkhosh has been appointed as the Ambassador Extraordinary and Plenipotentiary of the Islamic Republic of Iran to Sri Lanka with the concurrence of the Government of Sri Lanka.",
      "Ministry News"
    ],
    [
      "Appointment of Ambassador of the European Union to Sri Lanka",
      "24.10.2023",
      "https://mfa.gov.lk/en/ambassador-of-eu-to-sl/",
      "The European Union, in agreement with the Government of Sri Lanka, has named Ms. Carmen Moreno as the new Ambassador Extraordinary and Plenipotentiary of the European Union to Sri Lanka. She will be stationed in Colombo to represent the EU in diplomatic matters.",
      "Ministry News"
    ],
    [
      "Appointment of Ambassador of Switzerland to Sri Lanka",
      "24.10.2023",
      "https://mfa.gov.lk/en/ambassador-of-switzerland-sl/",
      "The Government of Switzerland, with the approval of the Government of Sri Lanka, has appointed Dr. (Ms.) Siri Walt as the new Ambassador Extraordinary and Plenipotentiary of Switzerland to Sri Lanka. She will be based in Colombo.",
      "Ministry News"
    ],
    [
      "Joint Statement between the People’s Republic of China and  the Democratic Socialist Republic of Sri Lanka  Beijing, October 20, 2023",
      "20.10.2023",
      "https://mfa.gov.lk/en/joint-statement-china-sl-2023/",
      "During the third Belt and Road Forum in Beijing on October 20, 2023, President Ranil Wickremesinghe of Sri Lanka attended at the invitation of President Xi Jinping of China. The two countries issued a joint statement outlining their cooperation and partnership.",
      "Ministry News"
    ],
    [
      "President Wickremesinghe meets Chinese President Xi Jinping",
      "20.10.2023",
      "https://mfa.gov.lk/en/president-wickremesinghe-meets-chinese-president-xi-jinping/",
      "President Xi Jinping of China affirmed China's commitment to supporting Sri Lanka's economic stability without political motives during a meeting with President Wickremesinghe. The Chinese President emphasized their dedication to assisting Sri Lanka's economic development.",
      "Ministry News"
    ],
    [
      "A meeting between SL President and the Chinese Vice PM",
      "19.10.2023",
      "https://mfa.gov.lk/en/a-meeting-between-sl-president-and-the-chinese-vice-pm/",
      "During a meeting between the Sri Lankan President and the Chinese Vice Premier, Ding Xuexiang expressed gratitude for Sri Lanka's support under the historic Rubber-Rice Agreement with China. He highlighted the importance of the strong bilateral relationship between the two countries.",
      "Ministry News"
    ],
    [
      "Launching a Special Initiative to Strengthen Climate Resilience in Tropical Nations",
      "18.10.2023",
      "https://mfa.gov.lk/en/launching-a-special-initiative-to-strengthen-climate-resilience-in-tropical-nations/",
      "President Ranil Wickremesinghe highlighted the importance of addressing climate resilience in tropical nations during the \"Green Silk Road for Harmony with Nature\" high-level conference. He emphasized that tropical regions are home to the world's most biodiverse ecosystems, prompting the launch of a special initiative to strengthen their resilience.",
      "Ministry News"
    ],
    [
      "Leaders of Vietnam and Sri Lanka hold bilateral discussions",
      "18.10.2023",
      "https://mfa.gov.lk/en/leaders-of-vietnam-and-sri-lanka-hold-bilateral-discussions/",
      "Vietnamese President Vo Van Thuong affirmed Vietnam's commitment to strengthening cultural ties with Sri Lanka during bilateral discussions with Sri Lankan leaders. He expressed Vietnam's readiness to act as a bridge between the two nations, fostering closer cooperation and understanding.",
      "Ministry News"
    ],
    [
      "Meeting between President of Sri Lanka and Prime Minister of Pakistan",
      "18.10.2023",
      "https://mfa.gov.lk/en/meeting-president-sl-pakistan-pm/",
      "The President of Sri Lanka held a bilateral meeting with Prime Minister of Pakistan, Anwaar-ul-Haq Kakar, on 17 October 2023 during the Third Belt and Road Forum for International Cooperation in Beijing. The meeting aimed to strengthen ties between the two countries.",
      "Ministry News"
    ],
    [
      "President meets Indonesian President during visit to China",
      "18.10.2023",
      "https://mfa.gov.lk/en/president-meets-indonesian-president-during-visit-to-china/",
      "During his visit to China, President Ranil Wickremesinghe met with the Indonesian President to discuss enhancing Indian Ocean identity and bilateral cooperation. He emphasized the importance of strengthening political, economic, and cultural ties between Sri Lanka and Indonesia.",
      "Ministry News"
    ],
    [
      "The President participates in an investment, trade and tourism forum in China",
      "18.10.2023",
      "https://mfa.gov.lk/en/the-president-participates-in-an-investment-trade-and-tourism-forum-in-china/",
      "President Ranil Wickremesinghe participated in a significant investment, trade, and tourism forum during his official four-day visit to China. The forum aimed to enhance future business opportunities and strengthen economic ties between the two countries.",
      "Ministry News"
    ],
    [
      "Malaysian Foreign Minister concludes a successful visit to Sri Lanka",
      "16.10.2023",
      "https://mfa.gov.lk/en/malaysian-fm-visit-sl/",
      "Malaysian Foreign Minister Dato’ Seri Diraja Dr. Zambry Abd Kadir successfully concluded his official visit to Sri Lanka from 08 – 12 October 2023. During the visit, he engaged in official discussions and meetings with Sri Lankan officials.",
      "Ministry News"
    ],
    [
      "​Sri Lanka assumes the Chair of the Indian Ocean Rim Association (IORA) at the 23rd Council of Ministers in Colombo",
      "11.10.2023",
      "https://mfa.gov.lk/en/sl-assumes-the-chair-223rd-iora/",
      "Sri Lanka took over the chairmanship of the Indian Ocean Rim Association (IORA) at the 23rd Council of Ministers in Colombo on October 11, 2023. The meeting was chaired by Foreign Minister Ali Sabry. Sri Lanka will lead the IORA in its upcoming initiatives and collaborations.",
      "Ministry News"
    ],
    [
      "Welcome Statement- M.U.M Ali Sabry PC, Minister of Foreign Affairs, Sri Lanka  23rd Meeting of the IORA Council of Ministers, Colombo",
      "11.10.2023",
      "https://mfa.gov.lk/en/welcome-statement-fm-sl-23rd-iora/",
      "At the 23rd Meeting of the IORA Council of Ministers in Colombo, M.U.M Ali Sabry PC, Minister of Foreign Affairs of Sri Lanka, greeted attendees with a warm welcome. He addressed Excellencies, Honourable Ministers, State Ministers, Heads of Delegations, the Secretary General of IORA, distinguished invitees, and all present, wishing them a pleasant morning.",
      "Ministry News"
    ],
    [
      "Indian Ocean Rim Association’s 25th Committee of Senior Officials (CSO) Meeting concludes in Colombo",
      "10.10.2023",
      "https://mfa.gov.lk/en/iora-25th-cso-meeting-colombo/",
      "The 25th Committee of Senior Officials Meeting of the Indian Ocean Rim Association (IORA) concluded in Colombo, where officials from member states convened. The two-day meeting, chaired from 9-10 October 2023, aimed to discuss regional cooperation and initiatives within the IORA framework.",
      "Ministry News"
    ],
    [
      "Sri Lanka Deeply Concerned about Attacks and Escalation of Violence in Israel and Palestine",
      "08.10.2023",
      "https://mfa.gov.lk/en/sl-concerned-israel-and-palestine/",
      "Sri Lanka expresses deep concern over the attacks and escalating violence in Israel and Palestine, leading to loss of life. Sri Lanka urges an immediate halt to the violence and calls on all parties to exercise restraint.",
      "Ministry News"
    ],
    [
      "Malaysian Foreign Minister Dato’ Seri Diraja Dr. Zambry Abd Kadir to visit Sri Lanka",
      "06.10.2023",
      "https://mfa.gov.lk/en/malaysian-fm-to-visit-sl/",
      "Malaysian Foreign Minister Dato’ Seri Diraja Dr. Zambry Abd Kadir is set to visit Sri Lanka from 08 to 12 October 2023 on an official trip. The visit aims to strengthen diplomatic ties between Malaysia and Sri Lanka.",
      "Ministry News"
    ],
    [
      "Sri Lanka to take over Chair of Indian Ocean Rim Association. Ministers meet in Colombo next week",
      "05.10.2023",
      "https://mfa.gov.lk/en/sl-take-over-iora-ministers-meet/",
      "Sri Lanka will assume the Chair of the Indian Ocean Rim Association, with ministers meeting in Colombo next week for the 23rd IORA Council of Ministers. Foreign Affairs ministers from IORA Member States and Dialogue Partners will attend the meeting.",
      "Ministry News"
    ],
    [
      "Foreign Secretary Aruni Wijewardane meets State Secretary Thomas Bagger of the Federal Foreign Office of Germany",
      "04.10.2023",
      "https://mfa.gov.lk/en/fs-meets-ss-federal-foreign-office-germany/",
      "Foreign Secretary Aruni Wijewardane met with State Secretary Thomas Bagger of the Federal Foreign Office of Germany at the Federal Foreign Office in Berlin on 27 September 2023. The meeting aimed to discuss bilateral relations and cooperation between the two countries.",
      "Ministry News"
    ],
    [
      "President Ranil Wickremesinghe holds talks with German Foundations Friedrich Naumann Foundation and Friedrich Ebert Foundation",
      "02.10.2023",
      "https://mfa.gov.lk/en/president-fnf-fef/",
      "During his working visit to Berlin from 27-30 September 2023, President Ranil Wickremesinghe held talks with the leadership of the Friedrich Naumann Foundation (FNF) and Friedrich Ebert Foundation (FEF). The discussions aimed to strengthen cooperation between Sri Lanka and the German foundations.",
      "Ministry News"
    ],
    [
      "President holds Bilateral Talks with German Chancellor during Working Visit to Germany",
      "29.09.2023",
      "https://mfa.gov.lk/en/president-holds-bilateral-talks-with-german-chancellor/",
      "President Ranil Wickremesinghe engaged in bilateral talks with German Chancellor Olaf Scholz in Berlin on Thursday (28) during his official visit to participate in the 'Berlin Global Dialogue'. The President was accompanied by his delegation during the meeting.",
      "Ministry News"
    ],
    [
      "“A Comprehensive International Dialogue Essential to Address Global Challenges in 2024″",
      "28.09.2023",
      "https://mfa.gov.lk/en/global-challenges-in-2024/",
      "President Ranil Wickremesinghe emphasized the importance of a comprehensive international dialogue to address global challenges in 2024 during the opening speech at the Head of State Dialogue in the Berlin Global Conference.",
      "Ministry News"
    ],
    [
      "President Ranil Wickremesinghe Embarks on High-Level Visit to Germany",
      "27.09.2023",
      "https://mfa.gov.lk/en/president-ranil-wickremesinghe-embarks-on-high-level-visit-to-germany/",
      "President Ranil Wickremesinghe departed for Germany today to take part in the Leaders Dialogue session, the opening event of the 'Berlin Global Dialogue.' This visit signifies his engagement in high-level discussions and diplomatic exchanges.",
      "Ministry News"
    ],
    [
      "High-level plenary meeting to commemorate and promote the   International Day for the Total Elimination of Nuclear Weapons  26 September 2023  United Nations Headquarters, New York",
      "27.09.2023",
      "https://mfa.gov.lk/en/high-level-plenary-meeting/",
      "A high-level plenary meeting will be held at the United Nations Headquarters in New York on 26 September 2023 to commemorate and promote the International Day for the Total Elimination of Nuclear Weapons. The meeting aims to address the issue of nuclear disarmament, emphasizing the importance of eliminating nuclear weapons for global peace and security.",
      "Ministry News"
    ],
    [
      "​Statement by Hon. Ali Sabry, Minister of Foreign Affairs of Sri Lanka  Ministerial Meeting of the Summit of the Future  21 September 2023",
      "24.09.2023",
      "https://mfa.gov.lk/en/summit-of-the-future-statement-fmsl/",
      "During the Ministerial Meeting of the Summit of the Future on September 21, 2023, Hon. Ali Sabry, Minister of Foreign Affairs of Sri Lanka, emphasized the significance of the event as a unique opportunity for Member States. He highlighted the forum's potential for collaboration and progress towards shared goals.",
      "Ministry News"
    ],
    [
      "47th Annual Meeting of Ministers for Foreign Affairs of the Group of 77  “A path for the reform of the international financial architecture: towards a new and inclusive global economic order” Statement by Hon Ali Sabry, Minister of Foreign Affairs  22 September 2023",
      "23.09.2023",
      "https://mfa.gov.lk/en/geo/",
      "At the 47th Annual Meeting of Ministers for Foreign Affairs of the Group of 77, Hon Ali Sabry, Minister of Foreign Affairs of Sri Lanka, addressed the theme of reforming the international financial architecture for a more inclusive global economic order on 22 September 2023. Sabry, a founding member of the Group of 77, emphasized the importance of this annual forum in his statement to the Chairperson, Excellencies, and Distinguished Delegates.",
      "Ministry News"
    ],
    [
      "Statement by the Foreign Minister at the Press Briefing on the Art. XIV Conference on Facilitating Entry into Force of the CTBT, New York, 21 September 2023",
      "22.09.2023",
      "https://mfa.gov.lk/en/statement-fmsl-ctbt-new-york/",
      "Foreign Minister addressed the Press Briefing ahead of the Article XIV Conference on the CTBT in New York on September 21, 2023. The Minister represented a country that ratified the treaty, emphasizing the importance of facilitating its entry into force.",
      "Ministry News"
    ],
    [
      "Sri Lanka Ratifies Comprehensive Nuclear Test Ban Treaty (CTBT) and Expresses Commitment to Nuclear Non-Proliferation",
      "22.09.2023",
      "https://mfa.gov.lk/en/sri-lanka-ratifies-comprehensive-nuclear-test-ban-treaty-ctbt-and-expresses-commitment-to-nuclear-non-proliferation/",
      "Sri Lanka recently ratified the Comprehensive Nuclear Test Ban Treaty (CTBT) and expressed its dedication to nuclear non-proliferation during a press briefing at the EU Article 14 Conference. The country reaffirmed its unwavering commitment to nuclear disarmament, signaling its support for global efforts in this regard.",
      "Ministry News"
    ],
    [
      "President Ranil Wickremesinghe’s Address at the UNGA: Sri Lanka’s Journey to Rebuild Trust and Global Solidarity",
      "22.09.2023",
      "https://mfa.gov.lk/en/president-ranil-wickremesinghes-address-at-the-unga-sri-lankas-journey-to-rebuild-trust-and-global-solidarity/",
      "President Ranil Wickremesinghe addressed the UN General Assembly in New York on September 21, focusing on Sri Lanka's efforts to rebuild trust and global solidarity. He highlighted challenges, achievements, and the country's commitment to sustainable development and climate action. Wickremesinghe's speech emphasized the importance of fostering international cooperation for a better future.",
      "Ministry News"
    ],
    [
      "President Wickremesinghe meets US President Joe Biden in New York",
      "22.09.2023",
      "https://mfa.gov.lk/en/president-wickremesinghe-meets-us-president-joe-biden-in-new-york/",
      "President Ranil Wickremesinghe met with US President Joe Biden in New York yesterday. The two leaders engaged in a cordial meeting during a lavish dinner hosted by President Biden.",
      "Ministry News"
    ],
    [
      "Malaysian King extends state visit invitation to Sri Lanka’s President, scheduled for early 2024",
      "21.09.2023",
      "https://mfa.gov.lk/en/malaysian-king-extends-state-visit-invitation-to-sri-lankas-president-scheduled-for-early-2024/",
      "Malaysia's King has invited Sri Lanka's President, Ranil Wickremesinghe, for a state visit scheduled for early 2024, marking a significant diplomatic gesture. The formal invitation aims to strengthen bilateral ties between the two countries.",
      "Ministry News"
    ],
    [
      "​Foreign Minister Sabry participates in the​ 18th Ministerial Meeting of the Asia Cooperation Dialogue",
      "21.09.2023",
      "https://mfa.gov.lk/en/fm-sl-participates-18th-acd/",
      "Foreign Minister Ali Sabry attended the 18th Ministerial Meeting of the Asia Cooperation Dialogue (ACD) yesterday, held on the sidelines of the 78th session of the United Nations General Assembly.",
      "Ministry News"
    ],
    [
      "Foreign Minister Sabry addresses High-Level Meeting on Pandemic Prevention, Preparedness and Response",
      "21.09.2023",
      "https://mfa.gov.lk/en/fm-sl-addresses-on-ppr/",
      "Foreign Minister Ali Sabry addressed the High-Level Meeting on Pandemic Prevention, Preparedness, and Response during the 78th session of the United Nations General Assembly in New York on September 20.",
      "Ministry News"
    ],
    [
      "IMF MD Kristalina Georgieva Commends Sri Lanka’s Economic Progress in Meeting with President Wickremesinghe at UNGA",
      "21.09.2023",
      "https://mfa.gov.lk/en/imf-md-kristalina-georgieva-commends-sri-lankas-economic-progress-in-meeting-with-president-wickremesinghe-at-unga/",
      "IMF Managing Director Kristalina Georgieva praised Sri Lanka's economic progress in a meeting with President Wickremesinghe at the UNGA. Discussions centered on financial reforms and debt restructuring, highlighting the importance of ongoing economic initiatives.",
      "Ministry News"
    ],
    [
      "Productive Talks with Secretary General Patricia Scotland Emphasize Commitment to Climate Financing and Diaspora Engagement",
      "21.09.2023",
      "https://mfa.gov.lk/en/productive-talks-with-secretary-general-patricia-scotland-emphasize-commitment-to-climate-financing-and-diaspora-engagement/",
      "President Ranil Wickremesinghe leads climate change cooperation with the Commonwealth at UNGA, holding productive talks with Secretary General Patricia Scotland. The discussions highlight a shared commitment to climate financing and engaging the diaspora community, emphasizing the importance of collaboration in addressing global challenges.",
      "Ministry News"
    ],
    [
      "President Wickremesinghe Addresses Global Financial Distress and Calls for Solidarity at 2023 SDG Summit",
      "21.09.2023",
      "https://mfa.gov.lk/en/president-wickremesinghe-addresses-global-financial-distress-and-calls-for-solidarity-at-2023-sdg-summit/",
      "President Ranil Wickremesinghe addressed global financial distress and emphasized the need for solidarity at the 2023 SDG Summit. He highlighted the challenges faced by middle-income countries in his significant address at the High-level Dialogue on Financing for Development during the 78th session of the General Assembly.",
      "Ministry News"
    ],
    [
      "President Ranil Wickremesinghe Pledges Sri Lanka’s Dual Approach to Climate Ambition at UN Climate Summit",
      "21.09.2023",
      "https://mfa.gov.lk/en/president-ranil-wickremesinghe-pledges-sri-lankas-dual-approach-to-climate-ambition-at-un-climate-summit/",
      "President Ranil Wickremesinghe of Sri Lanka announced the country's dual approach to climate ambition at the UN Climate Summit. This includes unveiling the Climate Prosperity Plan and establishing the Climate Justice Forum to address global climate challenges. Wickremesinghe made the announcement during the Climate Ambition Summit held on the sidelines of the UN General Assembly.",
      "Ministry News"
    ],
    [
      "President meets Iranian President on the side-lines of the UNGA",
      "21.09.2023",
      "https://mfa.gov.lk/en/president-meets-iranian-president-on-the-side-lines-of-the-unga/",
      "President Ranil Wickremesinghe met with Iranian President Ebrahim Raisi on the sidelines of the UNGA in New York on September 20. They discussed longstanding relations between their countries during the meeting.",
      "Ministry News"
    ],
    [
      "President claims current state of SDG advancement is globally unsatisfactory",
      "21.09.2023",
      "https://mfa.gov.lk/en/president-claims-current-state-of-sdg-advancement-is-globally-unsatisfactory/",
      "President Ranil Wickremesinghe, speaking at the SDG Summit 2023, expressed concern over the insufficient progress in advancing the Sustainable Development Goals globally. He questioned the feasibility of achieving the SDGs amidst the challenges posed by the pandemic fallout and resource scarcity.",
      "Ministry News"
    ],
    [
      "Foreign Minister Sabry participates ​i​n the Global Development Initiative (GDI) high-level meeting",
      "20.09.2023",
      "https://mfa.gov.lk/en/fm-sl-participates-gdi/",
      "Foreign Minister Ali Sabry took part in the Global Development Initiative (GDI) Cooperation Outcomes high-level meeting in New York on September 19, 2023, during the 78th session of the United Nations.",
      "Ministry News"
    ],
    [
      "Sri Lanka accedes to the Treaty on the Prohibition of Nuclear Weapons (TPNW)",
      "20.09.2023",
      "https://mfa.gov.lk/en/sl-accedes-to-the-tpnw/",
      "Sri Lanka's Minister of Foreign Affairs, Ali Sabry, officially acceded to the Treaty on the Prohibition of Nuclear Weapons (TPNW) on 19 September 2023. The Instrument of Accession was deposited during a high-level ceremony at the UN Headquarters in New York.",
      "Ministry News"
    ],
    [
      "President meets Prime Minister Pushpa Kamal Dahal of Nepal in New York",
      "20.09.2023",
      "https://mfa.gov.lk/en/president-meets-prime-minister-pushpa-kamal-dahal-of-nepal-in-new-york/",
      "President Ranil Wickremesinghe met with Prime Minister Pushpa Kamal Dahal of Nepal in New York on the sidelines of the 78th United Nations General Assembly. The meeting took place yesterday (19) and provided an opportunity for discussions between the two leaders.",
      "Ministry News"
    ],
    [
      "President and USAID Administrator Samantha Power Forge Strong Alliance at UNGA",
      "20.09.2023",
      "https://mfa.gov.lk/en/president-and-usaid-administrator-samantha-power-forge-strong-alliance-at-unga/",
      "President Ranil Wickremesinghe and USAID Administrator Samantha Power forged a strong alliance at the UNGA in New York. The President expressed his appreciation for the support extended by USAID during their discussions.",
      "Ministry News"
    ],
    [
      "President Expresses Gratitude and Discusses Possible Visit to Bangladesh in Meeting with Bangladesh PM Sheikh Hasina",
      "20.09.2023",
      "https://mfa.gov.lk/en/president-expresses-gratitude-and-discusses-possible-visit-to-bangladesh-in-meeting-with-bangladesh-pm-sheikh-hasina/",
      "President Ranil Wickremesinghe expressed gratitude and discussed a possible visit to Bangladesh in a meeting with Prime Minister Sheikh Hasina in New York on September 19. The meeting focused on various diplomatic matters, strengthening ties between the two countries. President Wickremesinghe is considering a visit to Bangladesh in the near future.",
      "Ministry News"
    ],
    [
      "President joins the Conference on Sustainable Development Goals",
      "19.09.2023",
      "https://mfa.gov.lk/en/president-joins-the-conference-on-sustainable-development-goals/",
      "President Ranil Wickremesinghe participated in the Business Roundtable during the 78th session of the United Nations General Assembly, focusing on Sustainable Development Goals.",
      "Ministry News"
    ],
    [
      "Sri Lanka and World Bank Discuss Economic Reforms and Collaborations",
      "19.09.2023",
      "https://mfa.gov.lk/en/sri-lanka-and-world-bank-discuss-economic-reforms-and-collaborations/",
      "Sri Lanka's President Ranil Wickremesinghe led a delegation in discussions with World Bank President Ajay Banga and other officials at the World Bank Headquarters in New York. The talks focused on economic reforms and potential collaborations between Sri Lanka and the World Bank.",
      "Ministry News"
    ],
    [
      "South Korea pledges its support for Sri Lanka’s economic recovery",
      "19.09.2023",
      "https://mfa.gov.lk/en/south-korea-pledges-its-support-for-sri-lankas-economic-recovery/",
      "South Korea has pledged support for Sri Lanka's economic recovery by focusing on expanding investment and trade ties. The agreement aims to increase employment opportunities for Sri Lankan youth in South Korea in the near future, strengthening bilateral relations between the two countries.",
      "Ministry News"
    ],
    [
      "Address by HE Ranil Wickremesinghe – President of Sri Lanka at the Summit of the Heads of State and Government of the G77 & China on Current Development Challenges: The Role of Science, Technology and Innovation -on 15 September 2023 in Havana, Cuba",
      "16.09.2023",
      "https://mfa.gov.lk/en/address-by-he-ranil-wickremesinghe-president-of-sri-lanka-at-the-summit-of-the-heads-of-state-and-government-of-the-g77-china-on-current-development-challenges-the-role-of-science-technology-and/",
      "President Ranil Wickremesinghe of Sri Lanka addressed the Summit of the Heads of State and Government of the G77 & China in Havana, Cuba on September 15, 2023. He praised Cuba for championing the concerns of developing nations in multilateral forums and emphasized the role of science, technology, and innovation in addressing current development challenges.",
      "Ministry News"
    ],
    [
      "President Ranil Wickremesinghe Addresses G77 & China Summit in Cuba",
      "16.09.2023",
      "https://mfa.gov.lk/en/president-ranil-wickremesinghe-addresses-g77-china-summit-in-cuba/",
      "President Ranil Wickremesinghe addressed the G77 & China Summit in Cuba, emphasizing the importance of science, technology, and innovation in tackling global development challenges. His compelling speech highlighted the role of these factors in addressing pressing issues faced by nations worldwide.",
      "Ministry News"
    ],
    [
      "Cuban and Sri Lankan Presidents Forge Stronger Ties and Mutual Support through Bilateral Talks",
      "16.09.2023",
      "https://mfa.gov.lk/en/cuban-and-sri-lankan-presidents-forge-stronger-ties-and-mutual-support-through-bilateral-talks/",
      "During an official visit to Cuba, Sri Lankan President Ranil Wickremesinghe strengthened ties and mutual support through bilateral talks with Cuban President. The visit preceded his participation in the G77 plus China Summit in Havana, hosted by Cuba as the current Chair of the G77 plus China. This visit aimed to enhance cooperation between the two nations.",
      "Ministry News"
    ],
    [
      "Sri Lanka to assume the Chairmanship of the Indian Ocean Rim Association (IORA), 2023 – 2025",
      "06.09.2023",
      "https://mfa.gov.lk/en/iora-2023-2025/",
      "Sri Lanka is set to assume the Chairmanship of the Indian Ocean Rim Association (IORA) from 2023 to 2025. The official handover will take place at the 23rd Council of Ministers’ Meeting in Colombo on October 11, 2023.",
      "Ministry News"
    ],
    [
      "Foreign Minister and Minister of Justice brief the Diplomatic Corps on the draft Anti-Terrorism Bill",
      "01.09.2023",
      "https://mfa.gov.lk/en/diplomatic-corps-briefing/",
      "The Foreign Minister and Minister of Justice briefed the Diplomatic Corps at the Ministry of Foreign Affairs in Colombo on the draft Anti-Terrorism Bill on September 1, 2023. The briefing provided updates on current developments related to the bill.",
      "Ministry News"
    ],
    [
      "Ministry of Foreign Affairs introduces digital platform to follow up Treaties and MoUs",
      "01.09.2023",
      "https://mfa.gov.lk/en/mfa-introduces-digital-platform/",
      "The Ministry of Foreign Affairs has launched a digital platform to manage and monitor bilateral and multilateral Treaties, Agreements, and Memoranda of Understanding. This platform aims to streamline the coordination of ongoing and upcoming international agreements effectively.",
      "Ministry News"
    ],
    [
      "Foreign Secretaries of Sri Lanka and Thailand successfully conclude Bilateral Political Consultations",
      "28.08.2023",
      "https://mfa.gov.lk/en/thailand/",
      "The 5th Round of Sri Lanka-Thailand Bilateral Political Consultations successfully concluded on August 28, 2023, at the Ministry of Foreign Affairs in Colombo. The Sri Lankan delegation, led by the Secretary of the Ministry of Foreign Affairs, engaged in productive discussions with their Thai counterparts, strengthening diplomatic ties between the two countries.",
      "Ministry News"
    ],
    [
      "Sri Lanka and Thailand to hold 5th Round of Bilateral Political Consultations in Colombo",
      "25.08.2023",
      "https://mfa.gov.lk/en/sl-thailand-5th-bilateral-political-consultations/",
      "Sri Lanka and Thailand are set to conduct their 5th Round of Bilateral Political Consultations on August 28, 2023, at the Ministry of Foreign Affairs in Colombo. The consultations will be co-chaired by the Foreign Secretary of both countries.",
      "Ministry News"
    ],
    [
      "Appointment of Ambassador of the Federal Republic of Germany to Sri Lanka",
      "23.08.2023",
      "https://mfa.gov.lk/en/ambassador-of-the-germany-sl/",
      "The Government of the Federal Republic of Germany, with the agreement of the Government of Sri Lanka, has appointed Dr. Felix Neumann as the new Ambassador Extraordinary and Plenipotentiary to Sri Lanka. Dr. Neumann will represent Germany in his diplomatic role in Sri Lanka.",
      "Ministry News"
    ],
    [
      "Appointment of High Commissioner of the United Kingdom of Great Britain and Northern Ireland to Sri Lanka",
      "23.08.2023",
      "https://mfa.gov.lk/en/high-commissioner-of-uk/",
      "The Government of the United Kingdom, in agreement with Sri Lanka, has appointed Mr. Andrew Patrick as the new High Commissioner of the UK to Sri Lanka.",
      "Ministry News"
    ],
    [
      "Appointment of Ambassador of the Republic of Italy to Sri Lanka",
      "23.08.2023",
      "https://mfa.gov.lk/en/ambassador-of-italy-sl/",
      "The Government of Italy, in agreement with Sri Lanka, has appointed Mr. Damiano Francovigh as the new Ambassador Extraordinary and Plenipotentiary of Italy to Sri Lanka.",
      "Ministry News"
    ],
    [
      "President Embarks on a Two-Day Official Visit to Singapore",
      "21.08.2023",
      "https://mfa.gov.lk/en/president-embarks-on-a-two-day-official-visit-to-singapore/",
      "President Ranil Wickremesinghe is scheduled to depart for a two-day official visit to Singapore tomorrow morning. During the visit, he will meet with Singaporean officials to discuss bilateral relations and cooperation.",
      "Ministry News"
    ],
    [
      "Foreign Minister Sabry briefs Diplomatic Corps on Current Developments in Sri Lanka",
      "17.08.2023",
      "https://mfa.gov.lk/en/fm-sl-breifs-diplomatic-corps/",
      "Foreign Minister Ali Sabry briefed the Colombo-based diplomatic corps on current developments in Sri Lanka on August 16, 2023. The briefing also included Foreign Secretary Aruni Wijewardane.",
      "Ministry News"
    ],
    [
      "Sri Lankan Workers involved in Accident in Istanbul Treated and Recovering",
      "12.08.2023",
      "https://mfa.gov.lk/en/sl-workers-accident-in-istanbul-treated-recovering/",
      "Sri Lankan workers involved in an accident in Istanbul on August 9, 2023, while being transported from their worksite to accommodation are now being treated and are in recovery. The workers were in Istanbul, Turkey, and the accident occurred as they were traveling within the same vicinity.",
      "Ministry News"
    ],
    [
      "Foreign Minister Ali Sabry concludes successful visit to Iran",
      "10.08.2023",
      "https://mfa.gov.lk/en/fm-sl-concludes-visit-to-iran/",
      "Sri Lankan Foreign Minister Ali Sabry successfully concluded his official visit to Iran from August 4 to 7, 2023, upon an invitation from the Iranian Foreign Minister.",
      "Ministry News"
    ],
    [
      "Foreign Minister Ali Sabry to visit Iran",
      "03.08.2023",
      "https://mfa.gov.lk/en/fm-ali-sabry-to-visit-iran/",
      "Foreign Minister Ali Sabry will visit Iran from August 4 to 7, 2023, following an invitation from Iranian Foreign Affairs Minister Dr. Hossei.",
      "Ministry News"
    ],
    [
      "Japanese Foreign Minister HAYASHI leads a high-level delegation to Sri Lanka",
      "29.07.2023",
      "https://mfa.gov.lk/en/japanese-fm-leads-a-high-level-delegation-sl/",
      "Japanese Foreign Minister HAYASHI Yoshimasa led a high-level delegation to Sri Lanka on an official visit from July 28-29, 2023. During the visit, Minister of Foreign Affairs Ali Sabry engaged in a comprehensive bilateral discussion with Minister HAYASHI, strengthening ties between the two countries.",
      "Ministry News"
    ],
    [
      "French President Pledges Strong Support for Debt Restructuring and Bolsters Bilateral Relations during Historic Visit to Sri Lanka",
      "29.07.2023",
      "https://mfa.gov.lk/en/french-president-pledges-strong-support-for-debt-restructuring-and-bolsters-bilateral-relations-during-historic-visit-to-sri-lanka/",
      "French President Emmanuel Macron made a historic visit to Sri Lanka on the 28th, the first by a French President to the country. During the visit, Macron pledged strong support for debt restructuring and strengthened bilateral relations.",
      "Ministry News"
    ],
    [
      "Sri Lanka donates a consignment of Ceylon Tea to the civilians affected by the Cyclone MOCHA in Myanmar",
      "27.07.2023",
      "https://mfa.gov.lk/en/sl_do_myanmar/",
      "Sri Lanka donated 1 metric ton of Ceylon Tea to civilians affected by Cyclone MOCHA in Myanmar. The donation was handed over by the Sri Lankan government at an event organized by the Ministry of Foreign Affairs.",
      "Ministry News"
    ],
    [
      "French President Emmanuel Macron to undertake a visit to Sri Lanka",
      "27.07.2023",
      "https://mfa.gov.lk/en/french_president/",
      "French President Emmanuel Macron will visit Sri Lanka on 28 July 2023, marking the first-ever visit by a French President to the country. This historic visit follows his trip to the South Pacific region.",
      "Ministry News"
    ],
    [
      "Japanese Foreign Minister HAYASHI to visit Sri Lanka",
      "26.07.2023",
      "https://mfa.gov.lk/en/japanese-fm-hayashi-to-visit-sl/",
      "Japanese Foreign Minister Yoshimasa Hayashi will visit Sri Lanka on July 28-29, 2023, for official discussions.",
      "Ministry News"
    ],
    [
      "Sri Lanka ratifies Comprehensive Nuclear Test-Ban Treaty (CTBT)",
      "26.07.2023",
      "https://mfa.gov.lk/en/sl-ratifies-ctbt/",
      "Sri Lanka ratified the Comprehensive Nuclear Test-Ban Treaty (CTBT) by depositing the instrument of ratification with the UN Office of Legal Affairs on 25 July 2023 at the UN Headquarters in New York. With this action, Sri Lanka became the 178th State to ratify the CTBT, demonstrating its commitment to nuclear non-proliferation.",
      "Ministry News"
    ],
    [
      "Sri Lanka rejects the reference to Tamil Genocide Remembrance Day by the Canadian Prime Minister",
      "25.07.2023",
      "https://mfa.gov.lk/en/sl-rejects-tamil-genocide-remembrance-day-by-canadian-pm/",
      "Sri Lanka's Ministry of Foreign Affairs has rejected Canadian Prime Minister Justin Trudeau's reference to a Tamil Genocide Remembrance Day in a statement issued on July 23, 2023. Sri Lanka opposes Canada's continued use of this term.",
      "Ministry News"
    ],
    [
      "The President expects to gain maximum benefits from the development spaces in the Indian Ocean region – Foreign Minister Ali Sabry",
      "22.07.2023",
      "https://mfa.gov.lk/en/the-president-expects-to-gain-maximum-benefits/",
      "Foreign Minister Ali Sabry stated that President Ranil Wickremesinghe aims to maximize the benefits of development opportunities in the Indian Ocean region, known as the world's largest emerging economic region.",
      "Ministry News"
    ],
    [
      "Promoting Connectivity, Catalysing Prosperity: India-Sri Lanka Economic Partnership Vision",
      "21.07.2023",
      "https://mfa.gov.lk/en/india-sri-lanka-economic-partnership-vision/",
      "Indian Prime Minister Narendra Modi and Sri Lankan President Ranil Wickremesinghe held productive discussions in New Delhi on July 21, 2023, focusing on enhancing economic partnership. The leaders emphasized the importance of promoting connectivity to drive prosperity in both countries.",
      "Ministry News"
    ],
    [
      "Statement to the Media by President Ranil Wickremesinghe during the official visit to India, 21 July 2023",
      "21.07.2023",
      "https://mfa.gov.lk/en/statement-president-official-visit-to-india/",
      "During his official visit to India on 21 July 2023, President Ranil Wickremesinghe expressed his gratitude for the invitation from Prime Minister Narendra Modi. He highlighted the significance of his first visit to New Delhi and emphasized the importance of the bilateral relationship between the two countries.",
      "Ministry News"
    ],
    [
      "Sri Lanka and Egypt successfully conclude bilateral consultations",
      "21.07.2023",
      "https://mfa.gov.lk/en/sl-egypt-conclude-bilateral-consultations/",
      "Sri Lanka and Egypt successfully concluded their second session of bilateral consultations in Colombo on 19 July 2023. The consultations were co-chaired by the State Minister of Foreign Affairs, fostering diplomatic relations between the two countries.",
      "Ministry News"
    ],
    [
      "President Ranil Wickremesinghe to undertake official visit to India",
      "18.07.2023",
      "https://mfa.gov.lk/en/president-to-undertake-official-visit-to-india/",
      "President Ranil Wickremesinghe is set to undertake an official visit to India on 20-21 July 2023 at the invitation of Prime Minister Narendra Modi. The visit coincides with the 75th anniversary celebrations of both countries.",
      "Ministry News"
    ],
    [
      "Foreign Office Bilateral Consultations, Strategic Maritime Dialogue and Trade & Investment Committee Meeting between Australia and Sri Lanka concludes successfully in Colombo",
      "15.07.2023",
      "https://mfa.gov.lk/en/sl-australia-bilateral-meeting/",
      "The 4th Round of Foreign Office Bilateral Consultations, Second Strategic Maritime Dialogue, and Third Joint Trade and Investment Committee Meeting between Australia and Sri Lanka successfully concluded in Colombo on July 12, 2023. The meetings aimed to strengthen diplomatic ties, enhance maritime cooperation, and boost trade and investment relations between the two countries.",
      "Ministry News"
    ],
    [
      "Foreign Minister leads Sri Lanka Delegation to 30th ASEAN Regional Forum",
      "15.07.2023",
      "https://mfa.gov.lk/en/fmsl-leads-30th-asean-regional-forum/",
      "Foreign Minister M.U.M. Ali Sabry led the Sri Lanka delegation to the 30th ASEAN Regional Forum (ARF) Ministerial Meeting in Jakarta, Indonesia on July 14, 2023. The ARF is a key platform for dialogue and cooperation in the Asia-Pacific region.",
      "Ministry News"
    ],
    [
      "​Foreign Minister to attend the 30th ASEAN Regional Forum (ARF)​ ​in Jakarta, Indonesia",
      "12.07.2023",
      "https://mfa.gov.lk/en/smsl-to-attend-30th-asean-arf/",
      "Foreign Minister M.U.M. Ali Sabry will attend the 30th ASEAN Regional Forum (ARF) Ministerial Meeting in Jakarta, Indonesia on July 14, 2023. The ARF is a significant event in the Asia-Pacific region where regional security issues are discussed and addressed.",
      "Ministry News"
    ],
    [
      "Foreign Secretary Aruni Wijewardane met her Indian counterpart Vinay Kwatra",
      "11.07.2023",
      "https://mfa.gov.lk/en/fs-sl-met-her-indian-counterpart/",
      "Foreign Secretary Aruni Wijewardane met with her Indian counterpart Vinay Kwatra at the Ministry of Foreign Affairs this morning. Vinay Kwatra is currently visiting Sri Lanka. The meeting aimed to discuss bilateral relations between the two countries.",
      "Ministry News"
    ],
    [
      "State Minister of Foreign Affairs at the Ministerial Meeting of the Coordinating Bureau of the Non-Aligned Movement in Baku, Republic of Azerbaijan, 05-06 July 2023",
      "11.07.2023",
      "https://mfa.gov.lk/en/statement-smfa-sl-nam/",
      "State Minister of Foreign Affairs, H.E. Mr. Jeyhun Bayramov, represented Sri Lanka at the Ministerial Meeting of the Non-Aligned Movement in Baku, Azerbaijan on July 5-6, 2023. He congratulated the Republic of Azerbaijan on hosting the event and addressed the attendees.",
      "Ministry News"
    ],
    [
      "State Minister of Foreign Affairs re-affirms Sri Lanka’s commitment to collective actions to face common challenges at the NAM Ministerial Meeting in Azerbaijan",
      "08.07.2023",
      "https://mfa.gov.lk/en/smfa-sl-addressing-nam/",
      "State Minister of Foreign Affairs Tharaka Balasuriya reaffirmed Sri Lanka's commitment to collective actions to address common challenges at the NAM Ministerial Meeting in Azerbaijan. The meeting took place in Baku from 5-6 July 2023, where Balasuriya participated along with other NAM Ministers.",
      "Ministry News"
    ],
    [
      "Sri Lanka and Australia to hold Foreign Office Bilateral Consultations, Strategic Maritime Dialogue and Trade & Investment  Committee Meetings in Colombo",
      "07.07.2023",
      "https://mfa.gov.lk/en/sl-australia-to-hold-committee-meeting/",
      "Sri Lanka and Australia will conduct the 4th Round of Foreign Office Bilateral Consultations, Second Strategic Maritime Dialogue, and Third Joint Trade and Investment Committee Meeting in Colombo on July 11 and 12, 2023.",
      "Ministry News"
    ],
    [
      "The Ella Odyssey: 75 Years of Diplomacy",
      "07.07.2023",
      "https://mfa.gov.lk/en/ella-odyssey-75yrs-of-diplomacy/",
      "Foreign Heads of Mission are on a familiarization tour of Sri Lanka's Hill Country as part of The Ella Odyssey, celebrating 75 years of diplomacy. The tour is organized by the Ministry of Foreign Affairs in collaboration with the Presidential Secretariat and the Sri Lanka Tourism Promotion Bureau.",
      "Ministry News"
    ],
    [
      "Appointment of High Commissioner of the Republic of Seychelles to Sri Lanka",
      "01.07.2023",
      "https://mfa.gov.lk/en/hc-of-seychelles-to-sl/",
      "The Government of the Republic of Seychelles, with the approval of the Government of Sri Lanka, has appointed Ms. Lalatiana Accouche as the High Commissioner of the Republic of Seychelles to Sri Lanka. She will be based in New Delhi.",
      "Ministry News"
    ],
    [
      "Appointment of Ambassador of Hungary to Sri Lanka",
      "01.07.2023",
      "https://mfa.gov.lk/en/ambassador-of-hungary-to-sl/",
      "The Government of Hungary, with the approval of the Government of Sri Lanka, has appointed Mr. István Szabó as Hungary's Ambassador Extraordinary and Plenipotentiary to Sri Lanka. He will be based in New Delhi for his diplomatic duties.",
      "Ministry News"
    ],
    [
      "Appointment of Ambassador of the Republic of Korea to Sri Lanka",
      "01.07.2023",
      "https://mfa.gov.lk/en/ambassador-of-korea-to-sl/",
      "The Government of the Republic of Korea, with the approval of the Government of Sri Lanka, has appointed Ms. Lee Miyon as the new Ambassador Extraordinary and Plenipotentiary of the Republic of Korea to Sri Lanka. She will be based in Colombo.",
      "Ministry News"
    ],
    [
      "Appointment of Ambassador of the Republic of Peru to Sri Lanka",
      "01.07.2023",
      "https://mfa.gov.lk/en/ambassador-of-peru-to-sl/",
      "The Government of the Republic of Peru, in agreement with the Government of Sri Lanka, has appointed Mr. Javier Manuel Velarde as the new Ambassador Extraordinary and Plenipotentiary of Peru to Sri Lanka. Mr. Velarde will represent Peru in Sri Lanka in his diplomatic capacity.",
      "Ministry News"
    ],
    [
      "Appointment of Ambassador of the Syrian Arab Republic to Sri Lanka",
      "01.07.2023",
      "https://mfa.gov.lk/en/ambassador-of-syrian-arab-to-sl/",
      "The Government of the Syrian Arab Republic, with the agreement of the Government of Sri Lanka, has appointed Dr. (Mr.) Bassam Al-Khatib as the new Ambassador Extraordinary and Plenipotentiary of the Syrian Arab Republic to Sri Lanka.",
      "Ministry News"
    ],
    [
      "​Appointment of Ambassador of the Hellenic Republic of Greece to Sri Lanka",
      "01.07.2023",
      "https://mfa.gov.lk/en/ambassador-of-greece-to-sl/",
      "The Government of the Hellenic Republic, in agreement with the Government of Sri Lanka, has appointed Mr. Dimitrios Ioannou as the new Ambassador Extraordinary and Plenipotentiary of Greece to Sri Lanka. Mr. Ioannou will represent the Hellenic Republic in Sri Lanka in his diplomatic capacity.",
      "Ministry News"
    ],
    [
      "Appointment of High Commissioner of the Republic of Uganda to Sri Lanka",
      "01.07.2023",
      "https://mfa.gov.lk/en/high-commissioner-of-uganda-to-sl/",
      "The Government of the Republic of Uganda, with the agreement of the Government of Sri Lanka, has appointed Prof. (Ms.) Joyce K. Kikafunda as the High Commissioner of Uganda to Sri Lanka. She will be based in New Delhi.",
      "Ministry News"
    ],
    [
      "​​Appointment of Ambassador of the Kingdom of Belgium to Sri Lanka",
      "01.07.2023",
      "https://mfa.gov.lk/en/ambassador-kingdom-of-belgium-sl/",
      "The Government of the Kingdom of Belgium, with the approval of the Government of Sri Lanka, has named Mr. Didier Vanderhasselt as the new Ambassador Extraordinary and Plenipotentiary of Belgium to Sri Lanka.",
      "Ministry News"
    ],
    [
      "​​Appointment of Ambassador of the Republic of Panama to Sri Lanka",
      "01.07.2023",
      "https://mfa.gov.lk/en/ambassador-panama-to-sl/",
      "The Government of the Republic of Panama, with the concurrence of the Government of Sri Lanka, has appointed Mr. Alberto Salas De Leon as Ambassador Extraordinary and Plenipotentiary of the Republic of Panama to Sri Lanka. Mr. De Leon will represent Panama in Sri Lanka in his new diplomatic role.",
      "Ministry News"
    ],
    [
      "Appointment of High Commissioner of the Republic of Trinidad and Tobago to Sri Lanka",
      "01.07.2023",
      "https://mfa.gov.lk/en/hc-trinidad-tobago-to-sl/",
      "Dr. (Mr.) Roger Gopaul has been appointed as the High Commissioner of the Republic of Trinidad and Tobago to Sri Lanka with the concurrence of both governments.",
      "Ministry News"
    ],
    [
      "Foreign Minister Ali Sabry concludes successful visit to China",
      "01.07.2023",
      "https://mfa.gov.lk/en/fmsl-concludes-visit-china/",
      "Sri Lanka's Foreign Minister Ali Sabry successfully concluded his visit to China, which took place from June 24 to 30. The visit included bilateral discussions and participation in the World Eco event, at the invitation of Chinese State Councilor and Foreign Minister Qin Gang.",
      "Ministry News"
    ],
    [
      "Sri Lanka condemns the burning of Quran  outside a mosque in Stockholm",
      "30.06.2023",
      "https://mfa.gov.lk/en/sl-condemns-the-burning-of-quran/",
      "Sri Lanka has strongly condemned the burning of the Holy Quran outside a mosque in Stockholm during Eid al-Adha. The incident, seen as a violation of religious freedom, has sparked outrage among Muslims worldwide.",
      "Ministry News"
    ],
    [
      "Fifth round of Sri Lanka – Romania Political Consultations concludes successfully in Colombo, Sri Lanka",
      "30.06.2023",
      "https://mfa.gov.lk/en/15rpc/",
      "The Fifth Round of Sri Lanka – Romania Bilateral Political Consultations, co-chaired by State Minister of Foreign Affairs Tharaka Balasuriya and Romania’s State Secretary Traian Hristea, concluded successfully in Colombo, Sri Lanka.",
      "Ministry News"
    ],
    [
      "The second round of Sri Lanka – Georgia Political Consultations concludes successfully in Tbilisi, Georgia",
      "30.06.2023",
      "https://mfa.gov.lk/en/gpc/",
      "The second round of Bilateral Political Consultations between Sri Lanka and Georgia successfully concluded in Tbilisi on June 19, 2023. The Sri Lankan delegation, led by State Minister of Foreign Affairs Tharaka Balasuriya, participated in the event.",
      "Ministry News"
    ],
    [
      "The message of H.E Ranil Wickremesinghe, President of Sri Lanka on the occasion of Hajj",
      "29.06.2023",
      "https://mfa.gov.lk/en/presidents-hajj-message/",
      "President of Sri Lanka, H.E Ranil Wickremesinghe, delivered a message on the occasion of Hajj, emphasizing the significance of the pilgrimage. In his address, he highlighted the importance of unity, peace, and harmony among all communities.",
      "Ministry News"
    ],
    [
      "Sri Lanka elected to the UN Committee on Protection of the Rights of All Migrant Workers and Members of their Families (CMW)",
      "28.06.2023",
      "https://mfa.gov.lk/en/sl-un/",
      "Sri Lanka's candidate Ambassador Prasad Kariyawasam was successfully elected to the UN Committee on the Protection of the Rights of All Migrant Workers and Members of Their Families during the election held on June 27, 2023. This appointment reflects Sri Lanka's commitment to upholding the rights of migrant workers and their families on an international platform.",
      "Ministry News"
    ],
    [
      "President Ranil Wickremesinghe addresses the Summit for a New Global Financing Pact in Paris",
      "25.06.2023",
      "https://mfa.gov.lk/en/president-addresses-summit-for-a-new-global-financing-pact-in-paris/",
      "President Ranil Wickremesinghe addressed the Summit for a New Global Financing Pact in Paris, emphasizing Sri Lanka's expertise in debt restructuring. He highlighted the country's experience during a high-level panel at the World Leader’s Summit, showcasing insights on financial strategies.",
      "Ministry News"
    ],
    [
      "Foreign Minister Ali Sabry to participate in the World Economic Forum in China",
      "23.06.2023",
      "https://mfa.gov.lk/en/fmsl-participate-world-economic-forum/",
      "Foreign Minister Ali Sabry will lead a delegation to the World Economic Forum in Tianjin, China from 27 to 29 June 2023. The Forum's theme is 'Entrepreneurship: The Driving Force of the Global Economy.",
      "Ministry News"
    ],
    [
      "Foreign Ministry officials interviewed on Ada Derana Big Focus",
      "23.06.2023",
      "https://mfa.gov.lk/en/foreign-ministry-officials-interviewed-on-ada-derana-big-focus/",
      "Foreign Ministry officials were interviewed on Ada Derana Big Focus on June 21, 2023. The interview highlighted the various services offered by the Foreign Ministry, with a focus on consular assistance provided to the public.",
      "Ministry News"
    ],
    [
      "President of Sri Lanka Ranil Wickremesinghe arrives in Paris to address the Summit for a New Global Financing Pact",
      "22.06.2023",
      "https://mfa.gov.lk/en/president-arrives-in-paris/",
      "Sri Lankan President Ranil Wickremesinghe arrived in Paris on June 21, 2023, at the invitation of French President Emmanuel Macron to speak at the Summit for a New Global Financing Pact. Wickremesinghe's participation underscores the importance of global cooperation in financial matters.",
      "Ministry News"
    ],
    [
      "Sri Lanka – Poland economic and technical cooperation receives new direction at the third round of bilateral consultations in Warsaw",
      "21.06.2023",
      "https://mfa.gov.lk/en/sl-poland-bilateral-consultations-in-warsaw/",
      "State Minister of Foreign Affairs Tharaka Balasuriya and Poland’s State Secretary Pawel Jabłoński co-chaired the Third Round of Bilateral Political Consultations in Warsaw on 14 June 2023. During the meeting, both sides reaffirmed their commitment to enhancing economic and technical cooperation between Sri Lanka and Poland. The consultations marked a new direction in strengthening ties between the two countries.",
      "Ministry News"
    ],
    [
      "Misleading Information in Public Domain on Foreign Minister’s Official  Travel Overseas",
      "20.06.2023",
      "https://mfa.gov.lk/en/misleading/",
      "The Ministry of Foreign Affairs addressed misleading information about Minister M.U.M. Ali Sabry's official travel expenses, clarifying that no substantial public funds were spent.",
      "Ministry News"
    ],
    [
      "State Minister of Foreign Affairs Tharaka Balasuriya to visit Poland, Romania and Georgia for Bilateral Political Consultations and a Business Forum",
      "13.06.2023",
      "https://mfa.gov.lk/en/smfm-visit-poland-romania-georgia/",
      "State Minister of Foreign Affairs Tharaka Balasuriya will visit Poland, Romania, and Georgia from June 13 to 20, 2023, for bilateral political consultations and a business forum. He will lead Sri Lanka’s delegations during the visit.",
      "Ministry News"
    ],
    [
      "Fourth Session of the Sri Lanka – Maldives Joint Commission concludes successfully in Colombo",
      "08.06.2023",
      "https://mfa.gov.lk/en/4th-session-sl-maldives-joint-commission/",
      "The Fourth Session of the Sri Lanka-Maldives Joint Commission, co-chaired by Foreign Minister Ali Sabry and Maldives' Foreign Minister Abdulla Shahid, successfully concluded on June 7, 2023, in Colombo. The session took place at the Ministry of Foreign Affairs.",
      "Ministry News"
    ],
    [
      "Music from the East and West come together in ‘International Harmony’",
      "04.06.2023",
      "https://mfa.gov.lk/en/east-west-music-come-together-in-international-harmony/",
      "The Ministry of Foreign Affairs hosted an evening of classical music by the Symphony Orchestra of Sri Lanka (SOSL) on Friday, 2 June 2023 at the Lionel Wendt to mark 75 years of Diplomacy. The event, titled 'International Harmony,' brought together music from the East and West in a celebration of cultural diversity and unity.",
      "Ministry News"
    ],
    [
      "Sri Lanka and Maldives to commence the Fourth Session of the Joint Commission in Colombo",
      "04.06.2023",
      "https://mfa.gov.lk/en/sl-maldives-commence-4th-session-joint-commission/",
      "Sri Lanka and the Maldives will commence the Fourth Session of the Joint Commission in Colombo on June 6-7, 2023, at the Ministry of Foreign Affairs. The Minister of Foreign Affairs of Sri Lanka, M.U., will be in attendance for the session.",
      "Ministry News"
    ],
    [
      "President’s Poson Poya Day Message",
      "03.06.2023",
      "https://mfa.gov.lk/en/presidents-poson-poya-day-message/",
      "President delivers a message on Poson Poya Day, emphasizing the significance of the occasion. The message highlights the importance of peace, compassion, and unity in society.",
      "Ministry News"
    ],
    [
      "Sri Lanka and China successfully concluded the 12th round of Diplomatic Consultations",
      "31.05.2023",
      "https://mfa.gov.lk/en/sl-china-12th-diplomatic-consultations/",
      "Sri Lanka and China successfully concluded their 12th round of Diplomatic Consultations on May 30, 2023. The consultations were co-chaired by the Secretary of the Ministry of Foreign Affairs of Sri Lanka, strengthening diplomatic ties between the two countries.",
      "Ministry News"
    ],
    [
      "Executive Secretary of the Comprehensive Nuclear Test-Ban Treaty Organization (CTBTO) to visit Sri Lanka from 31 May to 4 June 2023",
      "30.05.2023",
      "https://mfa.gov.lk/en/ctbto_robert/",
      "Dr. Robert Floyd, Executive Secretary of the Comprehensive Nuclear Test-Ban Treaty Organization (CTBTO), will visit Sri Lanka from 31 May to 4 June 2023. His visit includes scheduled courtesy calls and engagements during this period.",
      "Ministry News"
    ],
    [
      "Sri Lanka and China to commence 12th round of Diplomatic Consultations",
      "29.05.2023",
      "https://mfa.gov.lk/en/sl-china-to-commence-12th-round-of-diplomatic-consultations/",
      "China's Vice Minister of Foreign Affairs, Sun Weidong, will lead a delegation to Sri Lanka from May 29 to June 1, 2023, to co-chair the 12th round of Diplomatic Consultations. The meetings aim to strengthen diplomatic ties between the two countries.",
      "Ministry News"
    ],
    [
      "President Ranil Wickremesinghe concludes successful visit to Japan",
      "29.05.2023",
      "https://mfa.gov.lk/en/president-concludes-successful-visit-to-japan/",
      "President Ranil Wickremesinghe successfully concluded his three-day visit to Japan, during which he addressed the 28th Nikkei Future of Asia Conference in Tokyo. The prestigious forum, organized by Nikkei Inc., featured his participation.",
      "Ministry News"
    ],
    [
      "Passing Away of Ambassador Jayantha Dhanapala",
      "27.05.2023",
      "https://mfa.gov.lk/en/passing-away-of-ambassador-deshamanya-jayantha-dhanapala/",
      "The Ministry of Foreign Affairs expresses deep sorrow at the passing of Ambassador Jayantha Dhanapala, a distinguished Sri Lankan Foreign Service officer. Condolences are extended to his family during this difficult time. Ambassador Dhanapala's contributions will be remembered and cherished.",
      "Ministry News"
    ],
    [
      "Foreign Ministry Categorically Rejects the Allegations made  against the Consular Affairs Division",
      "26.05.2023",
      "https://mfa.gov.lk/en/fmsl-categorically-rejects-allegations/",
      "The Foreign Ministry has categorically rejected allegations made against the Consular Affairs Division in a recent television news report. The Ministry clarified that no staff member of the Division was involved in the reported incident.",
      "Ministry News"
    ],
    [
      "State Minister of Foreign Affairs Tharaka Balasuriya leads Sri Lanka delegation to the First Session of the Sri Lanka – Saudi Joint Commission",
      "26.05.2023",
      "https://mfa.gov.lk/en/smfa-leads-1st-session-sl-saudi-joint-commission/",
      "State Minister of Foreign Affairs Tharaka Balasuriya led the Sri Lanka delegation to the First Session of the Sri Lanka-Saudi Joint Commission in Riyadh, Saudi Arabia from 21 to 23 May 2023. The commission was established under a framework agreement signed by the two countries in 2003, fostering bilateral cooperation and dialogue.",
      "Ministry News"
    ],
    [
      "President to address the Nikkei Future of Asia Conference in Japan",
      "22.05.2023",
      "https://mfa.gov.lk/en/president-to-address-the-nikkei-future-of-asia-conference-in-japan/",
      "President Ranil Wickremesinghe is set to visit Japan from 24 to 27 May 2023 to speak at the 28th Nikkei Future of Asia Conference in Tokyo. He will also engage in bilateral discussions during his visit.",
      "Ministry News"
    ],
    [
      "​Sri Lanka hosts the 14th ASEAN Regional Forum (ARF) Inter-Sessional Meeting on Non-Proliferation and Disarmament (ISM on NPD) in Colombo",
      "22.05.2023",
      "https://mfa.gov.lk/en/sl-hosts-14th-asean-regional-forum/",
      "Sri Lanka hosted the 14th ASEAN Regional Forum (ARF) Inter-Sessional Meeting on Non-Proliferation and Disarmament (ISM on NPD) in Colombo from 16-17 May 2023. The event was co-chaired by Sri Lanka, Thailand, and the United States.",
      "Ministry News"
    ],
    [
      "Competitive examination for filling vacancies in the Management Services Officers’ cadre in Sri Lanka Mission abroad -2022 (2023)",
      "22.05.2023",
      "https://mfa.gov.lk/en/competitive-examination-20222023/",
      "The Department of Examination conducted the written segment of the competitive examination for Management Services Officers’ cadre in Sri Lanka Mission abroad on 19 February 2023. The list of candidates eligible for the Practical Assessment has been compiled in index number order. Further updates on the assessment process will be provided in due course.",
      "Ministry News"
    ],
    [
      "Foreign Minister Summons the Canadian High Commissioner on the alleged genocide claims by the Canadian Prime Minister",
      "20.05.2023",
      "https://mfa.gov.lk/en/mfa-summons-canadian-hc/",
      "Foreign Minister Ali Sabry summoned Canadian High Commissioner Eric Walsh to the Ministry of Foreign Affairs on 19 May 2023 to condemn and reject the alleged genocide claims made by Canadian Prime Minister Ju.",
      "Ministry News"
    ],
    [
      "Sri Lanka unreservedly rejects the unfounded allegations by the Canadian Prime Minister",
      "19.05.2023",
      "https://mfa.gov.lk/en/sl-unreservedly-rejects-unfounded-allegations/",
      "Sri Lanka's Ministry of Foreign Affairs unequivocally rejects Canadian Prime Minister Justin Trudeau's statement on May 18, 2023, which made unfounded claims of genocide in relation to past conflicts in Sri Lanka.",
      "Ministry News"
    ],
    [
      "Political, Investment and Business areas feature highly in Foreign Minister Ali Sabry’s discussions in Sweden",
      "18.05.2023",
      "https://mfa.gov.lk/en/foreign-minister-ali-sabrys-discussions-in-sweden/",
      "Foreign Minister Ali Sabry wrapped up his visit to Sweden on May 16, 2023, after engaging with the Swedish Government, the Speaker of the Riksdag, European Union countries, and the Swedish business community. Discussions during the visit focused on political, investment, and business matters, highlighting the importance of diplomatic relations between the two countries.",
      "Ministry News"
    ],
    [
      "Engagement between the Swedish Riksdag and the Parliament of Sri Lanka to be invigorated",
      "18.05.2023",
      "https://mfa.gov.lk/en/engagement-between-the-swedish-riksdag-and-the-parliament-of-sl/",
      "Swedish Speaker Andreas Norlén met with Sri Lanka’s Foreign Minister Ali Sabry at the Riksdag in Stockholm on May 15. Both parties agreed to enhance engagement between the legislatures of Sweden and Sri Lanka.",
      "Ministry News"
    ],
    [
      "2nd Meeting of Experts on the Migration Partnership between Sri Lanka and Switzerland",
      "18.05.2023",
      "https://mfa.gov.lk/en/2nd-meeting-of-experts-sl-swiss/",
      "The 2nd Experts Meeting on the Migration Partnership between Sri Lanka and Switzerland took place on May 16, 2023, at the Ministry of Foreign Affairs. The meeting was co-chaired by the Director General for Europe & North America.",
      "Ministry News"
    ],
    [
      "Brazil donates a consignment of medical supplies to Sri Lanka",
      "17.05.2023",
      "https://mfa.gov.lk/en/brazil/",
      "Brazil, through the Brazilian Cooperation Agency (ABC), donated a consignment of medical supplies to Sri Lanka, including 10,000 vials of regular human insulin and 8 million polypropylene tips. The donation aims to support Sri Lanka's healthcare system during the ongoing pandemic.",
      "Ministry News"
    ],
    [
      "Joint Press Release: 25th Session of the Sri Lanka – EU Joint Commission",
      "15.05.2023",
      "https://mfa.gov.lk/en/25th-eu/",
      "The 25th Session of the Sri Lanka-EU Joint Commission took place in Colombo on May 9, 2023, fostering a constructive and cordial atmosphere. The meeting reviewed bilateral relations and discussed a range of topics, enhancing cooperation between the two parties.",
      "Ministry News"
    ],
    [
      "Minister Nimal Siripala De Silva leads Sri Lanka’s delegation to 6th Indian Ocean Conference in Dhaka",
      "13.05.2023",
      "https://mfa.gov.lk/en/dha_ioc/",
      "Minister Nimal Siripala De Silva led Sri Lanka’s delegation, including State Minister of Foreign Affairs Tharaka Balasuriya, to the 6th Indian Ocean Conference in Dhaka. The delegation participated in discussions at the conference.",
      "Ministry News"
    ],
    [
      "Foreign Minister to attend 02nd Indo-Pacific Ministerial Forum in Stockholm",
      "11.05.2023",
      "https://mfa.gov.lk/en/mfa_stockholm/",
      "Foreign Minister Ali Sabry departed for Stockholm, Sweden this morning to participate in the 2nd Indo-Pacific Ministerial Forum on May 13, 2023. The forum is being held under the Swedish Presidency of the Council.",
      "Ministry News"
    ],
    [
      "Document Authentication Process Delay due to Breakdown of Computer System at the Foreign Ministry Consular Affairs Division",
      "09.05.2023",
      "https://mfa.gov.lk/en/breakdown-consular-system-fmsl/",
      "The document authentication process is experiencing delays at the Foreign Ministry's Consular Affairs Division in Colombo due to a computer system breakdown. This issue is affecting the authentication of documents by the Consular Affairs Division. Efforts are underway to resolve the technical fault promptly.",
      "Ministry News"
    ],
    [
      "25th Session of the EU – Sri Lanka Joint Commission",
      "08.05.2023",
      "https://mfa.gov.lk/en/25th-session-of-the-eu-sri-lanka-joint-commission/",
      "The 25th Session of the EU – Sri Lanka Joint Commission will take place on 09 May 2023 at the Ministry of Foreign Affairs in Colombo. The meeting will be co-chaired by the Secretary of the Ministry.",
      "Ministry News"
    ],
    [
      "The message of Hon. M.U.M Ali Sabry, Foreign Minister of Sri Lanka for Vesak Day 2023",
      "05.05.2023",
      "https://mfa.gov.lk/en/the-message-mfa-vesak-2023/",
      "Foreign Minister of Sri Lanka, Hon. M.U.M Ali Sabry, delivered a message for Vesak Day 2023. In his message, he emphasized the significance of Vesak and its message of peace and compassion.",
      "Ministry News"
    ],
    [
      "Vesak day message of Hon. Prime Minister",
      "05.05.2023",
      "https://mfa.gov.lk/en/vesak-day-message-of-hon-prime-minister/",
      "Hon. Prime Minister delivers Vesak Day message in English, Sinhala, and Tamil languages. The messages aim to convey wishes and blessings for Vesak Day celebrations. The Prime Minister's multilingual messages promote unity and harmony among diverse communities.",
      "Ministry News"
    ],
    [
      "President’s Vesak Day Message -2023",
      "05.05.2023",
      "https://mfa.gov.lk/en/presidents-vesak-day-message-2023/",
      "President's Vesak Day Message for 2023 was delivered, emphasizing the significance of the occasion. The message highlighted the importance of peace, compassion, and unity in society.",
      "Ministry News"
    ],
    [
      "ADB President commends Sri Lanka for action taken to overcome economic crisis and pledges further support",
      "02.05.2023",
      "https://mfa.gov.lk/en/adb-president-commends-sl/",
      "During the 56th Annual Meeting of the Asian Development Bank in Seoul, Foreign Minister Ali Sabry met with ADB President Masatsugu Asakawa. The Minister commended Sri Lanka for its efforts to overcome the economic crisis and pledged further support from the ADB.",
      "Ministry News"
    ],
    [
      "Evacuated Sri Lankans from Sudan arrive in Sri Lanka",
      "29.04.2023",
      "https://mfa.gov.lk/en/evacuated-sl-sudan/",
      "14 Sri Lankans who were evacuated from Sudan due to the crisis arrived at Bandaranaike International Airport today. They were warmly welcomed by the Director General upon their arrival.",
      "Ministry News"
    ],
    [
      "Foreign Minister Ali Sabry to attend the Annual Meeting of the Board of Governors of the ADB, in South Korea",
      "28.04.2023",
      "https://mfa.gov.lk/en/korea/",
      "Foreign Minister Ali Sabry will travel to Incheon, South Korea to participate in the 56th Annual Meeting of the Board of Governors of the Asian Development Bank (ADB) from May 2-5, 2023. He will represent President Presid at the event.",
      "Ministry News"
    ],
    [
      "Sri Lanka rejects designation by the U.S.  of Admiral of the Fleet  Wasantha Karannagoda",
      "27.04.2023",
      "https://mfa.gov.lk/en/kgoda/",
      "Sri Lanka rejects the U.S. designation of Admiral of the Fleet Wasantha Karannagoda as Governor of the North Western Province on 26 April 2023. Foreign Minister Ali Sabry expressed Sri Lanka's regret over this decision.",
      "Ministry News"
    ],
    [
      "Evacuation of Sri Lankans in the Sudan",
      "26.04.2023",
      "https://mfa.gov.lk/en/sudan/",
      "The Government of Sri Lanka is prioritizing the safety and security of stranded Sri Lankans in Sudan. Sri Lanka is closely monitoring the changing security situation in Sudan to facilitate their evacuation.",
      "Ministry News"
    ],
    [
      "President’s Ramazan Day Message",
      "21.04.2023",
      "https://mfa.gov.lk/en/presidents-ramazan-day-message/",
      "President's Ramazan Day message has been released in English, Sinhala, and Tamil languages. The message aims to convey best wishes and blessings for the holy month of Ramazan.",
      "Ministry News"
    ],
    [
      "Situation in Sudan",
      "21.04.2023",
      "https://mfa.gov.lk/en/situation-in-sudan/",
      "Sri Lanka is closely monitoring the evolving situation in Sudan through its Embassy in Cairo, which is accredited to Sudan. The country is following recent developments in Sudan closely to stay informed.",
      "Ministry News"
    ],
    [
      "Sri Lanka participates in the CICA Senior Officials Committee Meetin​g​",
      "20.04.2023",
      "https://mfa.gov.lk/en/sl-participates-cica-meeting/",
      "Sri Lanka took part in the CICA Senior Officials Committee Meeting, a multinational forum focused on enhancing cooperation to promote peace and security in Asia. The meeting aimed to strengthen interactions and confidence-building measures among member countries.",
      "Ministry News"
    ],
    [
      "Sri Lanka and UK to convene Strategic Dialogue on 18 April in London",
      "17.04.2023",
      "https://mfa.gov.lk/en/sl-uk-to-convene-strategic-dialogue-on-18-april-in-london/",
      "Sri Lanka and the UK will hold their first Strategic Dialogue at the Foreign Commonwealth and Development Office (FCDO) in London on 18 April 2023. Foreign Secretary Aruni Wijewardane will represent Sri Lanka in this important meeting aimed at strengthening bilateral ties and cooperation.",
      "Ministry News"
    ],
    [
      "President’s New Year Message",
      "13.04.2023",
      "https://mfa.gov.lk/en/presidents-new-year-message-3/",
      "President delivers a New Year message in Sinhala and Tamil, wishing the nation a prosperous year ahead. The message emphasizes unity and progress for all citizens in the coming year.",
      "Ministry News"
    ],
    [
      "Sri Lanka Donates Consignment of Apparel to Earthquake​ Victims in Türkiye",
      "12.04.2023",
      "https://mfa.gov.lk/en/to-tur/",
      "Sri Lanka's Government donated 4.6 tons of apparel to Türkiye's earthquake victims. Minister of Foreign Affairs Ali Sabry presented the consignment to the Ambassador.",
      "Ministry News"
    ],
    [
      "Sri Lanka and Oman hold Third Round of Political Consultations",
      "12.04.2023",
      "https://mfa.gov.lk/en/oman-cons/",
      "Sri Lanka and Oman recently conducted the Third Round of Bilateral Political Consultations on April 11, 2023. This meeting marks a significant step in strengthening diplomatic ties between the two countries.",
      "Ministry News"
    ],
    [
      "Sri Lanka is concerned over the deteriorating situation in the Occupied Palestinian Territories",
      "11.04.2023",
      "https://mfa.gov.lk/en/holy-month-of-ramadan/",
      "Sri Lanka expresses deep concern over the escalating violence in the Occupied Palestinian Territories, particularly the incidents at the Al-Aqsa Mosque during Ramadan. Sri Lanka urges all parties to work towards de-escalation and peace in the region.",
      "Ministry News"
    ],
    [
      "Foreign Minister briefs Diplomatic Corps on developments in Sri Lanka",
      "10.04.2023",
      "https://mfa.gov.lk/en/fm-sl-briefs-diplomatic-corps/",
      "Foreign Minister Ali Sabry briefed the Colombo-based diplomatic corps on recent developments in Sri Lanka on April 10, 2023. Minister of State of Foreign Affairs Tharaka Balasuriya also participated in the briefing. The meeting aimed to update the diplomatic community on the current situation in the country.",
      "Ministry News"
    ],
    [
      "Sri Lanka elected to the United Nations Commission on the Status of Women",
      "06.04.2023",
      "https://mfa.gov.lk/en/sl-elected-un-commission-on-the-status-of-women/",
      "Sri Lanka was elected to the United Nations Commission on the Status of Women (CSW) by acclamation at the United Nations Economic and Social Council (ECOSOC) meeting in New York on April 5, 2023, for a four-year term.",
      "Ministry News"
    ],
    [
      "Foreign Secretary addresses Defence Services, Command  and Staff College",
      "03.04.2023",
      "https://mfa.gov.lk/en/fs-addresses-defence-services/",
      "Foreign Secretary Aruni Wijewardane delivered the keynote address as the Guest Speaker at the annual “Diners’ Club” event at the Defence Services, Command and Staff College in Sapugaskanda on March 31, 2023.",
      "Ministry News"
    ],
    [
      "State Minister Balasuriya discusses strengthening of relations between Sri Lanka and the ASEAN Countries",
      "31.03.2023",
      "https://mfa.gov.lk/en/smfa-lk-asean-countries/",
      "State Minister of Foreign Affairs Tharaka Balasuriya chaired a meeting at the Ministry on 30 March 2023 to discuss strengthening relations between Sri Lanka and ASEAN countries. The meeting involved the participation of key stakeholders.",
      "Ministry News"
    ],
    [
      "Foreign Minister concludes working visit to South Africa",
      "28.03.2023",
      "https://mfa.gov.lk/en/saf/",
      "Foreign Minister Ali Sabry, along with Minister Wijeyadasa Rajapakse, concluded their three-day working visit to South Africa on March 25, 2023. The visit aimed to strengthen diplomatic ties between the two countries.",
      "Ministry News"
    ],
    [
      "IORA Workshop on “Cooperation for Maritime Security” successfully concluded",
      "27.03.2023",
      "https://mfa.gov.lk/en/iora-workshop/",
      "The Ministry of Foreign Affairs, in collaboration with the Max Planck Foundation for International Peace and the Rule of Law and Indian Ocean Rim Association (IORA), successfully concluded a three-day Workshop on “Cooperation for Maritime Security.",
      "Ministry News"
    ],
    [
      "State Minister Balasuriya calls for expansion of ties with Yunnan Province",
      "24.03.2023",
      "https://mfa.gov.lk/en/smfa-calls-for-yunnan-province/",
      "State Minister of Foreign Affairs, Tharaka Balasuriya, called for the expansion of ties with Yunnan Province during his address at the Federation of Chambers of Commerce & Industry of Sri Lanka on March 23, 2023. He made the statement to mark the arrival of a delegation from Yunnan province.",
      "Ministry News"
    ],
    [
      "Foreign Minister and Justice Minister undertake visit to South Africa",
      "22.03.2023",
      "https://mfa.gov.lk/en/fm-and-jm-undertake-visit-sa/",
      "Foreign Minister Ali Sabry is currently on a working visit to South Africa from March 21 to March 25, 2023, at the invitation of South Africa's Minister of International Relations and Cooperation, Dr. Naledi Pandor. The visit aims to strengthen diplomatic ties between the two countries.",
      "Ministry News"
    ],
    [
      "​Sri Lanka hosts Third Meeting of IORA Working Group on Maritime Safety and Security",
      "21.03.2023",
      "https://mfa.gov.lk/en/sl-hosts-3rd-iora/",
      "Sri Lanka chaired the Third Meeting of the Indian Ocean Rim Association’s Working Group on Maritime Safety and Security in Colombo on 20 March 2023. The meeting included participation from the 23 IORA member countries, focusing on enhancing maritime safety and security in the region.",
      "Ministry News"
    ],
    [
      "Foreign Minister visits the United Kingdom for Commonwealth Foreign Affairs Ministers’ Meeting",
      "20.03.2023",
      "https://mfa.gov.lk/en/commonwealth-fms-meeting/",
      "Foreign Minister Ali Sabry attended the 22nd Commonwealth Foreign Affairs Ministers Meeting in London on 15 March 2023. He also took part in the Commonwealth Day ceremonies during his visit to the United Kingdom.",
      "Ministry News"
    ],
    [
      "Foreign Ministry hosts High Level Interactive Session on Sustainable Climate Financing",
      "15.03.2023",
      "https://mfa.gov.lk/en/fm-hosts-hl-sustainable-climate-financing/",
      "The Foreign Ministry, in partnership with the President's Senior Advisor on Climate Change Ruwan Wijewardene and the Global Green Growth Institute (GGGI), organized a High Level Interactive Session on Sustainable Climate Financing. The session aimed to facilitate discussions and strategies for sustainable climate financing.",
      "Ministry News"
    ],
    [
      "Sri Lanka raises the Commonwealth of Nations Flag for Peace as a collective commitment",
      "13.03.2023",
      "https://mfa.gov.lk/en/sl-raises-commonwealth-nations-flag/",
      "Sri Lanka marked Commonwealth Day by raising the Commonwealth of Nations Flag for Peace on 13 March 2023. State Minister of Foreign Affairs Tharaka Balasuriya led the ceremony, joined by the Secretary of the Ministry of Foreign Affairs.",
      "Ministry News"
    ],
    [
      "Foreign Minister to participate in the 22nd Commonwealth Foreign Affairs Ministers Meeting (CFAMM) at the Commonwealth Headquarters, Marlborough House, London",
      "12.03.2023",
      "https://mfa.gov.lk/en/fm-participate-in-22nd-cfamm/",
      "Foreign Minister Ali Sabry will attend the 22nd Commonwealth Foreign Affairs Ministers Meeting (CFAMM) at the Commonwealth Headquarters in Marlborough House, London on March 15, 2023. This meeting will provide an opportunity for discussions on key international issues.",
      "Ministry News"
    ],
    [
      "Minister of Foreign Affairs addresses the 19th BIMSTEC Minister’s Meeting",
      "10.03.2023",
      "https://mfa.gov.lk/en/mfa-addresses-19th-bimstec-ministers-meeting/",
      "Minister of Foreign Affairs M.U.M. Ali Sabry addressed the 19th Minister’s Meeting of the Bay of Bengal Initiative for Multi-Sectoral Technical and Economic Cooperation (BIMSTEC) in a virtual mode on March 9, 2023. The meeting focused on regional cooperation and economic development initiatives.",
      "Ministry News"
    ],
    [
      "Sri Lanka Welcomes Historic UN Agreement to Protect High Seas – Biological Diversity of Areas Beyond National Jurisdiction (BBNJ)",
      "09.03.2023",
      "https://mfa.gov.lk/en/sl-welcomes-historic-un-agreement-bbnj/",
      "Sri Lanka, as an island state dedicated to ocean sustainability and biodiversity preservation, welcomes the historic UN agreement to protect the high seas and biological diversity beyond national jurisdiction (BBNJ). The conclusion of negotiations on this landmark agreement marks a significant step towards safeguarding the common heritage of mankind.",
      "Ministry News"
    ],
    [
      "International Women’s Day 2023 Message by Secretary Foreign Affairs Aruni Wijewardane",
      "08.03.2023",
      "https://mfa.gov.lk/en/international-womens-day-2023/",
      "On International Women’s Day 2023, Secretary of Foreign Affairs Aruni Wijewardane acknowledges the significant professional contributions of women diplomats, past and present, within the Ministry of Foreign Affairs. This message highlights the unity and recognition of women's roles in diplomatic service.",
      "Ministry News"
    ],
    [
      "Foreign Minister Ali Sabry meets External Affairs Minister of India for bilateral talks on the sidelines of the Raisina Dialogue, New Delhi",
      "06.03.2023",
      "https://mfa.gov.lk/en/fmsl-eam-india-bilateral-talks/",
      "Foreign Minister Ali Sabry met with India's External Affairs Minister during his official visit to New Delhi for the Raisina Dialogue 2023, a key conference on geopolitics and geo-economics. The bilateral talks took place on the sidelines of the event, fostering discussions on mutual interests and cooperation between the two countries.",
      "Ministry News"
    ],
    [
      "Sri Lanka’s 6th Periodic Review under the ICCPR to be held in Geneva",
      "06.03.2023",
      "https://mfa.gov.lk/en/sl-6th-periodic-review-iccpr/",
      "Sri Lanka's 6th Periodic Review under the International Covenant on Civil and Political Rights (ICCPR) is scheduled to take place on 8 and 9 March 2023 in Geneva. Sri Lanka became a party to the ICCPR on 11 June 1980. The review aims to assess the country's compliance with the treaty's provisions.",
      "Ministry News"
    ],
    [
      "Foreign Ministry Business Forum to accelerate the Sri Lanka-Africa Partnership",
      "02.03.2023",
      "https://mfa.gov.lk/en/fm-sl-africa-business-forum/",
      "The Foreign Ministry organized a Business Forum to strengthen Sri Lanka's ties with Africa as part of its Economic Diplomacy initiative. The event aimed to enhance Sri Lanka's presence in the African continent and foster partnerships. The forum took place at the Foreign Ministry with the patronage of Fo.",
      "Ministry News"
    ],
    [
      "​Foreign Ministry Workshop on Cyber Security and the Cyber Domain",
      "02.03.2023",
      "https://mfa.gov.lk/en/fm-workshop-on-cyber-security/",
      "The Ministry of Foreign Affairs conducted a workshop on cyber security for staff and diplomatic officers in Sri Lanka Missions abroad. This workshop is the second of its kind organized by the Ministry to enhance knowledge and preparedness in the cyber domain.",
      "Ministry News"
    ],
    [
      "​ ​​Sri Lanka and the UAE hold First Session of Bilateral Joint Committee for Consular Affairs in Colombo",
      "02.03.2023",
      "https://mfa.gov.lk/en/sl-uae-bilateral-committee/",
      "Sri Lanka and the UAE recently held their First Session of the Joint Committee for Consular Affairs (JCCA) in Colombo at the Ministry of Foreign Affairs on 22 February 2023. The meeting aimed to strengthen cooperation and address consular matters between the two countries.",
      "Ministry News"
    ],
    [
      "Special Notice",
      "01.03.2023",
      "https://mfa.gov.lk/en/special-notice/",
      "The Ministry of Foreign Affairs is seeking the public's help to locate a close relative or acquaintance of the deceased Sri Lankan, Mrs. Jayasooriyage Priyanthika Nilakanthi, who passed away in Lebanon.",
      "Ministry News"
    ],
    [
      "Foreign Minister Ali Sabry to visit India",
      "28.02.2023",
      "https://mfa.gov.lk/en/fm-sl-visit-india/",
      "Foreign Affairs Minister Ali Sabry will visit India from 02-04 March 2023 to attend the eighth edition of the Raisina Dialogue, India’s premier conference on geopolitics and geo-economics.",
      "Ministry News"
    ],
    [
      "Foreign Minister Ali Sabry meets Dr. Peter Ramsauer, Member of the Foreign Affairs Committee of the German Parliament",
      "21.02.2023",
      "https://mfa.gov.lk/en/fmslmeets-dr-peter-ramsauer/",
      "Foreign Minister Ali Sabry met with Dr. Peter Ramsauer, a Member of the Foreign Affairs Committee of the German Parliament responsible for bilateral relations with Sri Lanka. The meeting took place at the Ministry of Foreign Affairs during Dr. Ramsauer's visit.",
      "Ministry News"
    ],
    [
      "Foreign Ministry conducts Diplomatic Practice briefing for Sri Lanka Rupavahini Corporation Officers",
      "20.02.2023",
      "https://mfa.gov.lk/en/fm-conducts-dip-practice-briefing-slr/",
      "The Ministry of Foreign Affairs conducted a successful briefing on Diplomatic Practice for 25 officers from the Sri Lanka Rupavahini Corporation on February 17, 2023. The session took place at the ministry to enhance the officers' understanding of diplomatic protocols and practices.",
      "Ministry News"
    ],
    [
      "Sri Lankan students win the BIMSTEC Silver Jubilee Quiz Contest in Bhutan",
      "17.02.2023",
      "https://mfa.gov.lk/en/sl-students-win-bimstec-silver-jubilee-quiz-contest-in-bhutan/",
      "Sri Lankan students Sayurangi Premasiri and Medhini Anupama Wanigaratne from Kandy emerged as champions in the BIMSTEC Silver Jubilee Quiz Contest held in Bhutan on February 15, 2023. Sayurangi is from Mahamaya Girls’ College, while Medhini is from Hillwood College.",
      "Ministry News"
    ],
    [
      "Death of a Sri Lankan in the aftermath of the earthquake ın Türkiye",
      "14.02.2023",
      "https://mfa.gov.lk/en/death-a-sl-earthquake-turkiye/",
      "A Sri Lankan individual tragically lost their life in the aftermath of the massive earthquake that hit Southern Türkiye on February 6, 2023. The earthquake resulted in the loss of many lives from various countries and extensive property damage across over 110,000 square kilometers.",
      "Ministry News"
    ],
    [
      "Sri Lanka Donates Tea to Earthquake stricken Türkiye",
      "11.02.2023",
      "https://mfa.gov.lk/en/sl-donates-tea-to-turkiye/",
      "Sri Lanka, with the help of Ceylon Tea Exporters, donated a consignment of \"Ceylon Tea\" on February 10, 2023, to the Ambassador of Türkiye in Colombo for earthquake victims. The tea donation aims to support those affected by the disaster in Türkiye.",
      "Ministry News"
    ],
    [
      "Foreign Minister Ali Sabry meets former UNSG Ban Ki-Moon",
      "09.02.2023",
      "https://mfa.gov.lk/en/fm-sl-meets-former-unsg-ban-ki-moon/",
      "Foreign Minister Ali Sabry met with former UN Secretary-General Ban Ki-moon, who currently serves as President of the Assembly and Chair of the Council of the Global Green Growth Institute (GGGI). The meeting took place at the Ministry of Foreign Affairs.",
      "Ministry News"
    ],
    [
      "Statement on the Earthquake in Syria",
      "07.02.2023",
      "https://mfa.gov.lk/en/statement-on-the-earthquake-in-syria/",
      "Sri Lanka expresses deep condolences to the Syrian Arab Republic for the loss of lives and property caused by the recent devastating earthquake. Our thoughts are with the government and people of Syria during this difficult time.",
      "Ministry News"
    ],
    [
      "Statement on the Situation in Türkiye following the Devastating Earthquake",
      "07.02.2023",
      "https://mfa.gov.lk/en/statement-on-the-arthquake/",
      "The Government of Sri Lanka expresses deep sadness over the loss of life, injuries, and property damage resulting from the recent devastating earthquake and aftershocks in southeastern Türkiye on February 6.",
      "Ministry News"
    ],
    [
      "​Foreign Minister Ali Sabry meets the U.S. Under Secretary for Political Affairs Victoria Nuland",
      "07.02.2023",
      "https://mfa.gov.lk/en/fm-meets-us-under-secretary/",
      "Foreign Minister Ali Sabry met with U.S. Under Secretary for Political Affairs Victoria Nuland on February 1, 2023. They discussed important matters aimed at strengthening the relationship between their countries.",
      "Ministry News"
    ],
    [
      "Welcome Address by Foreign Minister Ali Sabry at the Lakshman Kadirgamar Memorial Lecture – 3 February 2023 at BMICH",
      "06.02.2023",
      "https://mfa.gov.lk/en/lakshman-kadirgamar-memorial-lecture/",
      "Foreign Minister Ali Sabry delivered a welcome address at the Lakshman Kadirgamar Memorial Lecture on February 3, 2023, at BMICH. He expressed his gratitude to Foreign Minister Abdul Momen of Bangladesh, Mrs. Suganthie Kadirgamar, and other distinguished guests for the opportunity to honor Sri Lanka's revered figure.",
      "Ministry News"
    ],
    [
      "Foreign Minister Ali Sabry meets Visiting Foreign Dignitaries",
      "05.02.2023",
      "https://mfa.gov.lk/en/fm-meets-visiting-foreign-dignitaries/",
      "Foreign Minister Ali Sabry met with visiting Foreign Ministers and dignitaries invited to celebrate Sri Lanka's 75th Independence Anniversary at the Foreign Ministry.",
      "Ministry News"
    ],
    [
      "Foreign Ministry Forum on Expanding Sri Lanka’s Business Ties with the African region",
      "05.02.2023",
      "https://mfa.gov.lk/en/fm-forum-on-expanding-sl-african-region/",
      "The First Sri Lanka-Africa Business Forum took place on February 3, 2023, at the Ministry of Foreign Affairs with Minister of Foreign Affairs M. U. M. Ali Sabry in attendance. The meeting aimed to enhance Sri Lanka's business connections with the African region, drawing participation from 17 representatives.",
      "Ministry News"
    ],
    [
      "The 75th Independence Day message of H.E Ranil Wickremesinghe, President of Sri Lanka",
      "04.02.2023",
      "https://mfa.gov.lk/en/the-75th-independence-day-message-of-h-e-ranil-wickremesinghe-president-of-sri-lanka/",
      "President of Sri Lanka, H.E. Ranil Wickremesinghe, delivered a message on the occasion of the 75th Independence Day, addressing both Sinhala and Tamil communities. The message highlighted the significance of independence and unity for the nation's progress and development.",
      "Ministry News"
    ],
    [
      "75th National Day Message – Hon. Prime Minister – 2023",
      "04.02.2023",
      "https://mfa.gov.lk/en/75th-national-day-message-pm-2023/",
      "In his 2023 National Day message, the Honorable Prime Minister addressed the nation on the occasion of the 75th National Day. The message highlighted the country's achievements and called for unity and progress moving forward.",
      "Ministry News"
    ],
    [
      "Independence Day Message of the Hon. Foreign Minister of Foreign Affairs– 2023",
      "04.02.2023",
      "https://mfa.gov.lk/en/independence-day-message-of-the-hon-foreign-minister-2023/",
      "The Honorable Foreign Minister of Foreign Affairs delivered the Independence Day message for 2023 in English, Sinhala, and Tamil languages. The messages were shared to mark the National Day.",
      "Ministry News"
    ],
    [
      "President of Sri Lanka meets Envoys from the African Region",
      "03.02.2023",
      "https://mfa.gov.lk/en/president-sl-meets-envoys-african-region/",
      "President Ranil Wickremesinghe of Sri Lanka met with envoys from the African region as part of the government's policy to strengthen ties with African countries. The meeting, organized by the Ministry, aimed to focus on reconnection and collaboration between Sri Lanka and the African continent.",
      "Ministry News"
    ],
    [
      "Appointment of High Commissioner of the Republic of Maldives to Sri Lanka",
      "03.02.2023",
      "https://mfa.gov.lk/en/hc-maldives-to-sl/",
      "The Government of the Republic of Maldives, with the concurrence of the Government of Sri Lanka, has appointed Mr. Ali Faiz as the High Commissioner of the Republic of Maldives to Sri Lanka. He will be based in Colombo.",
      "Ministry News"
    ],
    [
      "Appointment of Ambassador of the Republic of Ecuador to Sri Lanka",
      "03.02.2023",
      "https://mfa.gov.lk/en/ambassador-ecuador-to-sl/",
      "The Government of the Republic of Ecuador, with the agreement of the Government of Sri Lanka, has appointed Mr. Francisco Teodoro Guevara as the new Ambassador Extraordinary and Plenipotentiary of Ecuador to Sri Lanka.",
      "Ministry News"
    ],
    [
      "Appointment of Ambassador of the Kingdom of Sweden to Sri Lanka",
      "03.02.2023",
      "https://mfa.gov.lk/en/ambassador-sweden-to-sl/",
      "The Government of the Kingdom of Sweden, with the agreement of the Government of Sri Lanka, has named Mr. Jan Thesleff as the new Ambassador Extraordinary and Plenipotentiary of Sweden to Sri Lanka. Mr. Thesleff will represent Sweden in Sri Lanka in his new role.",
      "Ministry News"
    ],
    [
      "Appointment of Ambassador of the Czech Republic to Sri Lanka",
      "03.02.2023",
      "https://mfa.gov.lk/en/ambassador-czech-to-sl/",
      "The Government of the Czech Republic, in agreement with the Government of Sri Lanka, has appointed Dr. Ms. Eliška Žigová as the new Ambassador Extraordinary and Plenipotentiary of the Czech Republic to Sri Lanka. She will be based in Sri Lanka to represent her country in diplomatic matters.",
      "Ministry News"
    ],
    [
      "Appointment of High Commissioner of the Malaysia to Sri Lanka",
      "03.02.2023",
      "https://mfa.gov.lk/en/hc-malaysia-to-sl/",
      "The Government of Malaysia, with the approval of the Government of Sri Lanka, has named Mr. Badli Hisham bin Adam as the new High Commissioner of Malaysia to Sri Lanka, stationed in Colombo. He has already presented his credentials to H.E. the President of Sri Lanka.",
      "Ministry News"
    ],
    [
      "Appointment of Ambassador of the Slovak Republic to Sri Lanka",
      "03.02.2023",
      "https://mfa.gov.lk/en/ambassador-slovak-sl/",
      "The Government of the Slovak Republic, in agreement with the Government of Sri Lanka, has appointed Mr. Róbert Maxián as the new Ambassador Extraordinary and Plenipotentiary of the Slovak Republic to Sri Lanka. He will be based in Ne.",
      "Ministry News"
    ],
    [
      "Appointment of Ambassador of the Republic of Armenia to Sri Lanka",
      "03.02.2023",
      "https://mfa.gov.lk/en/ambassador-armenia-to-sl/",
      "The Government of the Republic of Armenia, with the approval of the Government of Sri Lanka, has appointed Mr. Youri Babakhanian as the new Ambassador Extraordinary and Plenipotentiary of Armenia to Sri Lanka. Mr. Babakhanian will represent Armenia in Sri Lanka in his diplomatic capacity.",
      "Ministry News"
    ],
    [
      "Appointment of Ambassador of the Republic of North Macedonia to Sri Lanka",
      "03.02.2023",
      "https://mfa.gov.lk/en/ambassador-north-macedonia-to-sl/",
      "The Government of the Republic of North Macedonia, in agreement with the Government of Sri Lanka, has appointed Mr. Slobodan Uzunov as the Ambassador Extraordinary and Plenipotentiary of the Republic of North Macedonia to Sri Lanka.",
      "Ministry News"
    ],
    [
      "Appointment of High Commissioner of Canada to Sri Lanka",
      "02.02.2023",
      "https://mfa.gov.lk/en/hc-canada-to-sl/",
      "The Government of Canada, with the approval of Sri Lanka, has appointed Mr. Eric Walsh as the new High Commissioner of Canada to Sri Lanka. He is based in Colombo and has already presented his credentials to H.E. Ranil Wickremesinghe.",
      "Ministry News"
    ],
    [
      "Appointment of Ambassador of the Republic of the Sudan to Sri Lanka",
      "02.02.2023",
      "https://mfa.gov.lk/en/ambassdor-sudan-to-sl/",
      "The Government of the Republic of the Sudan, with the agreement of the Government of Sri Lanka, has named Mr. Abdalla Omer Elhusain as the new Ambassador Extraordinary and Plenipotentiary of the Republic of the Sudan to Sri Lanka. This appointment strengthens diplomatic ties between the two nations.",
      "Ministry News"
    ],
    [
      "Appointment of High Commissioner of the Republic of Malawi to Sri Lanka",
      "02.02.2023",
      "https://mfa.gov.lk/en/hc-malawi-to-sl/",
      "The Government of the Republic of Malawi, with the approval of the Government of Sri Lanka, has named Mr. Leonard Mengezi as the High Commissioner of Malawi to Sri Lanka. He will be stationed in New Delhi.",
      "Ministry News"
    ],
    [
      "Appointment of Ambassador of the Republic of Serbia to Sri Lanka",
      "02.02.2023",
      "https://mfa.gov.lk/en/ambassador-serbia-to-sl/",
      "The Government of the Republic of Serbia, in agreement with the Government of Sri Lanka, has appointed Mr. Sinisa Pavic as the new Ambassador Extraordinary and Plenipotentiary of Serbia to Sri Lanka. Mr. Pavic will represent Serbia in Sri Lanka in his diplomatic capacity.",
      "Ministry News"
    ],
    [
      "Appointment of High Commissioner of the United Republic of Tanzania to Sri Lanka",
      "02.02.2023",
      "https://mfa.gov.lk/en/ambassador-tanzania-to-sl/",
      "Ms. Anisa Kapufi Mbega has been appointed as the High Commissioner of the United Republic of Tanzania to Sri Lanka with the concurrence of the Government of Sri Lanka.",
      "Ministry News"
    ],
    [
      "Appointment of Ambassador of Mongolia to Sri Lanka",
      "02.02.2023",
      "https://mfa.gov.lk/en/ambassador-mongolia-to-sl/",
      "The Government of Mongolia, in agreement with Sri Lanka, has appointed Mr. Ganbold Dambajav as Mongolia's Ambassador to Sri Lanka. He will be based in New Delhi.",
      "Ministry News"
    ],
    [
      "Appointment of Ambassador of the Oriental Republic Uruguay to Sri Lanka",
      "02.02.2023",
      "https://mfa.gov.lk/en/ambassador-uruguay-to-sl/",
      "The Government of the Oriental Republic of Uruguay, with the approval of the Government of Sri Lanka, has named Mr. Alberto Guania Amarilla as the new Ambassador Extraordinary and Plenipotentiary to Sri Lanka.",
      "Ministry News"
    ],
    [
      "Appointment of High Commissioner of Jamaica to Sri Lanka",
      "02.02.2023",
      "https://mfa.gov.lk/en/hc-jamaica-to-sl/",
      "Mr. Jason K. Hall has been appointed as the High Commissioner of Jamaica to Sri Lanka, based in New Delhi, with the approval of both governments. He recently presented his credentials to H.E. Ranil Wi.",
      "Ministry News"
    ],
    [
      "Appointment of Ambassador of Republic of Côte d’Ivoire to Sri Lanka",
      "02.02.2023",
      "https://mfa.gov.lk/en/ambassador-cote-divoire-to-sl/",
      "The Government of the Republic of Côte d’Ivoire, with the approval of the Government of Sri Lanka, has named Mr. N’dry Eric Camille as the new Ambassador Extraordinary and Plenipotentiary of the Republic of Côte d’Ivoire to Sri Lanka.",
      "Ministry News"
    ],
    [
      "Sri Lanka concludes its Review under the 4th Cycle of the Universal (UPR)",
      "01.02.2023",
      "https://mfa.gov.lk/en/sl-4th-cycle-universal-upr/",
      "Sri Lanka completed its review under the 4th Cycle of the Universal Periodic Review (UPR) in Geneva. Foreign Minister Ali Sabry led the Sri Lanka delegation and delivered remarks during the session. The review marks an important step in assessing Sri Lanka's human rights record.",
      "Ministry News"
    ],
    [
      "Sri Lanka to be reviewed under the 4th Cycle of the UPR",
      "31.01.2023",
      "https://mfa.gov.lk/en/sl-reviewed-4th-upr/",
      "Sri Lanka's National Report will undergo review in the 4th Cycle of the Universal Periodic Review (UPR) by the UN Working Group on UPR on Wednesday, February 1, 2023, during its 42nd Session in Geneva. This evaluation aims to assess Sri Lanka's human rights situation and compliance with international standards.",
      "Ministry News"
    ],
    [
      "Foreign Minister Ali Sabry concludes official visit to Kingdom of Saudi Arabia",
      "27.01.2023",
      "https://mfa.gov.lk/en/fmsl-official-visit-to-ksa/",
      "Foreign Minister Ali Sabry has concluded his official visit to the Kingdom of Saudi Arabia, following an invitation from His Highness Prince Faisal bin Farhan Al Saud, the Minister of Foreign Affairs of Saudi Arabia.",
      "Ministry News"
    ],
    [
      "Foreign Minister Ali Sabry to visit Saudi Arabia",
      "21.01.2023",
      "https://mfa.gov.lk/en/fm-sl-to-visit-saudi-arabia/",
      "Foreign Minister Ali Sabry is set to visit Saudi Arabia from January 23 to January 27, 2023, following an invitation from Saudi Arabia's Minister of Foreign Affairs, Prince Fais.",
      "Ministry News"
    ],
    [
      "Minister of External Affairs of India Dr. S. Jaishankar concludes visit to Sri Lanka",
      "20.01.2023",
      "https://mfa.gov.lk/en/moeao-india-fm-sl/",
      "Indian External Affairs Minister Dr. S. Jaishankar completed his official visit to Sri Lanka on January 20, 2023. He engaged in bilateral discussions with Sri Lankan Foreign Affairs Minister Ali S. during his visit.",
      "Ministry News"
    ],
    [
      "Indian External Affairs Minister Dr. S. Jaishankar to visit Sri Lanka",
      "18.01.2023",
      "https://mfa.gov.lk/en/indian-eam-visit-sl/",
      "Indian External Affairs Minister Dr. S. Jaishankar is set to visit Sri Lanka on January 19-20, 2023, for official discussions. The visit aims to strengthen bilateral relations between the two countries.",
      "Ministry News"
    ],
    [
      "Foreign Secretary Wijewardane and UK FCDO Permanent Under Secretary Sir Philip Barton hold discussions at Foreign Ministry Colombo",
      "17.01.2023",
      "https://mfa.gov.lk/en/fs-sl-uk-fcdo/",
      "Foreign Secretary Aruni Wijewardane and UK FCDO Permanent Under Secretary Sir Philip Barton recently held discussions at the Foreign Ministry in Colombo. The meeting aimed to strengthen diplomatic ties between Sri Lanka and the United Kingdom.",
      "Ministry News"
    ],
    [
      "The message of H.E Ranil Wickremesinghe, President of Sri Lanka on the occasion of Thai Pongal",
      "14.01.2023",
      "https://mfa.gov.lk/en/the-message-of-h-e-ranil-wickremesinghe-president-of-sri-lanka-on-the-occasion-of-thai-pongal/",
      "President of Sri Lanka, H.E. Ranil Wickremesinghe, delivered a message on the occasion of Thai Pongal, extending his warm wishes to all celebrating. The message highlighted the significance of Thai Pongal in Sri Lankan culture and traditions.",
      "Ministry News"
    ],
    [
      "The CEO of Qatar Charity calls on Foreign Minister",
      "12.01.2023",
      "https://mfa.gov.lk/en/ceo-of-charity-calls-on-fm/",
      "The CEO of Qatar Charity, Yousef Al-Kuwari, met with Foreign Minister Ali Sabry at the Ministry of Foreign Affairs on January 11, 2023. During the meeting, Foreign Minister Ali Sabry warmly welcomed the delegation from Qatar Charity.",
      "Ministry News"
    ],
    [
      "Foreign Minister summons the Acting High Commissioner of Canada to raise concerns",
      "11.01.2023",
      "https://mfa.gov.lk/en/fm-summons-actg-hc-canada/",
      "Foreign Minister Ali Sabry summoned Canadian Acting High Commissioner Daniel Bood to the Ministry of Foreign Affairs on January 11. He expressed the government's deep regret over Canada's unilateral announcement.",
      "Ministry News"
    ],
    [
      "Sri Lanka regrets decision by Canada to impose sanctions on two former Presidents of Sri Lanka",
      "11.01.2023",
      "https://mfa.gov.lk/en/sl-regrets-decision-by-canada/",
      "Sri Lanka expresses deep regret over Canada's politically motivated decision to impose sanctions on four individuals, including two former Presidents of Sri Lanka on January 10, 2023. This unilateral action by the Canadian Government has been met with disappointment by Sri Lanka.",
      "Ministry News"
    ],
    [
      "Foreign Minister Ali Sabry briefs the Colombo-based Diplomatic Corps on current developments",
      "11.01.2023",
      "https://mfa.gov.lk/en/mfa-colombo-based-dpl-corps/",
      "Foreign Minister Ali Sabry chaired the first diplomatic briefing for the Colombo-based Diplomatic Corps at the Ministry on January 10, 2023. During the briefing, Minister Sabry highlighted current developments in Sri Lanka and engaged with the diplomats to provide updates and foster diplomatic relations.",
      "Ministry News"
    ],
    [
      "President’s New Year Message",
      "01.01.2023",
      "https://mfa.gov.lk/en/presidents-new-year-message-2/",
      "In his New Year message, the Honorable President addressed the nation with hopes for a prosperous year ahead. The President's message emphasized unity and progress for the country in the coming year.",
      "Ministry News"
    ]
  ]
}