[
  {
    "Title": "Competitive examination for filling vacancies in the MSOs cadre in SL Missions abroad 2020 (23) List (on order of Index No.)of qualified candidates for the interview",
    "Date": "11.12.2023",
    "Link": "https://mfa.gov.lk/en/mso-2023-qualified-candidates-for-the-interview/",
    "Summary": "The list of qualified candidates for the interview for filling vacancies in the MSOs cadre in SL Missions abroad 2020 has been released in order of their Index No.",
    "Category": "Special Notices"
  },
  {
    "Title": "BIDDING DOCUMENT  FOR SERVICE OF MOTOR INSURANCE COVER – 2024",
    "Date": "27.11.2023",
    "Link": "https://mfa.gov.lk/en/bidding-document-for-service-of-motor-insurance-cover-2024/",
    "Summary": "\"Bidding document released for the service of motor insurance cover in 2024.",
    "Category": "Special Notices"
  },
  {
    "Title": "Ministry of Foreign Affairs  Recruitment for the Post of Protocol Assistant – 2023",
    "Date": "28.10.2023",
    "Link": "https://mfa.gov.lk/en/mfa-recruitment-protocol-assistant-2023/",
    "Summary": "The Ministry of Foreign Affairs is recruiting for the position of Protocol Assistant in 2023. Interested candidates can find the application forms in English, Sinhala, and Tamil languages on the official website. Applications are now open for this position.",
    "Category": "Special Notices"
  },
  {
    "Title": "Service of an Information and Technology Professional to the Ministry of Foreign Affairs on Contract Basis",
    "Date": "26.09.2023",
    "Link": "https://mfa.gov.lk/en/service-it-professional-mfa/",
    "Summary": "The Ministry of Foreign Affairs seeks an experienced Information and Technology Professional on a contract basis to oversee ongoing IT projects' implementation and maintenance for successful execution.",
    "Category": "Special Notices"
  },
  {
    "Title": "Seeking assistance to locate relative/known person of Mrs. Kulasinghe Arachchige Anula Preethimali Perera",
    "Date": "22.06.2023",
    "Link": "https://mfa.gov.lk/en/seeking-assistance/",
    "Summary": "The Sri Lanka Embassy in Kuwait has notified the Consular Affairs Division of the Foreign Ministry about the passing of Mrs. Kulasinghe Arachchige Anula Preethimali Perera, a Sri Lankan national, in Lebanon on 2. Assistance is sought to locate any relatives or known contacts of the deceased.",
    "Category": "Special Notices"
  },
  {
    "Title": "Filling of the Vacancies in the Development Officer Service at the Ministry of Foreign Affairs",
    "Date": "21.06.2023",
    "Link": "https://mfa.gov.lk/en/filling-of-the-vacancies-do-mfa/",
    "Summary": "Development Officers' Service members interested in joining the Ministry of Foreign Affairs should fill out the form and submit their CVs through their Department Heads.",
    "Category": "Special Notices"
  },
  {
    "Title": "Filling the Vacancies of the Sri Lanka Information and Communication Technology Service at the Ministry of Foreign Affairs",
    "Date": "13.06.2023",
    "Link": "https://mfa.gov.lk/en/ict-vacanies/",
    "Summary": "The Ministry of Foreign Affairs in Sri Lanka is filling vacancies in the Information and Communication Technology Service, including two Assistant Director Grade III/II positions and three Information and Communication Technology Officer Grade II/I positions. Interested candidates can apply for these roles to contribute to the ministry's technology initiatives.",
    "Category": "Special Notices"
  },
  {
    "Title": "Calling bids for providing Cleaning and Janitorial Services to the Ministry of Foreign Affairs",
    "Date": "06.06.2023",
    "Link": "https://mfa.gov.lk/en/bids-for-providing-cleaning-services-mfa/",
    "Summary": "The Ministry of Foreign Affairs is seeking bids for Cleaning and Janitorial Services. The deadline for bid submission is 16 June 2023 at 2.00 p.m. For , contact 011-7711109.",
    "Category": "Special Notices"
  },
  {
    "Title": "Competitive examination for filling vacancies in the Management Services Officers’ cadre in Sri Lanka Mission abroad -2022 (2023)",
    "Date": "22.05.2023",
    "Link": "https://mfa.gov.lk/en/competitive-examination-20222023/",
    "Summary": "The Department of Examination conducted the written segment of the competitive examination for filling vacancies in the Management Services Officers’ cadre in Sri Lanka Mission abroad on 19 February 2023. The list of candidates eligible for the Practical Assessment has been finalized and is arranged in index number order. The next step in the selection process will be the Practical Assessment for the eligible candidates.",
    "Category": "Special Notices"
  }
]