{
  "columns": [
    "Title",
    "Date",
    "Link",
    "Summary",
    "Category"
  ],
  "rows": [
    [
      "Diplomatic Note of the Embassy of Switzerland in Sri Lanka on 30 December 2019",
      "31.12.2019",
      "https://mfa.gov.lk/en/diplomatic-note-of-the-embassy-of-switzerland-in-sri-lanka-on-30-december-2019/",
      "On December 30, 2019, the Embassy of Switzerland in Sri Lanka sent a Diplomatic Note to the Ministry of Foreign Relations of Sri Lanka. The Embassy has also released this Note simultaneously.",
      "Ministry News"
    ],
    [
      "High Commissioner of Sri Lanka to Nigeria Presents Credentials",
      "30.12.2019",
      "https://mfa.gov.lk/en/high-commissioner-of-sri-lanka-to-nigeria-presents-credentials/",
      "The Sri Lankan High Commissioner to Nigeria, A. Sabarullah Khan, presented his credentials to the President of Nigeria, Muhammadu Buhari, on December 24, 2019, at the Presidential Villa in Abuja.",
      "Ministry News"
    ],
    [
      "Foreign Minister Gunawardena attends Award Ceremony of Institute of Economic Studies in Colombo",
      "29.12.2019",
      "https://mfa.gov.lk/en/award-ceremony-of-institute-of-ies-eng/",
      "Foreign Minister Dinesh Gunawardena attended an award ceremony organized by the Institute of Economic Studies (IES) of India in Colombo. The event focused on \"Indo-Sri Lanka Economic Cooperation,\" with Minister Gunawardena serving as the Chief Guest.",
      "Ministry News"
    ],
    [
      "Sri Lanka Embassy facilitates repatriation of 33 Sri Lankan migrant workers from Kuwait",
      "26.12.2019",
      "https://mfa.gov.lk/en/repatriation-from-kuwait-eng/",
      "The Sri Lanka Embassy in Kuwait, with the cooperation of Kuwaiti authorities, successfully repatriated 33 Sri Lankan migrant workers back to Sri Lanka on December 23, 2019. The Embassy facilitated the issuance of travel documents for their return.",
      "Ministry News"
    ],
    [
      "Sri Lanka’s engagement with the UNDP to be focused on revitalized drive for economic development and achieving Sustainable Development Goals",
      "21.12.2019",
      "https://mfa.gov.lk/en/sri-lankas-engagement-with-the-undp-eng/",
      "Sri Lanka is focusing its engagement with the UNDP on revitalizing economic development and achieving Sustainable Development Goals. Kanni Wignaraja, Assistant Secretary General of the United Nations and Director of the Regional Bureau for Asia and the Pacific of the UNDP, is currently visiting the country to discuss these initiatives.",
      "Ministry News"
    ],
    [
      "‘Revitalized Africa Policy’ to guide Sri Lanka’s engagement with Africa",
      "19.12.2019",
      "https://mfa.gov.lk/en/revitalized-africa-policy-eng/",
      "Sri Lanka's Foreign Secretary, Ravinatha Aryasinha, announced the implementation of the new 'Revitalized Africa Policy' to boost cooperation in political, economic, and cultural areas with African nations. This policy aims to guide Sri Lanka's engagement with Africa across various spheres effectively.",
      "Ministry News"
    ],
    [
      "Foreign Ministers of Sri Lanka and Switzerland exchange views on arrest of Sri Lankan employee of Swiss Mission",
      "18.12.2019",
      "https://mfa.gov.lk/en/views-on-arrest-of-sri-lankan-employee-of-swiss-mission-eng/",
      "Foreign Minister Dinesh Gunawardena received a call from Swiss Foreign Minister Ignazio Cassis to discuss the arrest of Sri Lankan employee Ms. G at the Swiss Embassy. The exchange of views aimed to address the status of the employee and the situation between Sri Lanka and Switzerland.",
      "Ministry News"
    ],
    [
      "Foreign Secretary Aryasinha calls for the regaining of Sri Lanka’s economic prominence in Egypt",
      "15.12.2019",
      "https://mfa.gov.lk/en/economic-prominence-in-egypt-eng/",
      "Foreign Secretary Ravinatha Aryasinha has urged for Sri Lanka to reclaim its economic prominence in Egypt to its traditional strength, aligning with their shared history and strong bilateral political relations. This call aims to enhance economic ties between the two countries and boost Sri Lanka's position in the Egyptian market.",
      "Ministry News"
    ],
    [
      "Foreign Minister Motegi reaffirms Japan’s support to broaden cooperation with Sri Lanka",
      "13.12.2019",
      "https://mfa.gov.lk/en/japans-cooperation-with-sri-lanka-eng/",
      "Japanese Foreign Minister Toshimitsu Motegi reaffirmed Japan’s support for broadening cooperation with Sri Lanka during a meeting with Foreign Minister Dinesh Gunawardena in Colombo. The two ministers recalled the significant milestones in their mutually rewarding relations.",
      "Ministry News"
    ],
    [
      "Foreign Minister calls for concrete action on SAARC intra-regional trade",
      "12.12.2019",
      "https://mfa.gov.lk/en/saarc-intra-regional-trade-eng/",
      "Foreign Minister Dinesh Gunawardena urged SAARC Member Countries to enhance intra-regional trade while addressing security concerns. He made the call during an event to commemorate the importance of strengthening trade relations within the region.",
      "Ministry News"
    ],
    [
      "Sri Lanka Elected Chair of Biological Weapons Convention Meet",
      "09.12.2019",
      "https://mfa.gov.lk/en/biological-weapons-eng/",
      "Sri Lanka has been elected as the Chair of the Meeting of States Parties to the Biological Weapons Convention. The endorsement came unanimously at the conclusion of the four-day session in Geneva.",
      "Ministry News"
    ],
    [
      "Message of Hon. Minister of Foreign Relations on the 35th SAARC Charter Day on 8 December 2019",
      "08.12.2019",
      "https://mfa.gov.lk/en/hon-min-eng/",
      "",
      "Ministry News"
    ],
    [
      "Message of Hon. Prime Minister on the 35th SAARC Charter Day on 8 December 2019",
      "08.12.2019",
      "https://mfa.gov.lk/en/hon-pm-eng/",
      "",
      "Ministry News"
    ],
    [
      "Message of H.E the President on the 35th SAARC Charter Day on 8 December 2019",
      "08.12.2019",
      "https://mfa.gov.lk/en/h-e-the-president-eng/",
      "",
      "Ministry News"
    ],
    [
      "Foreign Ministry comments on the Judgement in the Case of Brigadier Priyanka Fernando",
      "07.12.2019",
      "https://mfa.gov.lk/en/case-of-brigadier-priyanka-fernando-eng/",
      "The Foreign Ministry has commented on the judgement in the case of Majuran Sathananthan vs. Brigadier Andige Priyanka Indunil Fernando. The trial was completed at the Westminster Magistrates’ Court on 19 November 2019, with the Chief Magistrate delivering the verdict.",
      "Ministry News"
    ],
    [
      "Maldivian Foreign Minister Abdulla Shahid appreciates deep rooted bilateral relations",
      "06.12.2019",
      "https://mfa.gov.lk/en/maldivian-foreign-minister-eng/",
      "Maldivian Foreign Minister Abdulla Shahid expressed appreciation to Sri Lanka's Foreign Minister Dinesh Gunawardena for their longstanding partnership in socio-economic development, highlighting the deep-rooted bilateral relations between the two countries.",
      "Ministry News"
    ],
    [
      "Media Statement : Sri Lanka’s High Commissioner protests on Conservative Party manifesto  reference to Sri Lanka",
      "04.12.2019",
      "https://mfa.gov.lk/en/media-statement-13-eng/",
      "The Ministry of Foreign Relations has noted remarks by MP Udaya Gammanpila on 3 December 2019 regarding Sri Lanka's mention in the Conservative Party manifesto. Sri Lanka's High Commissioner has lodged a protest over this reference.",
      "Ministry News"
    ],
    [
      "Pakistan Foreign Minister Qureshi calls for optimising bilateral economic linkages",
      "03.12.2019",
      "https://mfa.gov.lk/en/pakistan-fm-visit-eng/",
      "Pakistan Foreign Minister Makhdoom Shah Mehmood Qureshi visited Sri Lanka for a two-day trip and met with Foreign Minister Dinesh Gunawardena to discuss enhancing bilateral economic ties. The meeting took place at the Foreign Ministry on Monday, where they focused on optimizing economic linkages between the two countries.",
      "Ministry News"
    ],
    [
      "Update on the alleged incident relating to Swiss Embassy staff member",
      "01.12.2019",
      "https://mfa.gov.lk/en/updte-swiss_eng/",
      "The Government of Sri Lanka responded promptly to the alleged criminal incident involving a Swiss Embassy staff member in Colombo on November 25, 2019. They have taken serious action following the incident.",
      "Ministry News"
    ],
    [
      "UNODC Director Operations Miwa Kato calls on Foreign Minister Gunawardena",
      "29.11.2019",
      "https://mfa.gov.lk/en/unodc-director-operations-eng/",
      "UNODC Director of Operations, Miwa Kato, visited Foreign Minister Dinesh Gunawardena at the Ministry on November 28, 2019. During the meeting, the Minister expressed appreciation for the visit.",
      "Ministry News"
    ],
    [
      "State Minister Susil Premajayantha reiterates need to maintain close ties with neighbouring states",
      "29.11.2019",
      "https://mfa.gov.lk/en/state-minister-eng/",
      "State Minister Susil Premajayantha emphasized the importance of maintaining strong relationships with neighboring states during his assumption of duties as the State Minister of International Cooperation on 28 November 2019. He was welcomed by Foreign Secretary Ravinatha Aryasinha and other senior officials upon his arrival.",
      "Ministry News"
    ],
    [
      "President Gotabaya Rajapaksa undertakes State Visit to India",
      "28.11.2019",
      "https://mfa.gov.lk/en/state-visit_india_eng/",
      "President Gotabaya Rajapaksa is set to undertake a State Visit to India on November 29-30, 2019, following an invitation from Prime Minister Narendra Modi. The visit will include meetings with Indian officials, including Prime Minister Modi.",
      "Ministry News"
    ],
    [
      "Alleged incident relating to Swiss Embassy staff member",
      "28.11.2019",
      "https://mfa.gov.lk/en/alleged-incident-relating-to-swiss-embassy-staff-member/",
      "The Government of Sri Lanka has expressed concern over an alleged criminal incident involving a locally recruited staff member of the Swiss Embassy in Colombo on November 25, 2019. Authorities are investigating the matter to determine the facts surrounding the incident.",
      "Ministry News"
    ],
    [
      "Minister Dinesh Gunawardena calls on Foreign Ministry Officials to rise to new challenges",
      "27.11.2019",
      "https://mfa.gov.lk/en/minister-dinesh-gunawardena-calla-on-mfa-eng/",
      "Minister of Foreign Relations Dinesh Gunawardena assumed duties at the Foreign Ministry on Monday, November 25, 2019. He was received by Foreign Secretary Ravinatha Aryasinha and other senior officials, calling on them to rise to new challenges. Gunawardena urged the Foreign Ministry officials to be prepared for the evolving global landscape.",
      "Ministry News"
    ],
    [
      "Sri Lanka has provided valuable case studies of successes and challenges in operationalization of IHL and Humanitarian Diplomacy – Foreign Secretary Aryasinha",
      "12.11.2019",
      "https://mfa.gov.lk/en/srilankaihl-eng/",
      "Foreign Secretary Ravinatha Aryasinha highlighted that Sri Lanka has offered valuable case studies over the past four decades, showcasing successes and challenges in implementing International Humanitarian Law and Humanitarian Diplomacy to the global community.",
      "Ministry News"
    ],
    [
      "Commonwealth Secretary General visits mangrove site on the sidelines of Commonwealth Law Ministers Conference in Colombo",
      "11.11.2019",
      "https://mfa.gov.lk/en/commonwealth-conference-colombo-eng/",
      "Commonwealth Secretary General, Rt. Hon. Patricia Scotland, visited a mangrove site in Colombo during the Commonwealth Law Ministers Conference. She was accompanied by officials from the Ministries of Foreign Affairs and Mahaweli Development & Environment, along with representatives from INSEE.",
      "Ministry News"
    ],
    [
      "Foreign Secretary Aryasinha calls for Indian Ocean security architecture that gives priority to the littoral states and sensitive to the interests of all maritime users",
      "10.11.2019",
      "https://mfa.gov.lk/en/iora-abu-dhabi/",
      "Foreign Secretary Ravinatha Aryasinha advocates for an Indian Ocean security architecture that prioritizes the littoral states and considers the interests of all maritime users. This framework aims to address regional security challenges effectively.",
      "Ministry News"
    ],
    [
      "Sri Lanka and Poland pledge to enhance connectivity and economic cooperation",
      "08.11.2019",
      "https://mfa.gov.lk/en/sri-lanka-and-poland-eng/",
      "Sri Lanka and Poland have pledged to enhance connectivity and economic cooperation. This commitment was solidified through the signing of a Memorandum of Understanding on the Establishment of a Political Consultations Mechanism between the State Minister of Foreign Affairs of Sri Lanka, Vasantha Senanayake, and the Deputy Foreign Minister of Poland, Maciej Lang.",
      "Ministry News"
    ],
    [
      "Appointment of the Ambassador Extraordinary and Plenipotentiary of the Delegation of the European Union to Sri Lanka",
      "04.11.2019",
      "https://mfa.gov.lk/en/ambassador-eu-eng/",
      "The Delegation of the European Union, with the approval of the Government of Sri Lanka, has named Mr. Denis Chaibi as the Ambassador Extraordinary and Plenipotentiary to Sri Lanka. Mr. Chaibi will represent the European Union in diplomatic matters in Sri Lanka.",
      "Ministry News"
    ],
    [
      "Appointment of the High Commissioner of Federal Republic of Nigeria to Sri Lanka",
      "04.11.2019",
      "https://mfa.gov.lk/en/high-commissioner-nigeria-eng/",
      "The Government of Nigeria, in agreement with Sri Lanka, has appointed Maj. Gen. Chris Eze (Rtd.) as the new High Commissioner of Nigeria to Sri Lanka.",
      "Ministry News"
    ],
    [
      "Appointment of the Ambassador Extraordinary and Plenipotentiary of the Republic of Lebanon to Sri Lanka",
      "04.11.2019",
      "https://mfa.gov.lk/en/ambassador-lebanon-eng/",
      "The Government of Lebanon, with the approval of Sri Lanka, has named Mr. Rabie Narsh as the new Ambassador Extraordinary and Plenipotentiary of Lebanon to Sri Lanka. Mr. Narsh will represent Lebanon in Sri Lanka in his diplomatic capacity.",
      "Ministry News"
    ],
    [
      "Sri Lanka calls for collective action to address contemporary global challenges",
      "27.10.2019",
      "https://mfa.gov.lk/en/nam-18-summit-eng/",
      "At the 18th Summit of the Non-Aligned Movement in Baku, Azerbaijan on October 26, 2019, Foreign Minister Tilak Marapana reiterated Sri Lanka's dedication to the core principles of the NAM. He called for collective action to tackle contemporary global challenges, emphasizing the importance of unity among member nations.",
      "Ministry News"
    ],
    [
      "Foreign Minister Tilak Marapana leads Sri Lanka Delegation to the 18th Summit of the Non-Aligned Movement",
      "24.10.2019",
      "https://mfa.gov.lk/en/nam-2019-eng/",
      "Foreign Minister Tilak Marapana is leading the Sri Lanka delegation to the 18th Summit of the Non-Aligned Movement in Baku, Azerbaijan. He arrived in Baku on Tuesday for the summit, which brings together Heads of State and Government from NAM member countries.",
      "Ministry News"
    ],
    [
      "Foreign Secretary Aryasinha emphasizes Sri Lanka’s commitment towards an overarching security architecture in the Indian Ocean Region",
      "23.10.2019",
      "https://mfa.gov.lk/en/galle-dialogue-2019-eng/",
      "Foreign Secretary Ravinatha Aryasinha highlights Sri Lanka's dedication to establishing a comprehensive security framework in the Indian Ocean Region. He stresses the importance of developing institutional structures to effectively address security challenges in the area.",
      "Ministry News"
    ],
    [
      "Foreign Ministry comments on the case of Brigadier Priyanka Fernando in London",
      "19.10.2019",
      "https://mfa.gov.lk/en/fm-on-brigd-piyanka-case/",
      "The retrial of Brigadier Priyanka Fernando in London, in the case of Majuran Sathananthan vs. Brigadier Andige Priyanka Indunil Fernando, began on October 18, 2019, at the Westminster Magistrates’ Court. The Court listened to the arguments presented by the private prosecutor during the proceedings.",
      "Ministry News"
    ],
    [
      "Visit to Venezuela by State Minister of Foreign Affairs",
      "17.10.2019",
      "https://mfa.gov.lk/en/visit-to-venezuela-eng/",
      "During the recent official visit to Venezuela, State Minister of Foreign Affairs Vasantha Senanayake was greeted by President Nicolas Maduro during a courtesy call.",
      "Ministry News"
    ],
    [
      "Condolence Message of the Late Ven. Kurunegoda Piyatissa Maha Thero Chief Incumbent of New York Maha Vihara",
      "16.10.2019",
      "https://mfa.gov.lk/en/condolence-message-of-the-late-ven-kurunegoda-piyatissa-maha-thero-chief-incumbent-of-new-york-maha-vihara/",
      "Condolences are being offered following the passing of the Late Ven. Kurunegoda Piyatissa Maha Thero, Chief Incumbent of New York Maha Vihara. The community mourns the loss of the respected spiritual leader.",
      "Ministry News"
    ],
    [
      "Colombo meeting presses for rationalization of areas of cooperation and adoption of a BIMSTEC Charter",
      "16.10.2019",
      "https://mfa.gov.lk/en/bimstec-charter-eng/",
      "At the Colombo meeting, participants discussed rationalizing areas of cooperation within BIMSTEC and the adoption of a BIMSTEC Charter. The meeting also involved deliberations on a draft Memorandum of Understanding.",
      "Ministry News"
    ],
    [
      "Sri Lanka assures support to further the Global Disarmament Agenda",
      "13.10.2019",
      "https://mfa.gov.lk/en/global-disarmament-agenda-eng/",
      "Sri Lanka's Foreign Secretary Ravinatha Aryasinha has assured the UN High Representative on Disarmament, Izumi Nakamitsu, of Sri Lanka's support to further the Global Disarmament Agenda. The commitment was made during a meeting between the two officials.",
      "Ministry News"
    ],
    [
      "Sri Lanka hosts the First Meeting of the Mangrove Ecosystems and Livelihood Action Group under the Commonwealth Blue Charter",
      "12.10.2019",
      "https://mfa.gov.lk/en/cw-blue-charter-melag-eng/",
      "Sri Lanka hosted the First Meeting of the Mangrove Ecosystems and Livelihood Action Group (MELAG) under the Commonwealth Blue Charter from 7 to 9 October 2019 in Negombo. The event brought together participants to discuss conservation efforts and sustainable livelihoods in mangrove ecosystems.",
      "Ministry News"
    ],
    [
      "At UNGA Sri Lanka calls for an integrated and balanced                                     approach in the prevention of drug use and abuse",
      "11.10.2019",
      "https://mfa.gov.lk/en/sri-lanka-at-unga-eng/",
      "At the UNGA, Sri Lanka emphasized the need for an integrated and balanced approach to prevent drug use and abuse. The country highlighted the importance of reducing both supply and demand, as well as combating trafficking to address this issue effectively.",
      "Ministry News"
    ],
    [
      "Notice to Members of the General Public",
      "08.10.2019",
      "https://mfa.gov.lk/en/notice-eng/",
      "The Consular Affairs Division of the Ministry of Foreign Affairs is facing a slowdown in the electronic Document Attestation System (e-DAS) due to technical issues. This may cause delays in processing document attestations. We apologize for any inconvenience and are working to resolve the problem promptly.",
      "Ministry News"
    ],
    [
      "Esala Weerakoon approved as the next Secretary-General of SAARC",
      "06.10.2019",
      "https://mfa.gov.lk/en/esala-weerakoon-sec-gen-saarc-eng/",
      "Esala Weerakoon has been approved as the next Secretary-General of SAARC during the Informal Meeting of the Council of Ministers in New York. He is a former Foreign Secretary and senior diplomat.",
      "Ministry News"
    ],
    [
      "Appointment of the Ambassador of the Federal Democratic Republic of Ethiopia to Sri Lanka",
      "03.10.2019",
      "https://mfa.gov.lk/en/credentials-ethiopia-eng/",
      "The Government of the Federal Democratic Republic of Ethiopia, in agreement with the Government of Sri Lanka, has appointed Mrs. Tizita Mulugeta as the Ambassador of Ethiopia to Sri Lanka. Mrs. Mulugeta will represent Ethiopia in her new role in Sri Lanka.",
      "Ministry News"
    ],
    [
      "Appointment of the Ambassador of the Bolivarian Republic of Venezuela",
      "03.10.2019",
      "https://mfa.gov.lk/en/credentials-bolivarian-eng/",
      "The Government of the Bolivarian Republic of Venezuela, with the agreement of the Government of Sri Lanka, has appointed Mrs. Coromoto Godoy Calderon as the new Ambassador of Venezuela to Sri Lanka. Mrs. Calderon will represent Venezuela in Sri Lanka as its official diplomatic representative.",
      "Ministry News"
    ],
    [
      "Appointment of the Ambassador of Ireland to Sri Lanka",
      "03.10.2019",
      "https://mfa.gov.lk/en/credentials-ireland-eng/",
      "The Government of Ireland, with the agreement of the Government of Sri Lanka, has appointed Mr. Brendan Ward as the new Ambassador of Ireland to Sri Lanka, succeeding H.E. (Mr.) Brian McElduff. Mr. Ward has already presented his credentials.",
      "Ministry News"
    ],
    [
      "Appointment of the Ambassador of the Republic of Bulgaria to Sri Lanka",
      "03.10.2019",
      "https://mfa.gov.lk/en/credentials-bulgaria-eng/",
      "The Government of the Republic of Bulgaria, with the approval of the Government of Sri Lanka, has appointed Mrs. Eleonora Dimitrova Dimitrova as the new Ambassador of Bulgaria to Sri Lanka. Mrs. Dimitrova Dimitrova will assume the role in succession.",
      "Ministry News"
    ],
    [
      "Appointment of the Ambassador of the Republic of Chile to Sri Lanka",
      "03.10.2019",
      "https://mfa.gov.lk/en/credentials-chile-eng/",
      "The Government of the Republic of Chile, with the concurrence of Sri Lanka, has appointed Mr. Juan Rolando Angulo Monsalve as the new Ambassador of Chile to Sri Lanka, succeeding H.E. [Ambassador's name].",
      "Ministry News"
    ],
    [
      "Appointment of the Ambassador of the Hellenic Republic to Sri Lanka",
      "03.10.2019",
      "https://mfa.gov.lk/en/credentials-hellenic-eng/",
      "The Government of the Hellenic Republic, in agreement with the Government of Sri Lanka, has named Mr. Dionyssios Kyvetos as the new Ambassador of the Hellenic Republic to Sri Lanka, succeeding H.E. (Mr.) Pan.",
      "Ministry News"
    ],
    [
      "Appointment of the High Commissioner of the Republic of Namibia to Sri Lanka",
      "03.10.2019",
      "https://mfa.gov.lk/en/credentials-namibia-eng/",
      "The Government of the Republic of Namibia, with the approval of the Government of Sri Lanka, has appointed Mr. Gabriel Pandureni Sinimbo as the new High Commissioner of Namibia to Sri Lanka. He succeeds the previous High Commissioner in this role.",
      "Ministry News"
    ],
    [
      "Appointment of the Ambassador of the Republic of Guinea to Sri Lanka",
      "03.10.2019",
      "https://mfa.gov.lk/en/credentials-guinea-eng/",
      "The Government of the Republic of Guinea, with the concurrence of the Government of Sri Lanka, has appointed Mrs. Fatoumata Balde as the new Ambassador of the Republic of Guinea to Sri Lanka, succeeding H.E. (Mr.) Alexa.",
      "Ministry News"
    ],
    [
      "Appointment of the Ambassador of the Republic of the Sudan to Sri Lanka",
      "03.10.2019",
      "https://mfa.gov.lk/en/credentials-sudan-eng/",
      "The Government of the Republic of the Sudan, with the agreement of the Government of Sri Lanka, has named Mr. Ahmed Yousif Mohamed Elsiddig as the new Ambassador of the Republic of the Sudan to Sri Lanka.",
      "Ministry News"
    ],
    [
      "Appointment of the Ambassador of Bosnia & Herzegovina to Sri Lanka",
      "03.10.2019",
      "https://mfa.gov.lk/en/credintials-bosnia-eng/",
      "The Government of Bosnia & Herzegovina, with the approval of the Government of Sri Lanka, has appointed Mr. Muhamed Čengić as the new Ambassador of Bosnia & Herzegovina to Sri Lanka. He will succeed the previous ambassador in this role.",
      "Ministry News"
    ],
    [
      "Appointment of the Ambassador of the Portuguese Republic to Sri Lanka",
      "03.10.2019",
      "https://mfa.gov.lk/en/credentials-portuguese-eng/",
      "The Government of the Portuguese Republic, with the agreement of the Government of Sri Lanka, has named Mr. Carlos José de Pinho e Melo Pereira Marques as the new Ambassador of the Portuguese Republic to Sri Lanka.",
      "Ministry News"
    ],
    [
      "Appointment of the Ambassador of the Republic of Benin to Sri Lanka",
      "03.10.2019",
      "https://mfa.gov.lk/en/credentials-benin-eng/",
      "The Government of the Republic of Benin, in agreement with the Government of Sri Lanka, has appointed Mr. Makarimi Abissola Adechoubou as the new Ambassador of Benin to Sri Lanka, succeeding H.E. [Ambassador's name].",
      "Ministry News"
    ],
    [
      "Appointment of the Ambassador of the Kingdom of Belgium to Sri Lanka",
      "03.10.2019",
      "https://mfa.gov.lk/en/credentials-belgium-eng/",
      "The Government of Belgium, with the approval of Sri Lanka, has appointed Mr. François Delhaye as the new Ambassador to Sri Lanka, succeeding H.E. (Mr.) J. This appointment signifies a new chapter in diplomatic relations between the two countries.",
      "Ministry News"
    ],
    [
      "Appointment of the High Commissioner of the Kingdom of Eswatini to Sri Lanka",
      "03.10.2019",
      "https://mfa.gov.lk/en/credentials-eswatini-eng/",
      "The Government of the Kingdom of Eswatini, in agreement with the Government of Sri Lanka, has appointed Mr. Mlondi Solomon Dlamini as the new High Commissioner of Eswatini to Sri Lanka. Mr. Dlamini will assume the role in succession.",
      "Ministry News"
    ],
    [
      "Sri Lanka says tangible assistance needed to consolidate on Sri Lanka’s restoration of normalcy post 21/4",
      "02.10.2019",
      "https://mfa.gov.lk/en/normalcy-post-214-eng/",
      "Sri Lanka's Foreign Secretary, Ravinatha Aryasinha, leading the delegation to the UN General Assembly, met with Mr. Vladimir Voronkov to discuss the need for tangible assistance in consolidating the country's restoration of normalcy post the 21/4 attacks. Sri Lanka emphasizes the importance of international support in this process.",
      "Ministry News"
    ],
    [
      "Address to the 74th UN General Assembly by Mr. Ravinatha P Aryasinha, Secretary, Foreign Affairs and Leader of the Delegation of Sri Lanka – 30 September 2019",
      "01.10.2019",
      "https://mfa.gov.lk/en/74th-unga-eng/",
      "On September 30, 2019, Mr. Ravinatha P Aryasinha, Secretary of Foreign Affairs and Leader of the Sri Lankan Delegation, addressed the 74th UN General Assembly. He delivered a speech in the presence of the President, Secretary-General, and Excellencies.",
      "Ministry News"
    ],
    [
      "Foreign Secretary Aryasinha discusses obstacles placed on Sri Lanka’s Peacekeeping Contribution to the UN",
      "28.09.2019",
      "https://mfa.gov.lk/en/sl-peacekeeping-contribution-to-un/",
      "Foreign Secretary Ravinatha Aryasinha and Sri Lanka's delegation, including the Permanent Representative to the UN, met with the Under Secretary General of the United Nations in New York to discuss obstacles hindering Sri Lanka's Peacekeeping Contribution to the UN.",
      "Ministry News"
    ],
    [
      "Foreign Secretary Aryasinha welcomes proposal for Maldives’ readmission to Commonwealth",
      "28.09.2019",
      "https://mfa.gov.lk/en/maldives-readmission-to-cw/",
      "Foreign Secretary Ravinatha Aryasinha led the Sri Lanka Delegation at the Commonwealth Foreign Affairs Ministers Meeting in New York on September 26, 2019, during the 74th Session of the United Nations. He welcomed the proposal for the Maldives' readmission to the Commonwealth.",
      "Ministry News"
    ],
    [
      "Foreign Secretary Aryasinha underscores the relevance of the Bandung Principles as global multilateral mechanisms come under strain",
      "27.09.2019",
      "https://mfa.gov.lk/en/foreign-secretary-at-un-eng/",
      "Foreign Secretary Ravinatha Aryasinha emphasized the relevance of the Bandung Principles during his address at the Ministerial Meeting of the Non-Aligned Movement (NAM) on September 26, 2019, at the UN Headquarters in New York. He highlighted this significance as global multilateral mechanisms face increasing strain, coinciding with the 74th Session of the United Nations.",
      "Ministry News"
    ],
    [
      "Comment of the Deputy Spokesman for the UN Secretary General",
      "26.09.2019",
      "https://mfa.gov.lk/en/un-peace-operations-eng/",
      "The Deputy Spokesman for the UN Secretary-General announced on September 25, 2019, that the UN Department of Peace Operations will repatriate a Sri Lankan Army unit and individual officials.",
      "Ministry News"
    ],
    [
      "Sri Lanka condemns drone attacks in Saudi Arabia",
      "24.09.2019",
      "https://mfa.gov.lk/en/attacks-in-saudi-arabia-eng/",
      "Sri Lanka has condemned the drone attacks on the Abqaiq oil processing facility and Khurais oil field in Saudi Arabia. The country, having experienced terrorism for thirty years, remains steadfast in its commitment to denounce such acts of violence.",
      "Ministry News"
    ],
    [
      "Foreign Ministry Led 8th Integrated Consular Mobile Service Concludes  in the Nuwara Eliya District",
      "23.09.2019",
      "https://mfa.gov.lk/en/consular-mobile-service-nuwara-eliya-eng/",
      "The Ministry of Foreign Affairs, led by Foreign Minister Tilak Marapana, successfully concluded the 8th Integrated Consular Mobile Service in the Nuwara Eliya District. This service aimed to provide consular assistance and services to the local community, enhancing accessibility and efficiency in consular affairs.",
      "Ministry News"
    ],
    [
      "Sri Lanka and Australia conclude First Maritime Dialogue and Third Round of Senior Officials’ Talks in Colombo",
      "20.09.2019",
      "https://mfa.gov.lk/en/first-maritime-dialogue-sl-aus-eng/",
      "Sri Lanka and Australia concluded their First Maritime Dialogue and Third Round of Senior Officials’ Talks in Colombo. The talks, held at the Ministry of Foreign Affairs on September 17, 2019, were led by the Sri Lankan delegation headed by Additional Secretary for Bilateral Affairs.",
      "Ministry News"
    ],
    [
      "Statement by Deputy Permanent Representative of Sri Lanka to the United Nations in Geneva, Dayani Mendis, at the 42nd Session of the Human Rights Council – 11 September 2019",
      "13.09.2019",
      "https://mfa.gov.lk/en/statement-by-dpr-unhrc-eng/",
      "Dayani Mendis, Deputy Permanent Representative of Sri Lanka to the United Nations in Geneva, addressed the 42nd Session of the Human Rights Council on September 11, 2019. Mendis referred to the follow-up report of the Working Group on enforced disappearances regarding the implementation of recommendations made after their 2015 visit to Sri Lanka.",
      "Ministry News"
    ],
    [
      "Statement by Permanent Representative of Sri Lanka to the United Nations in Geneva, Ambassador A.L.A. Azeez, at the 42nd Session of the Human Rights Council – 11 September 2019",
      "11.09.2019",
      "https://mfa.gov.lk/en/42nd-hrc-11-09-2019-eng/",
      "At the 42nd Session of the Human Rights Council on September 11, 2019, Sri Lanka's Permanent Representative to the United Nations in Geneva, Ambassador A.L.A. Azeez, highlighted the resilience of Sri Lanka's security forces following the terrorist attacks on Easter Sunday over 4 months ago.",
      "Ministry News"
    ],
    [
      "Sri Lanka and Australia to strengthen cooperation to counter people smuggling",
      "05.09.2019",
      "https://mfa.gov.lk/en/sl-aus-to-strengthen-cooperation_eng/",
      "Sri Lanka and Australia have reaffirmed their commitment to combat people smuggling by exploring ways to enhance cooperation in response to the recent increase in smuggling activities. The two countries are working together to address the escalating challenges posed by illegal ventures.",
      "Ministry News"
    ],
    [
      "Sri Lanka seeks assistance in preventing violent extremism",
      "03.09.2019",
      "https://mfa.gov.lk/en/preventing-violent-extreamism-eng/",
      "Sri Lanka has requested assistance from the Global Community Engagement & Resilience Fund (GCERF) to prevent violent extremism following the Easter Sunday attacks. The country aims to enhance its expertise in countering violent extremism in the current scenario.",
      "Ministry News"
    ],
    [
      "Valedictory address by Mr. Ravinatha Aryasinha, Secretary, Ministry of  Foreign Affairs at  Colombo Defence Seminar on 30 August 2019",
      "01.09.2019",
      "https://mfa.gov.lk/en/valedictory-address-by-mr-ravinatha-aryasinha-secretary-ministry-of-foreign-affairs-at-colombo-defence-seminar-on-30-august-2019/",
      "Mr. Ravinatha Aryasinha, Secretary of the Ministry of Foreign Affairs, delivered the valedictory address at the Colombo Defence Seminar on August 30, 2019. He commended the Sri Lanka Army for organizing the seminar for the 9th consecutive year, emphasizing its growing international significance.",
      "Ministry News"
    ],
    [
      "Foreign Secretary Aryasinha says Post 21/4 a ‘litmus test’  for Sri Lanka in protecting human rights while fighting terrorism",
      "01.09.2019",
      "https://mfa.gov.lk/en/sfa_cmb-defence_eng/",
      "Foreign Secretary Ravinatha Aryasinha stated that the period after 21/4 serves as a crucial test for Sri Lanka in balancing human rights protection with counterterrorism efforts. This phase will reveal both the country's commitment to human rights standards and areas needing improvement.",
      "Ministry News"
    ],
    [
      "Joint Press Release Following the Meeting of the European Union-Sri Lanka 4th Working Group on Good Governance, Rule of Law and Human Rights",
      "31.08.2019",
      "https://mfa.gov.lk/en/eu_sl_jointpress_4thwg_eng/",
      "The European Union-Sri Lanka 4th Working Group on Good Governance, Rule of Law, and Human Rights met in Colombo on August 30, 2019. The meeting was part of the Joint Commission discussions, focusing on enhancing governance and human rights practices. This meeting signifies ongoing efforts to strengthen cooperation between the EU and Sri Lanka in these critical areas.",
      "Ministry News"
    ],
    [
      "Sri Lanka and Venezuela agree to forge closer bilateral ties",
      "28.08.2019",
      "https://mfa.gov.lk/en/sri-lanka-and-venezuela-agree-to-forge-closer-bilateral-ties/",
      "Sri Lanka and Venezuela have agreed to strengthen their bilateral ties, with State Minister of Foreign Affairs Vasantha Senanayake meeting Venezuelan Vice Minister of Foreign Affairs Ruben Dario Molina during his official visit to Sri Lanka. The meeting took place at the Foreign Ministry, signaling a commitment to enhancing cooperation between the two countries.",
      "Ministry News"
    ],
    [
      "Integrated Consular Mobile Service [ICMS] Conducted in Kurunegala and Dambulla",
      "23.08.2019",
      "https://mfa.gov.lk/en/icms_eng/",
      "The Ministry organized an Integrated Consular Mobile Service in Kurunegala and Dambulla under the guidance of Foreign Minister Tilak Marapana, benefiting the general public from distant regions. This initiative aimed to provide consular outreach services to residents in these areas.",
      "Ministry News"
    ],
    [
      "Appointment of Lt. Gen. Shavendra Silva, Commander of the Sri Lanka Army",
      "20.08.2019",
      "https://mfa.gov.lk/en/sl-army-com_eng/",
      "Lt. Gen. Shavendra Silva has been appointed as the Commander of the Sri Lanka Army, a decision made by the Head of State. The appointment has sparked various comments and discussions.",
      "Ministry News"
    ],
    [
      "Appointment of the Ambassador of the Kingdom of the Netherlands to Sri Lanka",
      "19.08.2019",
      "https://mfa.gov.lk/en/netherlands-eng/",
      "The Government of the Kingdom of the Netherlands, with the approval of the Government of Sri Lanka, has appointed Mrs. Tanja Gonggrijp as the new Ambassador of the Netherlands to Sri Lanka. She succeeds [mention name of the predecessor].",
      "Ministry News"
    ],
    [
      "Appointment of the High Commissioner of the United Kingdom of Great Britain and Northern Ireland to Sri Lanka",
      "19.08.2019",
      "https://mfa.gov.lk/en/uk_eng/",
      "The Government of the United Kingdom, in agreement with Sri Lanka, has appointed Mrs. Sarah Anne Pascale Hulton as the High Commissioner of the United Kingdom of Great Britain and Northern Ireland to Sri Lanka.",
      "Ministry News"
    ],
    [
      "Appointment of the Ambassador of the Kingdom of Norway to Sri Lanka",
      "19.08.2019",
      "https://mfa.gov.lk/en/norway_eng/",
      "The Government of the Kingdom of Norway, with the approval of the Government of Sri Lanka, has named Ms. Trine Jøranli Eskedal as the new Ambassador of Norway to Sri Lanka, succeeding H.E. Thorbjør.",
      "Ministry News"
    ],
    [
      "Sri Lanka led IORA Maritime Safety and Security Working Group finalizes Work Plan",
      "18.08.2019",
      "https://mfa.gov.lk/en/iora_wg-_eng/",
      "Sri Lanka, leading the IORA Maritime Safety and Security Working Group, finalized its Work Plan during the First Meeting held in Colombo on 8-9 August. The meeting included 22 foreign delegates representing IORA member countries, focusing on enhancing maritime safety and security in the region.",
      "Ministry News"
    ],
    [
      "UN Special Rapporteur on Freedom of Religion or Belief visits Sri Lanka",
      "16.08.2019",
      "https://mfa.gov.lk/en/un-special-rapporteur-eng-2/",
      "The UN Special Rapporteur on Freedom of Religion or Belief, Ahmed Shaheed, began his official visit to Sri Lanka from August 15 to 26. He met with Minister Tilak Marapana at the Ministry of Foreign Affairs to discuss religious freedom issues in the country.",
      "Ministry News"
    ],
    [
      "Thirteen new Heads of Mission approved by High Posts Committee –\tCareer HOM ratio rises from 37% to 54% within this year",
      "10.08.2019",
      "https://mfa.gov.lk/en/appointment-of-hom_eng/",
      "Thirteen new Heads of Mission have been approved by the High Posts Committee, increasing the Career HOM ratio from 37% to 54% this year. The Committee on High Posts of the Parliament of Sri Lanka has examined and approved the appointments.",
      "Ministry News"
    ],
    [
      "Sri Lanka-Cambodia Joint Statement",
      "10.08.2019",
      "https://mfa.gov.lk/en/sri-lanka-cambodia_eng/",
      "Sri Lanka's President Maithripala Sirisena visited Cambodia at the invitation of King Norodom Sihamoni. The two countries issued a joint statement during the state visit.",
      "Ministry News"
    ],
    [
      "Foreign Secretary Aryasinha calls for early inclusion of Sri Lanka as an ASEAN Sectoral Dialogue Partner",
      "09.08.2019",
      "https://mfa.gov.lk/en/asean-press-release-eng/",
      "Foreign Secretary Ravinatha Aryasinha urged ASEAN on Thursday to promptly include Sri Lanka as an ASEAN Sectoral Dialogue Partner to enhance engagement with the organization. This move aims to strengthen ties between Sri Lanka and ASEAN.",
      "Ministry News"
    ],
    [
      "Condolence Message from Hon. Tilak Marapana Minister of Foreign Affairs of Sri Lanka to Hon. (Dr.) Subrahmanyam Jaishankar,Minister of External Affairs of the Republic of India on the demise of the former External Affairs Minister Smt. Sushma Swaraj",
      "08.08.2019",
      "https://mfa.gov.lk/en/36017-2/",
      "",
      "Ministry News"
    ],
    [
      "Foreign Ministry to conduct Integrated Consular Mobile Services in Anuradhapura and Puttalam Districts",
      "06.08.2019",
      "https://mfa.gov.lk/en/foreign-ministry-to-conduct-integrated-consular-mobile-services-in-anuradhapura-and-puttalam-districts/",
      "The Foreign Ministry will conduct Integrated Consular Mobile Services in Anuradhapura and Puttalam Districts on August 17 and 19, 2019, respectively. This mobile consular service aims to provide assistance to residents in those areas.",
      "Ministry News"
    ],
    [
      "Sri Lanka hosts the first meeting of the IORA Maritime Safety and Security Working Group on 8th and 9th August 2019",
      "06.08.2019",
      "https://mfa.gov.lk/en/iora-maritime-sri-lanka-eng/",
      "Sri Lanka is hosting the first meeting of the Indian Ocean Rim Association (IORA) Maritime Safety and Security Working Group (MSSWG) in Colombo on 8th and 9th August 2019. The meeting aims to finalize the Work Plan for enhancing maritime safety and security in the region.",
      "Ministry News"
    ],
    [
      "Foreign Minister Marapana calls for increased cooperation to combat regional security challenges at the 26th ASEAN Regional Forum",
      "02.08.2019",
      "https://mfa.gov.lk/en/26th-asean-regional-forum-en/",
      "Foreign Minister Tilak Marapana emphasized the need for increased cooperation to address regional security challenges at the 26th ASEAN Regional Forum in Bangkok, Thailand on August 2, 2019. He called for concerted global efforts to counter traditional security threats and enhance regional stability.",
      "Ministry News"
    ],
    [
      "Special Statement by Hon. Tilak Marapana, Minister of Foreign Affairs in Parliament regarding the concerns raised over the visit of the Special Rapporteur on the freedom of assembly and of association",
      "25.07.2019",
      "https://mfa.gov.lk/en/special-statement-mfa-eng/",
      "In a special statement in Parliament, Hon. Tilak Marapana, Minister of Foreign Affairs, addressed concerns raised by Members regarding the visit of the Special Rapporteur on the freedom of assembly and of association on July 23 and 24.",
      "Ministry News"
    ],
    [
      "Germany charges suspect over 2005 killing of Sri Lanka Foreign Minister – Press Statement by the Federal General Prosecutor of Germany, 24.07.2019",
      "24.07.2019",
      "https://mfa.gov.lk/en/press-statement-gba/",
      "Germany's Federal Attorney General has charged a suspect with aiding and abetting the 2005 murder of Sri Lanka's Foreign Minister, linking the individual to the terrorist group LTTE. The charges were announced in a press statement by the Federal General Prosecutor of Germany on July 24, 2019.",
      "Ministry News"
    ],
    [
      "Foreign Ministry Conducts Consular Awareness Programmes and Mobile Services",
      "23.07.2019",
      "https://mfa.gov.lk/en/mfa_mobileconsular_eng/",
      "The Ministry of Foreign Affairs conducted Consular Awareness Programmes and Integrated Consular Mobile Services (ICMS) in Trincomalee and Ka, led by Foreign Minister Tilak Marapana. The programs aimed to provide consular services and information to the public.",
      "Ministry News"
    ],
    [
      "UN Special Rapporteur on the rights of freedom of association and peaceful assembly on country visit",
      "19.07.2019",
      "https://mfa.gov.lk/en/un-special-rapporteur-eng/",
      "UN Special Rapporteur on the rights of freedom of association and peaceful assembly, Mr. Clément Nyaletsossi Voule, has started his official country visit to Sri Lanka from July 18 to 26, 2019. During his visit, he met with the Foreign Minister.",
      "Ministry News"
    ],
    [
      "First Ad-Hoc Dialogue on Counter Terrorism Cooperation with EU in Colombo",
      "15.07.2019",
      "https://mfa.gov.lk/en/ct-eu-in-colombo-eng/",
      "A delegation led by EU Counter Terrorism Coordinator Gilles de Kerchove visited Sri Lanka from 11 to 16 July 2019 for the first EU-Sri Lanka Ad Hoc Dialogue on Counter Terrorism Cooperation. The dialogue aimed to enhance cooperation in combating terrorism and was co-chaired by representatives from both sides.",
      "Ministry News"
    ],
    [
      "Sri Lanka appreciates support and solidarity extended by the Commonwealth membership in the aftermath of the Easter Sunday tragedy",
      "14.07.2019",
      "https://mfa.gov.lk/en/commonwealth-membership-eng/",
      "Sri Lanka expressed gratitude for the support and solidarity from Commonwealth members following the Easter Sunday tragedy. Secretary of the Ministry of Foreign Affairs, Ravinatha Aryasinha, conveyed this appreciation during the Commonwealth Foreign Affairs Ministers Meeting on Wednesday, July 10.",
      "Ministry News"
    ],
    [
      "Establishment of Diplomatic Relations between Sri Lanka and Barbados",
      "01.07.2019",
      "https://mfa.gov.lk/en/establishment-of-diplomatic-relations-between-sri-lanka-and-barbados/",
      "Sri Lanka and Barbados have established diplomatic relations through the signing of an agreement by their respective ambassadors, H.E. Dr. Amrith Rohan Perera and H.E. Ms. H. Elizabeth Thompson at the United Nations. This agreement signifies a new chapter in the bilateral relations between the two countries.",
      "Ministry News"
    ],
    [
      "Commemoration of 60 Years of Diplomatic Ties between Sri Lanka and Cuba",
      "29.06.2019",
      "https://mfa.gov.lk/en/sri-lanka-and-cuba-60-yrs_eng/",
      "State Minister of Foreign Affairs Vasantha Senanayake visited the Republic of Cuba from June 25 to 29 to mark the 60th anniversary of diplomatic relations between Sri Lanka and Cuba. The visit aimed to commemorate the establishment of these ties and strengthen bilateral cooperation between the two countries.",
      "Ministry News"
    ],
    [
      "Establishment of Diplomatic Relations between Sri Lanka and Saint Lucia",
      "28.06.2019",
      "https://mfa.gov.lk/en/establishment-of-diplomatic-relations-between-sri-lanka-and-saint-lucia/",
      "Sri Lanka and Saint Lucia have established diplomatic relations with the signing of an agreement by their respective ambassadors, H.E. Dr. Amrith Rohan Perera and H.E. Mr. Cosmos Richardson at the United Nations. This agreement signifies a formal recognition of diplomatic ties between the two countries.",
      "Ministry News"
    ],
    [
      "Sri Lanka Updates HRC on Human Rights Measures taken to advance Human Rights, Peace and Security",
      "25.06.2019",
      "https://mfa.gov.lk/en/sl-updates-hrc-on-hr-eng/",
      "Sri Lanka's delegation updated the Human Rights Council on the progress made in addressing human rights concerns, national security imperatives, and reconciliation priorities. The briefing focused on measures taken to advance human rights, peace, and security in the country.",
      "Ministry News"
    ],
    [
      "Committee of Senior Officials of IORA successfully concluded in Durban, South Africa",
      "21.06.2019",
      "https://mfa.gov.lk/en/iora-eng-3/",
      "The ninth Bi-Annual Committee of Senior Officials (CSO) of the Indian Ocean Rim Association (IORA) successfully concluded in Durban, South Africa on June 20, 2019. The session was chaired by Ambassador Anil Sooklal, providing a platform for discussions and collaborations among IORA member states.",
      "Ministry News"
    ],
    [
      "President Duterte confers Order of Sikatuna on Ambassador Aruni Ranaraja",
      "19.06.2019",
      "https://mfa.gov.lk/en/president-duterte-confers-order-of-sikatuna-eng/",
      "President Rodrigo Roa Duterte conferred the Order of Sikatuna with the rank of Grand Cross (Datu), gold distinction on Ambassador Aruni Ranaraja of Sri Lanka on June 18, 2021.",
      "Ministry News"
    ],
    [
      "Foreign Minister Marapana and Hungarian counterpart Péter Szijjártó discuss roadmap for viable, results oriented and mutually beneficial Sri Lanka –Hungary bilateral partnership as two countries celebrate sixty years of diplomatic relations this year",
      "19.06.2019",
      "https://mfa.gov.lk/en/fm-visits-hungary-eng/",
      "Foreign Minister Tilak Marapana visited Budapest to hold bilateral discussions with Hungarian Foreign Affairs and Trade Minister Péter Szijjártó. The meeting focused on establishing a roadmap for a viable and mutually beneficial partnership between Sri Lanka and Hungary as the two countries mark sixty years of diplomatic relations this year.",
      "Ministry News"
    ],
    [
      "Consular Mobile Service conducted                                                                   in Mullaitivu, under ‘Rata Wenuwen Ekata Sitimu’ Programme",
      "19.06.2019",
      "https://mfa.gov.lk/en/con_mob_eng/",
      "The Ministry of Foreign Affairs conducted a Consular Mobile Service in Mullaitivu as part of the 'Rata Wenuwen Ekata Sitimu' Programme, under the guidance of President Maithripala Sirisena. This initiative aims to provide swift and efficient services to the public.",
      "Ministry News"
    ],
    [
      "Sri Lanka- Tajikistan President’s meet",
      "14.06.2019",
      "https://mfa.gov.lk/en/sri-lanka-tajikistan-presidents-meet/",
      "During a meeting between the Presidents of Sri Lanka and Tajikistan, they focused on enhancing bilateral relations through established mechanisms. President Maithripala Sirisena expressed his commitment to collaborating closely with other nations worldwide.",
      "Ministry News"
    ],
    [
      "Foreign Ministry Participates at the Rajya Sewaya Gamata Gena Yana Janatha Sewaya Programme",
      "13.06.2019",
      "https://mfa.gov.lk/en/mfa-in-jsp/",
      "The Ministry of Foreign Affairs took part in the inaugural 'Rajya Sewaya Gamata Gena Yana Janatha Sewaya' national program in Matale on June 1, 2019. They conducted a consular mobile service at the event premises. This initiative aimed to provide consular services to the public in a convenient manner.",
      "Ministry News"
    ],
    [
      "Sri Lanka to give effect to UN Security Council resolutions to counter terrorism and violent extremism",
      "12.06.2019",
      "https://mfa.gov.lk/en/un-asg-fm-eng/",
      "Sri Lanka is set to implement UN Security Council resolutions to combat terrorism and violent extremism, with a focus on collaborating with UN mechanisms in line with international norms. This initiative was highlighted during the recent visit to Sri Lanka by the UN Assistant Secretary General.",
      "Ministry News"
    ],
    [
      "Foreign Minister Marapana shares Sri Lanka experience in addressing sexual and gender based violence in humanitarian crises in Oslo",
      "07.06.2019",
      "https://mfa.gov.lk/en/fm-in-oslo-eng/",
      "Foreign Minister Tilak Marapana shared Sri Lanka's experience in addressing sexual and gender-based violence in humanitarian crises at an international conference in Oslo on May 24, 2019. He participated as a panelist at the event focused on 'Ending Sexual and Gender-based Violence in Humanitarian Crises'.",
      "Ministry News"
    ],
    [
      "HE Maithripala Sirisena, President of Sri Lanka attends the Swearing-in-Ceremony of Prime Minister Narendra Modi",
      "02.06.2019",
      "https://mfa.gov.lk/en/he-maithripala-sirisena-president-of-sri-lanka-attends-the-swearing-in-ceremony-of-prime-minister-narendra-modi/",
      "President Maithripala Sirisena of Sri Lanka attended the swearing-in ceremony of Indian Prime Minister Narendra Modi on May 30, 2019, during his two-day visit to New Delhi. The event took place at the Rashtrapati Bhavan. Leaders from Bangladesh and other countries were also present at the ceremony.",
      "Ministry News"
    ],
    [
      "State Minister of Foreign Affairs Vasantha Senanayake assumes duties",
      "29.05.2019",
      "https://mfa.gov.lk/en/state-min-eng/",
      "State Minister of Foreign Affairs Vasantha Senanayake officially began his duties at the Ministry of Foreign Affairs on May 29, 2019. He was sworn in as the State Minister earlier that morning.",
      "Ministry News"
    ],
    [
      "Sri Lanka’s response to the joint statement issued by the UN Special Advisor on the Prevention of Genocide and the Special Advisor on the Responsibility to Protect",
      "24.05.2019",
      "https://mfa.gov.lk/en/sri-lankas-response-to-the-joint-statement-issued-by-the-un-special-advisor-on-the-prevention-of-genocide-and-the-special-advisor-on-the-responsibility-to-protect/",
      "Sri Lanka has responded to the joint statement issued by the UN Special Advisor on the Prevention of Genocide, Adama Dieng, and the Special Advisor on the Responsibility to Protect, Karen Smith, on May 13, 2019. The country's reaction to the statement is being closely monitored by the international community.",
      "Ministry News"
    ],
    [
      "Foreign Minister Marapana on Official Visit to Washington D.C.",
      "18.05.2019",
      "https://mfa.gov.lk/en/fm_usa-visit_eng/",
      "Foreign Minister Tilak Marapana visited Washington D.C. from May 15-17 and met with U.S. Secretary of State Michael R. Pompeo on May 16. During the meeting, the Minister expressed Sri Lanka's appreciation for the bilateral relations between the two countries.",
      "Ministry News"
    ],
    [
      "Establishment of Diplomatic Relations between Sri Lanka and Nicaragua",
      "16.05.2019",
      "https://mfa.gov.lk/en/establishment-of-diplomatic-relations-between-sri-lanka-and-nicaragua/",
      "Sri Lanka and Nicaragua have established diplomatic relations with the signing of an agreement by their respective ambassadors to the United Nations, H.E. Dr. Amrith Rohan Perera and H.E. Mr. Jaime Hermida Castillo. This agreement signifies a new chapter in the bilateral relations between the two countries.",
      "Ministry News"
    ],
    [
      "Ministry of Foreign Affairs Conducts Consular Mobile Service in the Ampara District",
      "14.05.2019",
      "https://mfa.gov.lk/en/consular-ampara-eng/",
      "The Ministry of Foreign Affairs conducted a consular mobile service in the Ampara District at the Dehiaththakandiya Divisional Secretariat on May 10, 2019, as part of the 'Rata Wenuwen Ekata Sitimu' national programme. This initiative aimed to provide consular services to the local community.",
      "Ministry News"
    ],
    [
      "Establishment of Diplomatic Relations between Sri Lanka and The Gambia",
      "13.05.2019",
      "https://mfa.gov.lk/en/dip-relation-sl-gambia/",
      "Sri Lanka and The Gambia have established diplomatic relations through the signing of an agreement by their respective ambassadors, H.E. Dr. Amrith Rohan Perera and H.E. Mr. Lang Yabou at the United Nations. This agreement marks a significant step towards fostering bilateral ties between the two countries.",
      "Ministry News"
    ],
    [
      "First Session of political consultations between Sri Lanka and Turkey concludes in Colombo",
      "12.05.2019",
      "https://mfa.gov.lk/en/sl-turkey-bpc-eng/",
      "The first session of political consultations between Sri Lanka and Turkey concluded in Colombo on May 10, 2019, at the Ministry of Foreign Affairs. During the session, a new roadmap was established to enhance cooperation in prioritized sectors between the two countries.",
      "Ministry News"
    ],
    [
      "Update on foreign national casualties at explosions in Sri Lanka–06 May 2019",
      "06.05.2019",
      "https://mfa.gov.lk/en/update_06-may-2019/",
      "As of Monday, May 6, 2019, at 4:00 PM, a total of 44 foreign nationals have been identified as killed in the explosions in Sri Lanka. The casualties include one from Bangladesh, six from China, and eleven from India.",
      "Ministry News"
    ],
    [
      "ACD Ministers pledge solidarity with Sri Lanka following Easter Sunday terror attacks",
      "06.05.2019",
      "https://mfa.gov.lk/en/acd_eng/",
      "Ministers at the 16th Ministerial Meeting of the Asia Cooperation Dialogue (ACD) in Doha on May 1, 2019, expressed solidarity with Sri Lanka after the Easter Sunday terror attacks. The Ministerial Meeting was preceded by a gathering of Senior Officials and followed by the ACD Business Forum.",
      "Ministry News"
    ],
    [
      "Appointment of the Ambassador of the Kingdom of Bahrain to Sri Lanka",
      "06.05.2019",
      "https://mfa.gov.lk/en/cred-bahrain-eng/",
      "The Government of the Kingdom of Bahrain, with the approval of the Government of Sri Lanka, has named Mr. Abdulrahman Mohamed AlGaoud as the new Ambassador of Bahrain to Sri Lanka, succeeding H.E. This appointment strengthens diplomatic ties between the two nations.",
      "Ministry News"
    ],
    [
      "Appointment of the Ambassador of the Lao People’s Democratic Republic to Sri Lanka",
      "06.05.2019",
      "https://mfa.gov.lk/en/cred-laos-eng/",
      "The Government of the Lao People’s Democratic Republic, with the approval of the Government of Sri Lanka, has named Mr. Bounneme Chouanghom as the new Ambassador of the Lao People’s Democratic Republic to Sri Lanka. This appointment strengthens diplomatic relations between the two countries.",
      "Ministry News"
    ],
    [
      "Appointment of the Ambassador of the Republic of Lithuania to Sri Lanka",
      "06.05.2019",
      "https://mfa.gov.lk/en/cred-lithuania-eng/",
      "The Government of the Republic of Lithuania, with the agreement of the Government of Sri Lanka, has appointed Mr. Julius Pranevičius as the new Ambassador of Lithuania to Sri Lanka. Mr. Pranevičius will succeed the previous ambassador in representing Lithuania in Sri Lanka.",
      "Ministry News"
    ],
    [
      "Appointment of the Ambassador of the Republic of Latvia to Sri Lanka",
      "06.05.2019",
      "https://mfa.gov.lk/en/cred-latvia-eng/",
      "The Government of the Republic of Latvia, in agreement with the Government of Sri Lanka, has appointed Mr. Artis Bērtulis as the new Ambassador of Latvia to Sri Lanka. He has already presented his credentials in his new role.",
      "Ministry News"
    ],
    [
      "Appointment of the High Commissioner of the Commonwealth of Australia to Sri Lanka",
      "06.05.2019",
      "https://mfa.gov.lk/en/cred-australia-eng/",
      "The Government of the Commonwealth of Australia, with the approval of the Government of Sri Lanka, has appointed Mr. David John Holly as the new High Commissioner of Australia to Sri Lanka. Mr. Holly will assume this role in succession.",
      "Ministry News"
    ],
    [
      "Appointment of the Ambassador of the Republic of Argentina to Sri Lanka",
      "06.05.2019",
      "https://mfa.gov.lk/en/cred-argentina-eng/",
      "The Government of the Republic of Argentina, with the approval of the Government of Sri Lanka, has named Mr. Daniel Chuburu as the new Ambassador of Argentina to Sri Lanka, succeeding H.E. Raul Ig. This appointment signifies a change in diplomatic representation between the two countries.",
      "Ministry News"
    ],
    [
      "Appointment of the Ambassador of the Republic of Azerbaijan to Sri Lanka",
      "06.05.2019",
      "https://mfa.gov.lk/en/cred-azerbaijan-eng/",
      "The Government of the Republic of Azerbaijan, in agreement with the Government of Sri Lanka, has appointed Mr. Ashraf Farhad Shikhaliyev as the new Ambassador of Azerbaijan to Sri Lanka. Mr. Shikhaliyev succeeds the previous ambassador in this role.",
      "Ministry News"
    ],
    [
      "Update on foreign national casualties at explosions in Sri Lanka – 29 April 2019",
      "29.04.2019",
      "https://mfa.gov.lk/en/update-29-april-2019/",
      "As of Monday, April 29, 2019, at 5:00 PM, a total of 42 foreign nationals have been identified as killed in the explosions in Sri Lanka. The fatalities include one from Bangladesh, four from China, and eleven from India.",
      "Ministry News"
    ],
    [
      "Messages of Condolence on Easter Sunday Attacks",
      "29.04.2019",
      "https://mfa.gov.lk/en/messages-of-condolence-on-easter-sunday-attacks/",
      "Following the Easter Sunday attacks, numerous countries and organizations, including Afghanistan, Albania, Argentina, Australia, and others, have expressed messages of condolence. The global community stands united in mourning the victims of these tragic events.",
      "Ministry News"
    ],
    [
      "Update on foreign national casualties at explosions in Sri Lanka – 26 April 2019",
      "26.04.2019",
      "https://mfa.gov.lk/en/update-on-foreign-national-casualties-at-explosions-in-sri-lanka-26-april-2019/",
      "As of Friday, 26 April 2019 at 1800 hours, the number of identified foreign national casualties in the explosions in Sri Lanka remained at 40. The fatalities included one individual from Bangladesh, two from China, and eleven from India.",
      "Ministry News"
    ],
    [
      "Update on foreign national casualties at explosions in Sri Lanka – 25 April 2019",
      "25.04.2019",
      "https://mfa.gov.lk/en/update-on-foreign-national-casualties-at-explosions-in-sri-lanka-25-april-2019/",
      "As of Thursday, April 25, 2019, at 6:00 PM, a total of 40 foreign nationals have been identified as killed in the explosions in Sri Lanka. The fatalities include one individual from Bangladesh, two from China, eleven from India, and three others.",
      "Ministry News"
    ],
    [
      "Update on foreign national casualties at explosions in Sri Lanka – 24 April 2019",
      "24.04.2019",
      "https://mfa.gov.lk/en/update-24-april-2019/",
      "As of Wednesday, 24 April 2019 at 1900 hours, a total of 36 foreign nationals have been identified as killed in the explosions in Sri Lanka. The casualties include one individual from Bangladesh, two from China, and eleven from India.",
      "Ministry News"
    ],
    [
      "Update on foreign national casualties at explosions in Sri Lanka -23 April 2019",
      "23.04.2019",
      "https://mfa.gov.lk/en/update-on-fn_23-april-2019/",
      "As of Tuesday, April 23, 2019, at 4:00 pm, a total of 34 foreign nationals have been identified as killed in the explosions in Sri Lanka. The casualties include one individual from Bangladesh, two from China, ten from India, and three from [missing information].",
      "Ministry News"
    ],
    [
      "Update on foreign national casualties at explosions in Sri Lanka",
      "22.04.2019",
      "https://mfa.gov.lk/en/update-on_foreignnationals_sl/",
      "As of Monday, April 22, 2019, 7:00 pm, a total of 31 foreign nationals have been identified as killed in the explosions in Sri Lanka. The fatalities include one from Bangladesh, two from China, eight from India, and one from France.",
      "Ministry News"
    ],
    [
      "Foreign national casualties at explosions in Sri Lanka",
      "21.04.2019",
      "https://mfa.gov.lk/en/media-release-7/",
      "Eleven foreign nationals have been identified as deceased at the National Hospital in Colombo following the explosions in Colombo, Negombo, and Batticaloa earlier today. The casualties include individuals from various countries.",
      "Ministry News"
    ],
    [
      "Foreign Ministry Conducts Mobile Consular Service in the Batticaloa District",
      "12.04.2019",
      "https://mfa.gov.lk/en/mobile-consular-eng-2/",
      "The Ministry of Foreign Affairs conducted mobile consular services in the Batticaloa district on 10-11 April 2019 as part of the 'RATA WENUWEN EKATA SITIMU' theme. The services aimed to provide assistance to residents in the area.",
      "Ministry News"
    ],
    [
      "Foreign Ministry to conduct mobile consular service in Batticaloa District under         the Rata Venuwen Ekata Sitimu programme on 10-11 April 2019",
      "07.04.2019",
      "https://mfa.gov.lk/en/mobile-consular-eng/",
      "The Ministry of Foreign Affairs will conduct a mobile consular service in Batticaloa District on 10-11 April 2019 under the Rata Venuwen Ekata Sitimu programme. This service aims to provide consular assistance to the public in coordination with the Ministry of Foreign Affairs.",
      "Ministry News"
    ],
    [
      "Third Meeting of Asia-Europe Political Forum (AEPF),  International Conference of Asian Political Parties (ICAPP) to be held in  Colombo from 5 -7 April 2019",
      "04.04.2019",
      "https://mfa.gov.lk/en/icapp-conference-eng/",
      "The Third meeting of the Asia-Europe Political Forum (AEPF) and the International Conference of Asian Political Parties (ICAPP) will take place in Colombo from 5 to 7 April 2019. Sri Lanka will host the event, which is expected to be attended by around 90 participants.",
      "Ministry News"
    ],
    [
      "Third Meeting of Asia-Europe Political Forum (AEPF),  International Conference of Asian Political Parties (ICAPP) to be held in  Colombo from 5 -7 April 2019",
      "04.04.2019",
      "https://mfa.gov.lk/en/third-meeting-of-asia-europe-political-forum-aepf-international-conference-of-asian-political-parties-icapp-to-be-held-in-colombo-from-5-7-april-2019/",
      "The Third meeting of the Asia-Europe Political Forum (AEPF) and the International Conference of Asian Political Parties (ICAPP) will take place in Colombo from 5 to 7 April 2019. The event will bring together political leaders and representatives from Asia and Europe for discussions and collaboration.",
      "Ministry News"
    ],
    [
      "Parliamentary High Posts Committee approves nominations of fourteen career diplomats",
      "30.03.2019",
      "https://mfa.gov.lk/en/hpc-eng/",
      "The Parliamentary High Posts Committee in Sri Lanka approved the nominations of fourteen career diplomats on Wednesday, March 27. The committee examines the suitability of individuals appointed to state services and corporations.",
      "Ministry News"
    ],
    [
      "Statement by  Hon. Tilak Marapana, PC., MP Minister of Foreign Affairs",
      "26.03.2019",
      "https://mfa.gov.lk/en/statement-by-hon-tilak-marapana-pc-mp-minister-of-foreign-affairs-eng/",
      "Hon. Tilak Marapana, PC., MP, Minister of Foreign Affairs, delivered a statement on the Appropriations Bill 2019 for the Ministry of Foreign Affairs on March 26, 2019. The statement addressed current domestic and external considerations.",
      "Ministry News"
    ],
    [
      "Foreign Minister and delegation meet UN High Commissioner for Human Rights and Director General UN Office in Geneva",
      "24.03.2019",
      "https://mfa.gov.lk/en/fm-meets-unhrc-commissioner-eng/",
      "Foreign Minister Hon. Tilak Marapana and his delegation met with UN High Commissioner for Human Rights, Madam Michelle Bachelet, and the Under-Secretary General in charge of the UN Office in Geneva, Mr. Michael Moller this week. The meeting aimed to discuss human rights issues and cooperation between Sri Lanka and the United Nations.",
      "Ministry News"
    ],
    [
      "Ministry of Foreign Affairs celebrates Tripitakabhivandana week",
      "22.03.2019",
      "https://mfa.gov.lk/en/tripitaka_eng/",
      "The Ministry of Foreign Affairs celebrated Tripitakabhivandana Week with a solemn program today, in line with the Government's declaration. The week-long event, from March 16 to 23, 2019, aimed to honor the Tripitaka teachings.",
      "Ministry News"
    ],
    [
      "Statement by Hon. Tilak Marapana, Minister of Foreign Affairs  on the adoption of the resolution A/HRC/40/L.1 ‘Promoting reconciliation, accountability and human rights in Sri Lanka’",
      "21.03.2019",
      "https://mfa.gov.lk/en/statement-adoption-eng-2/",
      "Hon. Tilak Marapana, Minister of Foreign Affairs of Sri Lanka, delivered a statement at the 40th Session of the Human Rights Council on March 21, 2019, regarding the adoption of resolution A/HRC/40/L.1 'Promoting reconciliation, accountability, and human rights in Sri Lanka.' He led the Sri Lanka delegation during this session.",
      "Ministry News"
    ],
    [
      "President of Sri Lanka attends Fourth Session of the United Nations Environment Assembly in Kenya",
      "21.03.2019",
      "https://mfa.gov.lk/en/president-of-sri-lanka-attends-fourth-session-of-the-united-nations-environment-assembly-in-kenya/",
      "President Maithripala Sirisena of Sri Lanka traveled to Kenya to participate in the One Planet Summit and the Fourth Session of the United Nations Environment Assembly. The events took place from 1.",
      "Ministry News"
    ],
    [
      "Statement by Hon. Tilak Marapana, PC, MP, Minister of Foreign Affairs of Sri Lanka and Leader of the Sri Lanka Delegation to the 40th Session of the Human Rights Council.",
      "20.03.2019",
      "https://mfa.gov.lk/en/statement-by-hon-tilak-marapana-p-c-minister-of-foreign-affairs-of-sri-lanka-and-leader-of-the-sri-lanka-delegation-to-the-40th-session-of-the-human-rights-council-on-agenda/",
      "Hon. Tilak Marapana, Minister of Foreign Affairs of Sri Lanka and Leader of the Sri Lanka Delegation, addressed the 40th Session of the Human Rights Council on 'Promoting Reconciliation, Accountability, and Human Rights in Sri Lanka' on March 20, 2019, in Geneva. The interactive dialogue focused on these key issues under the leadership of Hon. Marapana.",
      "Ministry News"
    ],
    [
      "Consideration of Sri Lanka at the 40th Session of the Human Rights Council (HRC)",
      "13.03.2019",
      "https://mfa.gov.lk/en/40th_hrc_session/",
      "During the 40th Session of the Human Rights Council (HRC), the report by the Office of the High Commissioner for Human Rights on 'Promoting reconciliation, accountability, and human rights in Sri Lanka' will be discussed. This session will focus on addressing human rights issues in Sri Lanka.",
      "Ministry News"
    ],
    [
      "5TH Meeting of Sri Lanka – European Commission Joint  Readmission Committee",
      "12.03.2019",
      "https://mfa.gov.lk/en/media-release-ec-sl-jrc-eng/",
      "The 5th meeting of the Joint Readmission Committee between Sri Lanka and the European Commission took place at the Ministry of Foreign Affairs in Colombo on March 11, 2019. The meeting was co-chaired by representatives from both parties.",
      "Ministry News"
    ],
    [
      "Foreign Minister Marapana underlines that the prime duty of Sri Lankan Defence Attachés is to serve the country and its people",
      "12.03.2019",
      "https://mfa.gov.lk/en/cer-award-milit-eng/",
      "Foreign Minister Tilak Marapana emphasized that the primary responsibility of Sri Lankan Defence Attachés at overseas missions is to serve the country and its people. He urged them to be mindful of this duty and prioritize the interests of Sri Lanka in their roles.",
      "Ministry News"
    ],
    [
      "Establishment of Diplomatic Relations between Sri Lanka and Burundi",
      "12.03.2019",
      "https://mfa.gov.lk/en/establishment-of-diplomatic-relations-between-sri-lanka-and-burundi/",
      "Sri Lanka and Burundi have established diplomatic relations through an agreement signed by the Ambassadors to the United Nations, H.E. Dr. Amrith Rohan Perera and H.E. Mr. Albert Shingiro. This agreement signifies a new chapter in the bilateral relations between the two countries.",
      "Ministry News"
    ],
    [
      "Sri Lanka and Kenya to consolidate friendship  through practical and productive measures",
      "11.03.2019",
      "https://mfa.gov.lk/en/sri-ken-eng/",
      "Sri Lanka and Kenya have agreed to formalize political consultations between their Foreign Ministries to discuss new areas of cooperation, following a meeting in Colombo. This move aims to consolidate the friendship between the two countries through practical and productive measures.",
      "Ministry News"
    ],
    [
      "Foreign Minister Tilak Marapana reaffirms commitment to consolidate the Sri Lanka –Cyprus bilateral engagement and officially inaugurates the Consulate General of Sri Lanka in Nicosia",
      "07.03.2019",
      "https://mfa.gov.lk/en/mfa-in-nicosia_eng/",
      "Foreign Minister Tilak Marapana reaffirmed Sri Lanka’s commitment to strengthen bilateral engagement with Cyprus during a meeting with Cyprus' Minister of Foreign Affairs Nikos Christodoulides. Marapana also officially inaugurated the Consulate General of Sri Lanka in Nicosia, further solidifying diplomatic ties between the two countries.",
      "Ministry News"
    ],
    [
      "Press Release – Ministry of Foreign Affairs/Prime Minister’s Office/ Department of Government Information",
      "06.03.2019",
      "https://mfa.gov.lk/en/press-release-ministry-of-foreign-affairsprime-ministers-office-department-of-government-information/",
      "Sri Lanka reaffirms its commitment to a steady and lasting reconciliation process through a co-sponsored resolution. The country will also request an extension of the timeline to further advance this initiative.",
      "Ministry News"
    ],
    [
      "Foreign Minister Tilak Marapana visits Italy",
      "05.03.2019",
      "https://mfa.gov.lk/en/foreign-minister-tilak-marapana-visits-italy/",
      "Foreign Minister Tilak Marapana visited Italy from March 1 to 3, 2019. He held bilateral discussions on March 1 at the Ministry of Foreign Affairs with the Under Secretary of State for Foreign Affairs. The visit aimed to strengthen diplomatic ties between the two countries.",
      "Ministry News"
    ],
    [
      "Statement on Pulwama terrorist attack and subsequent air strikes by India on Balakot",
      "27.02.2019",
      "https://mfa.gov.lk/en/statement-on-pulwama-terrorist-attack-and-subsequent-air-strikes-by-india-on-balakot/",
      "Sri Lanka expresses deep concern over the Pulwama terrorist attack and India's subsequent air strikes on Balakot. As a country that has also faced terrorism, Sri Lanka stands in solidarity with India during this challenging time.",
      "Ministry News"
    ],
    [
      "Matara Regional Consular Office declared open",
      "15.02.2019",
      "https://mfa.gov.lk/en/matara-rco-eng/",
      "The Matara Regional Consular Office of the Foreign Ministry was officially opened today by Ministers Tilak Marapana and Mangala Samaraweera. The opening ceremony was attended by several dignitaries and officials.",
      "Ministry News"
    ],
    [
      "Joint Press Release following the 22nd session of the European Union – Sri Lanka Joint Commission",
      "14.02.2019",
      "https://mfa.gov.lk/en/sl-eu-joint-press-release-eng/",
      "The European Union (EU) and Sri Lanka convened their 22nd Joint Commission meeting on February 14, 2019, in Brussels. The discussions were conducted in a positive and collaborative manner, addressing various developments in both regions.",
      "Ministry News"
    ],
    [
      "The Ministry of Foreign Affairs Opens its Second Regional Consular Office in Matara",
      "13.02.2019",
      "https://mfa.gov.lk/en/consular_eng/",
      "The Ministry of Foreign Affairs has opened its second Regional Consular Office in Matara as part of its efforts to bring consular services closer to the people. This initiative aims to provide easier access without the need to travel to Colombo, enhancing convenience for the public.",
      "Ministry News"
    ],
    [
      "Joint Communiqué between the Democratic Socialist Republic of Sri Lanka and the Republic of Maldives",
      "05.02.2019",
      "https://mfa.gov.lk/en/jnt_cmq_eng/",
      "The Democratic Socialist Republic of Sri Lanka and the Republic of Maldives issued a joint communiqué following a State visit by President Ibrahim Mohamed Solih at the invitation of President Maithripala Sirisena. The visit aimed to strengthen bilateral relations between the two countries.",
      "Ministry News"
    ],
    [
      "Appointment of the Ambassador of the Republic of Iceland to Sri Lanka",
      "01.02.2019",
      "https://mfa.gov.lk/en/ice/",
      "The Government of the Republic of Iceland, in agreement with the Government of Sri Lanka, has appointed Mr. Gudmundur Arni Stefansson as the new Ambassador of Iceland to Sri Lanka. He has presented his credentials for the role.",
      "Ministry News"
    ],
    [
      "Appointment of the Ambassador of the State of Israel to Sri Lanka",
      "01.02.2019",
      "https://mfa.gov.lk/en/isr/",
      "Dr. Ron Malka has been appointed as the new Ambassador of the State of Israel to Sri Lanka, succeeding H.E. Daniel Carmon with the concurrence of the Government of Sri Lanka. He has presented his credentials.",
      "Ministry News"
    ],
    [
      "Appointment of the Ambassador of the Republic of Maldives to Sri Lanka",
      "01.02.2019",
      "https://mfa.gov.lk/en/mald/",
      "Mr. Omar Abdul Razzaq has been appointed as the Ambassador of the Republic of Maldives to Sri Lanka with the concurrence of the Government of Sri Lanka, succeeding H.E. Mohame. This appointment was made by the Government of the Republic of Maldives.",
      "Ministry News"
    ],
    [
      "Appointment of the  Ambassador of the Kingdom of Cambodia to Sri Lanka",
      "01.02.2019",
      "https://mfa.gov.lk/en/cam/",
      "The Royal Government of Cambodia, with the concurrence of the Government of Sri Lanka, has appointed Mr. Ung Sean as the new Ambassador of the Kingdom of Cambodia to Sri Lanka, succeeding H.E. Pichkhun Panha. He has presented his credentials in this role.",
      "Ministry News"
    ],
    [
      "Appointment of the Ambassador of the Republic of El Salvador to Sri Lanka",
      "01.02.2019",
      "https://mfa.gov.lk/en/el/",
      "The Government of the Republic of El Salvador, with the approval of the Government of Sri Lanka, has appointed Mr. Ariel Andrade Galindo as the new Ambassador of El Salvador to Sri Lanka. He has presented his credentials for the position.",
      "Ministry News"
    ],
    [
      "Appointment of the High Commissioner of the Republic of Cyprus to Sri Lanka",
      "01.02.2019",
      "https://mfa.gov.lk/en/cyp/",
      "The Government of the Republic of Cyprus, in agreement with the Government of Sri Lanka, has named Mr. Agis Loizou as the new High Commissioner of Cyprus to Sri Lanka, succeeding H.E. Demetrio.",
      "Ministry News"
    ],
    [
      "Appointment of the Ambassador of the Republic of Armenia to Sri Lanka",
      "01.02.2019",
      "https://mfa.gov.lk/en/arm/",
      "The Government of the Republic of Armenia, in agreement with the Government of Sri Lanka, has appointed Mr. Armen Martirosyan as the new Ambassador of Armenia to Sri Lanka, succeeding H.E. Ara Hak. This appointment signifies a change in diplomatic representation between the two countries.",
      "Ministry News"
    ],
    [
      "Appointment of the Ambassador of the Republic of Mali to Sri Lanka",
      "01.02.2019",
      "https://mfa.gov.lk/en/mali/",
      "The Government of the Republic of Mali, in agreement with the Government of Sri Lanka, has appointed Mr. Sekou Kasse as the new Ambassador of Mali to Sri Lanka, succeeding H.E. Niankoro Yeah Samake.",
      "Ministry News"
    ],
    [
      "Appointment of the Ambassador of the Republic of Belarus to Sri Lanka",
      "01.02.2019",
      "https://mfa.gov.lk/en/bel/",
      "The Government of the Republic of Belarus, with the approval of the Government of Sri Lanka, has appointed Mr. Andrei Rzheussky as the new Ambassador of Belarus to Sri Lanka, succeeding H.E. Vitaly A. This appointment signifies a change in diplomatic representation between the two countries.",
      "Ministry News"
    ],
    [
      "Appointment of the  High Commissioner of the Republic of Uganda to Sri Lanka",
      "01.02.2019",
      "https://mfa.gov.lk/en/ugn/",
      "The Government of the Republic of Uganda, with the concurrence of the Government of Sri Lanka, has appointed Ms. Dinah Grace Akello as the new High Commissioner of Uganda to Sri Lanka, succeeding H.E. El. Ms. Akello will assume the role of High Commissioner in Sri Lanka.",
      "Ministry News"
    ],
    [
      "Appointment of the  High Commissioner  of the Cooperative Republic of Guyana  to Sri Lanka",
      "01.02.2019",
      "https://mfa.gov.lk/en/gyna/",
      "Dr. David Goldwin Pollard has been appointed as the High Commissioner of the Cooperative Republic of Guyana to Sri Lanka with the concurrence of both governments.",
      "Ministry News"
    ],
    [
      "Appointment of the Ambassador of the Slovak Republic to Sri Lanka",
      "01.02.2019",
      "https://mfa.gov.lk/en/slvk/",
      "The Government of the Slovak Republic, with the approval of the Government of Sri Lanka, has appointed Mr. Ivan Lančarič as the new Ambassador of the Slovak Republic to Sri Lanka, succeeding H.E. Žigmund Bertók. Mr. Lančarič will assume his new role as the Ambassador of the Slovak Republic to Sri Lanka.",
      "Ministry News"
    ],
    [
      "Vice President of Seychelles visits Sri Lanka from 30 January to 02 February, 2019",
      "31.01.2019",
      "https://mfa.gov.lk/en/vp-seychelles-visits-sri-lanka/",
      "Vice President Vincent Meriton of Seychelles visited Sri Lanka from January 30 to February 2, 2019, to receive two Wave Rider Inshore Patrol Craft (WRIPC) donated by the Sri Lankan government. The visit aimed to strengthen bilateral relations between the two countries.",
      "Ministry News"
    ],
    [
      "Terrorist attack by ELN in Colombia",
      "31.01.2019",
      "https://mfa.gov.lk/en/terrorist-attack-in-colombia/",
      "The Government of Sri Lanka has strongly condemned the terrorist attack carried out by the ELN at the Police Academy in Bogotá, Colombia on January 17, 2019. The Government and people of Sri Lanka extend their deepest condolences to the victims and their families.",
      "Ministry News"
    ],
    [
      "First Meeting of the BIMSTEC Permanent Working Committee concludes successfully in Colombo",
      "28.01.2019",
      "https://mfa.gov.lk/en/first-meeting-of-the-bimstec-permanent-working-committee-concludes-successfully-in-colombo/",
      "The First Meeting of the BIMSTEC Permanent Working Committee successfully concluded in Colombo on January 17-18, 2019. The committee discussed various technical and economic cooperation initiatives among the Bay of Bengal countries.",
      "Ministry News"
    ],
    [
      "President Maithripala Sirisena Concludes a Successful Visit to Singapore",
      "26.01.2019",
      "https://mfa.gov.lk/en/president-maithripala-sirisena-concludes-a-successful-visit-to-singapore/",
      "President Maithripala Sirisena of Sri Lanka successfully concluded his visit to Singapore on January 23-25, 2019. During the visit, he delivered a Keynote Speech at the Third Forum of Ministers and Environment Authorities.",
      "Ministry News"
    ],
    [
      "Sri Lanka-Philippines Joint Statement",
      "20.01.2019",
      "https://mfa.gov.lk/en/sl_phil_js_eng/",
      "Sri Lanka's President Maithripala Sirisena visited the Philippines at the invitation of President Rodrigo Duterte. The two leaders issued a joint statement during the visit.",
      "Ministry News"
    ],
    [
      "Foreign Minister Marapana calls on Sri Lankan diplomats to boost the image of Sri Lanka overseas through effective execution of public diplomacy",
      "13.01.2019",
      "https://mfa.gov.lk/en/mr-pd-eng/",
      "Foreign Minister Tilak Marapana urged Sri Lankan diplomats to enhance Sri Lanka's image abroad by effectively implementing public diplomacy, leveraging its core assets like Buddhism. The diplomats were encouraged to promote the country positively on the global stage.",
      "Ministry News"
    ],
    [
      "Members of the ‘Friends of Sri Lanka’ Group of the European Parliament pay official visit to Sri Lanka",
      "09.01.2019",
      "https://mfa.gov.lk/en/european-parliament-members/",
      "Members of the ‘Friends of Sri Lanka’ Group of the European Parliament, Geoffrey Van Orden, MEP, and William (Earl of) Dartmouth, MEP, visited Sri Lanka at the invitation of the government. The visit aimed to strengthen ties between the European Parliament and Sri Lanka.",
      "Ministry News"
    ]
  ]
}