[
  {
    "Title": "Revision of Consular Fees",
    "Date": "30.12.2022",
    "Link": "https://mfa.gov.lk/en/revision-of-consular-fees/",
    "Summary": "The Consular Affairs Division of the Ministry of Foreign Affairs in Colombo has revised fees for attestation of Certificates/Documents as per the Extraordinary Gazette No 2306/35 dated 16.11.2022. This update affects services provided at both the Colombo and Regional Consular Offices.",
    "Category": "Ministry News"
  },
  {
    "Title": "Repatriation of 152 Sri Lankan Migrants Rescued at Sea",
    "Date": "28.12.2022",
    "Link": "https://mfa.gov.lk/en/repatriation-of-152-sri-lankan-migrants-rescued-at-sea/",
    "Summary": "The Ministry of Foreign Affairs of Sri Lanka and the International Organization for Migration (IOM) organized the voluntary return of 152 Sri Lankan migrants rescued at sea. They were flown back to Sri Lanka from Ho Chi Minh City on a chartered flight.",
    "Category": "Ministry News"
  },
  {
    "Title": "Orientation programme for newly appointed Sri Lanka Heads of Mission",
    "Date": "27.12.2022",
    "Link": "https://mfa.gov.lk/en/newly-appointed-sri-lanka-heads-of-mission/",
    "Summary": "The Ministry of Foreign Affairs held an orientation programme from December 16 to 23 for fourteen newly appointed Heads of Sri Lanka Missions abroad and two Heads of Post. The programme aimed to prepare them for their roles in representing Sri Lanka internationally.",
    "Category": "Ministry News"
  },
  {
    "Title": "The message of H.E. Ranil Wickremesinghe, President of Sri Lanka for Christmas 2022",
    "Date": "25.12.2022",
    "Link": "https://mfa.gov.lk/en/the-message-of-h-e-ranil-wickremesinghe-president-of-sri-lanka-for-christmas-2022/",
    "Summary": "President of Sri Lanka, H.E. Ranil Wickremesinghe, delivered a Christmas message for 2022. The message conveyed warm wishes and festive greetings to the nation.",
    "Category": "Ministry News"
  },
  {
    "Title": "Ministry of Foreign Affairs and Ministry of Tourism and Lands discuss revival of tourism promotion in the current economic context",
    "Date": "23.12.2022",
    "Link": "https://mfa.gov.lk/en/mfa-tourism-land-discuss/",
    "Summary": "Minister of Foreign Affairs Ali Sabry met with officials from the Ministry of Tourism and Lands on 21 December 2022 to discuss challenges and strategies for reviving tourism promotion in Sri Lanka's current economic context. The meeting focused on the evolving strategy for Sri Lanka Tourism and the role of the Sri Lanka Missions in promoting tourism.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka High Commission in South Africa Organizes a Conference on   the Applicability of South Africa’s TRC to Sri Lanka",
    "Date": "19.12.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-high-commission-in-south-africa-organizes-a-conference-on-the-applicability-of-south-africas-trc-to-sri-lanka/",
    "Summary": "The Sri Lanka High Commission in South Africa, in partnership with the Lakshman Kadiragamar Institute of International Relations and Strategic Studies (LKI) in Colombo and the South Africa High Commission in Colombo, organized a conference to explore the applicability of South Africa's Truth and Reconciliation Commission (TRC) model to Sri Lanka. The conference aimed to facilitate discussions on transitional justice processes and reconciliation efforts between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Correction of Recent News Articles relating to Sri Lanka Embassy in Oman",
    "Date": "16.12.2022",
    "Link": "https://mfa.gov.lk/en/correction-news-oman/",
    "Summary": "Recent news articles regarding an employee of the Sri Lanka Foreign Employment Bureau stationed at the Sri Lanka Embassy in Oman have caught the Ministry's attention. The Ministry is addressing the inaccuracies in these articles to provide clarity on the situation.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Secretary Aruni Wijewardane delivers Keynote Address at High-Level Segment of Comprehensive Test Ban Treaty (CTBTO) 3rd Science Diplomacy Symposium, Vienna",
    "Date": "09.12.2022",
    "Link": "https://mfa.gov.lk/en/fssl-ctbto/",
    "Summary": "Foreign Secretary Aruni Wijewardane delivered the Keynote Address at the High-Level Segment of the 3rd CTBTO Science Diplomacy Symposium in Vienna, upon the invitation of the Comprehensive Test Ban Treaty Organization (CTBTO). The symposium focused on science diplomacy and nuclear non-proliferation efforts.",
    "Category": "Ministry News"
  },
  {
    "Title": "State Minister of Foreign Affairs Tharaka Balasuriya attends 4th Ministerial Meeting of the AIS Forum Bali",
    "Date": "09.12.2022",
    "Link": "https://mfa.gov.lk/en/smfa-ais-bali-2022/",
    "Summary": "State Minister of Foreign Affairs Tharaka Balasuriya attended the 4th Ministerial Meeting of the Archipelagic and Island States (AIS) Forum in Bali, Indonesia on December 5-6, 2022. During the meeting, he emphasized the significance and vitality of cooperation among participating nations.",
    "Category": "Ministry News"
  },
  {
    "Title": "Address by the State Minister of Foreign Affairs Tharaka Balasuriya, at the 4th Ministerial Meeting (MM-4) of the Archipelagic and Island States (AIS) Forum on 6 December, 2022",
    "Date": "06.12.2022",
    "Link": "https://mfa.gov.lk/en/smofa-mm4-ais-2022/",
    "Summary": "State Minister of Foreign Affairs Tharaka Balasuriya addressed the 4th Ministerial Meeting of the Archipelagic and Island States Forum on December 6, 2022. He expressed appreciation to Excellency Luhut B. Panjaitan and other distinguished delegates for their participation. The meeting aimed to discuss important maritime affairs issues affecting archipelagic and island states.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka High Commissioner visits the crew aboard vessel detained by Nigeria",
    "Date": "02.12.2022",
    "Link": "https://mfa.gov.lk/en/vessel-nigeria/",
    "Summary": "Sri Lanka's High Commissioner in Kenya, Velupillai Kananathan, recently visited the crew of the vessel M/T Heroic IDUN, which was detained by Nigeria. The visit included High Commissioners and Diplomats from India, Poland, and the Philippines on November 27.",
    "Category": "Ministry News"
  },
  {
    "Title": "Visit of Foreign Minister Ali Sabry to the United States of America",
    "Date": "28.11.2022",
    "Link": "https://mfa.gov.lk/en/visit-of-mfa-sl-usa/",
    "Summary": "Foreign Minister Ali Sabry will visit the United States from November 29 to December 4, 2022, at the invitation of U.S. Secretary of State Antony Blinken. The visit aims to strengthen diplomatic ties between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Ali Sabry addresses the Council of Ministers’ meeting of IORA in Bangladesh",
    "Date": "24.11.2022",
    "Link": "https://mfa.gov.lk/en/fmsl-iora-bangladesh/",
    "Summary": "Foreign Minister Ali Sabry addressed the 22nd Meeting of the Council of Ministers of the 23-member Indian Ocean Rim Association (IORA) in Bangladesh. During his speech, he highlighted the significance of collaboration among IORA member states for regional development and cooperation.",
    "Category": "Ministry News"
  },
  {
    "Title": "Statement by the Minister of Foreign Affairs – 22nd Indian Ocean Rim Association (IORA) Council of Ministers’ Meeting (COM) 24 November 2022, Dhaka, Bangladesh",
    "Date": "24.11.2022",
    "Link": "https://mfa.gov.lk/en/statement-mfa-iora/",
    "Summary": "The Minister of Foreign Affairs, Dr. A. K. Abdul Momen, chaired the 22nd Indian Ocean Rim Association (IORA) Council of Ministers’ Meeting on 24 November 2022 in Dhaka, Bangladesh. The meeting was attended by the Ministers of Foreign Affairs from IORA member countries and the Secretary General.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Secretary Aruni Wijewardane delivers Keynote Address at the Ceylon Chamber of Commerce Members’ Forum – 2022",
    "Date": "23.11.2022",
    "Link": "https://mfa.gov.lk/en/fs-ccc-iora-2022/",
    "Summary": "Foreign Secretary Aruni Wijewardane delivered the Keynote Address at the Ceylon Chamber of Commerce Members’ Forum – 2022 as the Chief Guest. The event took place at the Shangri-La Hotel in Colombo, where he explained the substantive work.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka and EU parliamentary delegations review bilateral cooperation in virtual meeting",
    "Date": "22.11.2022",
    "Link": "https://mfa.gov.lk/en/sl-eu-parliamentary-delegations/",
    "Summary": "Sri Lanka and EU parliamentary delegations engaged in a virtual meeting to discuss bilateral cooperation. The dialogue took place between a multi-party delegation from the Parliament of Sri Lanka and the Delegation for relations with the countries of South Asia in the European Parliament (DSAS) on Thursday, November 17.",
    "Category": "Ministry News"
  },
  {
    "Title": "Non-Resident High Commissioner of Singapore calls on Minister of Foreign Affairs",
    "Date": "16.11.2022",
    "Link": "https://mfa.gov.lk/en/nrhc-singapore-mfa/",
    "Summary": "The Non-Resident High Commissioner of Singapore, Chandra Das, visited Sri Lanka from November 13 to 18 and met with Minister of Foreign Affairs Ali Sabry on November 15 at the Ministry of Foreign Affairs.",
    "Category": "Ministry News"
  },
  {
    "Title": "Saudi Business Delegation calls on Foreign Minister Sabry",
    "Date": "14.11.2022",
    "Link": "https://mfa.gov.lk/en/saudi-business-delegation-fm/",
    "Summary": "A Saudi business delegation, led by Sheikh Mohamed Al-Ajlan, met with Foreign Minister Sabry during a fact-finding mission on investments in Sri Lanka. Sheikh Al-Ajlan, Deputy Board Chairman of Ajlan Group and President of the Saudi Chinese Business Council in Saudi Arabia, discussed potential investment opportunities with the Minister.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Ministry convenes a workshop on economic diplomacy",
    "Date": "14.11.2022",
    "Link": "https://mfa.gov.lk/en/fm-holds-workshop-diplomats/",
    "Summary": "The Foreign Ministry organized a workshop on economic diplomacy with experts from various government bodies including the Ministry of Finance, Export Development Board, and Sri Lanka Tea Board. The workshop aimed to enhance collaboration and strategies for promoting economic interests internationally.",
    "Category": "Ministry News"
  },
  {
    "Title": "Three Sri Lankans rescued from a fire in a garage in Male, Maldives",
    "Date": "12.11.2022",
    "Link": "https://mfa.gov.lk/en/3-sl-recuedf-from-fire-male/",
    "Summary": "Three Sri Lankan nationals were rescued from a fire in a garage in Male, Maldives. The Sri Lanka High Commission in Male reported that they were evacuated by the rescue team following the incident on November 10.",
    "Category": "Ministry News"
  },
  {
    "Title": "Appointment of the Ambassador of the France to Sri Lanka",
    "Date": "12.11.2022",
    "Link": "https://mfa.gov.lk/en/ambassador-france-sl/",
    "Summary": "The Government of France, with the agreement of Sri Lanka, has appointed Mr. Jean-Francois Pactet as the new Ambassador of France to Sri Lanka. He will serve as the Ambassador Extraordinary and Plenipotentiary of France in Sri Lanka.",
    "Category": "Ministry News"
  },
  {
    "Title": "Appointment of the Ambassador of the Oman to Sri Lanka",
    "Date": "12.11.2022",
    "Link": "https://mfa.gov.lk/en/ambassador-oman-sl/",
    "Summary": "The Government of the Sultanate of Oman, in agreement with the Government of Sri Lanka, has appointed Mr. Ahmed Ali Saeed Al Rashdi as the new Ambassador Extraordinary and Plenipotentiary of Oman to Sri Lanka. Mr. Al Rashdi will represent Oman in Sri Lanka in his new diplomatic role.",
    "Category": "Ministry News"
  },
  {
    "Title": "Appointment of the Ambassador of Russian Federation to Sri Lanka",
    "Date": "12.11.2022",
    "Link": "https://mfa.gov.lk/en/ambassador-russia-sl/",
    "Summary": "The Government of the Russian Federation, in agreement with the Government of Sri Lanka, has appointed Mr. Levan S. Dzhagaryan as the new Ambassador Extraordinary and Plenipotentiary of the Russian Federation to Sri Lanka.",
    "Category": "Ministry News"
  },
  {
    "Title": "Appointment of the Ambassador of Grand Duchy of Luxembourg to Sri Lanka",
    "Date": "11.11.2022",
    "Link": "https://mfa.gov.lk/en/ambassador-luxembourg-sl/",
    "Summary": "The Government of the Grand Duchy of Luxembourg, with the approval of the Government of Sri Lanka, has appointed Ms. Peggy Frantzen as the Ambassador Extraordinary and Plenipotentiary of the Grand Duchy of Luxembourg to Sri Lanka. Ms. Frantzen will represent Luxembourg in her new role in Sri Lanka.",
    "Category": "Ministry News"
  },
  {
    "Title": "Appointment of the High Commissioner Republic of Ghana to Sri Lanka",
    "Date": "11.11.2022",
    "Link": "https://mfa.gov.lk/en/high-commissioner-ghana-sl/",
    "Summary": "The Government of the Republic of Ghana, with the approval of the Government of Sri Lanka, has appointed Mr. Kwaku Asomah-Cheremeh as the High Commissioner of Ghana to Sri Lanka. He will be based in New Delhi for his diplomatic duties.",
    "Category": "Ministry News"
  },
  {
    "Title": "Appointment of the Ambassador of Republic of Paraguay to Sri Lanka",
    "Date": "11.11.2022",
    "Link": "https://mfa.gov.lk/en/ambassador-of-paraguay-sl/",
    "Summary": "The Government of the Republic of Paraguay, with the approval of the Government of Sri Lanka, has named Mr. Fleming Raul Duarte as the new Ambassador Extraordinary and Plenipotentiary of Paraguay to Sri Lanka. Mr. Duarte will represent Paraguay in Sri Lanka in his diplomatic role.",
    "Category": "Ministry News"
  },
  {
    "Title": "Appointment of the Ambassador of Kingdom of Bhutan to Sri Lanka",
    "Date": "11.11.2022",
    "Link": "https://mfa.gov.lk/en/ambassador-of-bhutan-sl/",
    "Summary": "The Government of the Kingdom of Bhutan, with the agreement of the Government of Sri Lanka, has named Mr. Rinchen Kuentsyl as the new Ambassador Extraordinary and Plenipotentiary of Bhutan to Sri Lanka. Mr. Kuentsyl will represent Bhutan in Sri Lanka in his new role.",
    "Category": "Ministry News"
  },
  {
    "Title": "Appointment of the Ambassador of United Mexican States to Sri Lanka",
    "Date": "11.11.2022",
    "Link": "https://mfa.gov.lk/en/ambassador-of-mexican-sl/",
    "Summary": "The Government of the United Mexican States, with the approval of the Government of Sri Lanka, has named Mr. Federico Salas Lotfe as the new Ambassador Extraordinary and Plenipotentiary of Mexico to Sri Lanka.",
    "Category": "Ministry News"
  },
  {
    "Title": "Media Statement on Sri Lankan crew members of the oil tanker MT Heroic, Idun detained by Equatorial Guinea",
    "Date": "11.11.2022",
    "Link": "https://mfa.gov.lk/en/media-statement-on-sri-lankan-crew-members-of-the-oil-tanker-mt-heroic-idun-detained-by-equatorial-guinea/",
    "Summary": "The Ministry of Foreign Affairs is actively collaborating with relevant parties to secure the prompt release of 8 Sri Lankan crew members from the oil tanker MT Heroic Idun detained by Equatorial Guinea. Efforts are underway to resolve the situation and ensure the crew's safe return home.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka monitors the progress of rescued passengers",
    "Date": "09.11.2022",
    "Link": "https://mfa.gov.lk/en/sl-monitors-rescued-passengers/",
    "Summary": "Sri Lanka's Ministry of Foreign Affairs is closely monitoring the progress of rescued passengers of Sri Lankan origin who arrived at the Port of Vung Tau in Vietnam on November 8, 2022. The ministry continues to provide assistance and support to the rescued individuals.",
    "Category": "Ministry News"
  },
  {
    "Title": "High-level Business delegation of Sri Lankan heritage from Canada visits Sri Lanka",
    "Date": "04.11.2022",
    "Link": "https://mfa.gov.lk/en/high-level-business-delegation/",
    "Summary": "A high-level business delegation of Sri Lankan heritage from Canada visited Sri Lanka to engage in economic and commercial activities, establish people-to-people contacts, and contribute to the economy. The delegation comprised industry and corporate leaders aiming to strengthen ties between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Joint Press Release: Sixth Meeting of the European Union – Sri Lanka Working Group on Governance, Rule of Law and Human Rights",
    "Date": "02.11.2022",
    "Link": "https://mfa.gov.lk/en/6th-meeting-eu-sl/",
    "Summary": "The Sixth Meeting of the European Union – Sri Lanka Working Group on Governance, Rule of Law and Human Rights convened in Colombo on 28 October 2022. This meeting was part of the routine bilateral engagements between the European Union and Sri Lanka.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Foreign Minister Ali Sabry discusses U.S – Sri Lanka bilateral relations with the Assistant Secretary of State for South and Central Asian Affairs Donald Lu",
    "Date": "20.10.2022",
    "Link": "https://mfa.gov.lk/en/us-sl-bilateral-relations/",
    "Summary": "Foreign Minister Ali Sabry met with U.S Assistant Secretary of State for South and Central Asian Affairs Ambassador Donald Lu at the Ministry of Foreign Affairs on Wednesday, October 19, 2022. They discussed bilateral relations between the U.S and Sri Lanka.",
    "Category": "Ministry News"
  },
  {
    "Title": "​State Minister of Foreign Affairs Tharaka Balasuriya explores multiple areas of cooperation on the sidelines of the Sixth CICA Summit in Kazakhstan",
    "Date": "16.10.2022",
    "Link": "https://mfa.gov.lk/en/smfa-cica-6th-summit/",
    "Summary": "State Minister of Foreign Affairs Tharaka Balasuriya led Sri Lanka's delegation at the Sixth CICA Summit in Kazakhstan, where he explored various areas of cooperation. During the summit, he held meetings to discuss collaboration opportunities with other participating countries, aiming to strengthen ties and promote mutual understanding.",
    "Category": "Ministry News"
  },
  {
    "Title": "State Minister of Foreign Affairs Tharaka Balasuriya leads Sri Lanka’s delegation to the Sixth CICA Summit in Kazakhstan",
    "Date": "14.10.2022",
    "Link": "https://mfa.gov.lk/en/smfa-6-cica-summit-astana/",
    "Summary": "State Minister of Foreign Affairs Tharaka Balasuriya is leading Sri Lanka's delegation to the Sixth Summit of the Conference on Interaction and Confidence Building Measures in Asia (CICA) in Astana, Kazakhstan from 12-13 October 2022. The summit aims to enhance cooperation and dialogue among Asian countries for regional peace and stability.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Foreign Ministry conducts a Briefing Session on Diplomatic Formalities for the Senior Sri Lankan Police Officers",
    "Date": "14.10.2022",
    "Link": "https://mfa.gov.lk/en/briefing-diplomatic-formalities-sl-police/",
    "Summary": "The Ministry of Foreign Affairs conducted a one-day briefing session for 30 Senior Sri Lankan Police Officers on diplomatic formalities to aid their official responsibilities effectively. The session aimed to enhance their understanding of diplomatic practices and facilitate smoother execution of their duties.",
    "Category": "Ministry News"
  },
  {
    "Title": "Minister of Foreign Affairs engages in a discussion with Key Business Chambers",
    "Date": "12.10.2022",
    "Link": "https://mfa.gov.lk/en/engages-key-business-chambers/",
    "Summary": "Minister of Foreign Affairs, Ali Sabry, engaged in a discussion with Presidents, Secretaries General, senior officials, and business leaders from export-oriented organizations and chambers of commerce on October 12. The meeting aimed to strengthen ties and collaboration between the government and key business chambers.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka rejects resolution at the UN Human Rights Council",
    "Date": "06.10.2022",
    "Link": "https://mfa.gov.lk/en/sl-rejects-resolution-unhrc/",
    "Summary": "Sri Lanka has rejected a resolution at the UN Human Rights Council titled \"Promoting reconciliation, accountability, and human rights in Sri Lanka.\" The resolution was tabled by several countries including the United Kingdom, Canada, and Germany.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Sri Lanka commemorates the 25th Anniversary of the BIMSTEC",
    "Date": "04.10.2022",
    "Link": "https://mfa.gov.lk/en/the-25th-anniversary-bimstec/",
    "Summary": "Sri Lanka marked the 25th Anniversary of the Bay of Bengal Initiative for Technical and Economic Cooperation (BIMSTEC with an event organized by the Ministry of Foreign Affairs in collaboration with the Lakshman Kadirgamar Institute.",
    "Category": "Ministry News"
  },
  {
    "Title": "​51st session of the UN Human Rights Council",
    "Date": "03.10.2022",
    "Link": "https://mfa.gov.lk/en/%e2%80%8b51st-session-of-the-un-human-rights-council/",
    "Summary": "The 51st session of the United Nations Human Rights Council is taking place in Geneva and will end on October 7, 2022. The session includes discussions on the draft resolution A/HRC/51/L.1 titled \"Promoting reco.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Australian High Commissioner paid a courtesy call on Foreign Minister",
    "Date": "02.10.2022",
    "Link": "https://mfa.gov.lk/en/australian-high-commissioner/",
    "Summary": "Australian High Commissioner Paul Stephens paid a courtesy visit to Foreign Minister Ali Sabry at the Ministry on September 30, 2022. During the meeting, the Foreign Minister congratulated the High Commissioner on his recent appointment.",
    "Category": "Ministry News"
  },
  {
    "Title": "Consular Affairs Division of the Ministry of Foreign Affairs Launches e-Channeling Appointment System for Authentication Services",
    "Date": "02.10.2022",
    "Link": "https://mfa.gov.lk/en/launches-e-channeling-for-authentication-services/",
    "Summary": "The Consular Affairs Division of the Ministry of Foreign Affairs has introduced an e-Channeling appointment system in partnership with SLT Mobitel on September 29, 2022. This system aims to enhance service efficiency for the public seeking authentication services.",
    "Category": "Ministry News"
  },
  {
    "Title": "Ambassador of Vietnam to Sri Lanka calls on Minister of Foreign Affairs",
    "Date": "02.10.2022",
    "Link": "https://mfa.gov.lk/en/vietnam-ambassador/",
    "Summary": "The Ambassador of Vietnam to Sri Lanka, Ho Thi Thanh Truc, met with Minister of Foreign Affairs Ali Sabry on Friday, September 30, 2022, at the Ministry of Foreign Affairs. During the meeting, the Ambassador extended congratulations.",
    "Category": "Ministry News"
  },
  {
    "Title": "South African High Commissioner to Sri Lanka calls on Minister of Foreign Affairs",
    "Date": "29.09.2022",
    "Link": "https://mfa.gov.lk/en/south-african-hc/",
    "Summary": "South African High Commissioner to Sri Lanka, Sandile Schalk, met with Minister of Foreign Affairs Ali Sabry on 29 September 2022 at the Ministry of Foreign Affairs. The meeting aimed to discuss bilateral relations between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Foreign Secretary welcomes U.S. assistance to Sri Lanka in meeting with U.S. PRUN to Rome",
    "Date": "27.09.2022",
    "Link": "https://mfa.gov.lk/en/fs-us-prun-rome/",
    "Summary": "Foreign Secretary Aruni Wijewardane welcomed U.S. assistance to Sri Lanka during a meeting with U.S. Permanent Representative to the UN Agencies in Rome, Ambassador Cindy McCain, at the Ministry of Foreign Affairs in Colombo on Monday.",
    "Category": "Ministry News"
  },
  {
    "Title": "Consular Affairs Division of the Ministry of Foreign Affairs launches e-Channeling Appointment System for Authentication Services",
    "Date": "27.09.2022",
    "Link": "https://mfa.gov.lk/en/launches-e-channeling/",
    "Summary": "The Consular Affairs Division of the Ministry of Foreign Affairs has partnered with SLT Mobitel to introduce an e-Channeling Appointment System for Authentication Services starting September 29, 2022. This system aims to enhance public access to efficient services.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Statement by the Minister of Foreign Affairs & Head of Delegation of Sri Lanka Hon. Ali Sabry, at the General Debate of the 77th Session of the United Nations General Assembly on 24 September, 2022 – New York.",
    "Date": "25.09.2022",
    "Link": "https://mfa.gov.lk/en/77th-session-unga/",
    "Summary": "Sri Lanka's Minister of Foreign Affairs & Head of Delegation, Hon. Ali Sabry, addressed the 77th Session of the United Nations General Assembly in New York on September 24, 2022. He expressed his honor in representing Sri Lanka at this session, which marks the gathering of world leaders after a two-year hiatus.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Ali Sabry meets international dignitaries and  addresses meetings on the sidelines of the United Nations General Assembly in New York",
    "Date": "23.09.2022",
    "Link": "https://mfa.gov.lk/en/foreignmeetingsjbiden/",
    "Summary": "Foreign Minister Ali Sabry, leading the Sri Lanka delegation at the 77th UNGA, met with various international dignitaries on the sidelines of the United Nations General Assembly in New York. He addressed meetings with leaders of UN member states to discuss key global issues.",
    "Category": "Ministry News"
  },
  {
    "Title": "State Minister of Foreign Affairs welcomes USAID support towards Sri Lanka’s tech and innovations industries",
    "Date": "23.09.2022",
    "Link": "https://mfa.gov.lk/en/smfa-usaid/",
    "Summary": "State Minister of Foreign Affairs Tharaka Balasuriya welcomed USAID's support for Sri Lanka's tech and innovation industries during a meeting with USAID Mission Director Gabriel Grau at the Ministry of Foreign Affairs on Wednesday, 21st.",
    "Category": "Ministry News"
  },
  {
    "Title": "Interview of the Minister of Foreign Affairs Hon. Ali Sabry on One on One TRT World in New York .",
    "Date": "23.09.2022",
    "Link": "https://mfa.gov.lk/en/slfm-on-one-on-one-trt-world-in-new-york/",
    "Summary": "Minister of Foreign Affairs Hon. Ali Sabry discusses economic and political crises and geopolitical issues on One on One TRT World in New York. The full interview provides insights into the country's stance on global divisions.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Appointment of the Ambassador of the Kingdom of Saudi Arabia to Sri Lanka",
    "Date": "20.09.2022",
    "Link": "https://mfa.gov.lk/en/kingdom-of-saudi-arabia-sl/",
    "Summary": "The Government of Saudi Arabia, with the approval of Sri Lanka, has named Mr. Khalid Hamoud Nasser Aldasam Alkahtani as the new Ambassador to Sri Lanka. He will serve as the Ambassador Extraordinary and Plenipotentiary of the Kingdom.",
    "Category": "Ministry News"
  },
  {
    "Title": "Appointment of the Ambassador of the Kingdom of Netherlands to Sri Lanka",
    "Date": "20.09.2022",
    "Link": "https://mfa.gov.lk/en/kingdom-of-netherlands-sl/",
    "Summary": "Ms. Bonnie Horbach has been appointed as the Ambassador Extraordinary and Plenipotentiary of the Kingdom of the Netherlands to Sri Lanka with the concurrence of the Government of Sri Lanka.",
    "Category": "Ministry News"
  },
  {
    "Title": "Resumption of the Attestation & Verification process at the Consular Affairs Division",
    "Date": "19.09.2022",
    "Link": "https://mfa.gov.lk/en/attestation-verification-consular-division/",
    "Summary": "The Ministry of Foreign Affairs has announced the resumption of the Attestation & Verification process at the Consular Affairs Division following a computer system breakdown. The General Public is informed that services are now operational.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Ali Sabry leads the Sri Lanka delegation to the UNGA in New York",
    "Date": "18.09.2022",
    "Link": "https://mfa.gov.lk/en/unga_ny/",
    "Summary": "Foreign Minister Ali Sabry will represent Sri Lanka at the 77th Session of the United Nations General Assembly in New York on September 24, 2022. He is scheduled to deliver the Sri Lanka statement and address various matters during his visit.",
    "Category": "Ministry News"
  },
  {
    "Title": "News item on Sri Lankan students in Kharkiv region, Ukraine",
    "Date": "17.09.2022",
    "Link": "https://mfa.gov.lk/en/news-item-on-sl-students-in-ukraine/",
    "Summary": "The Ministry of Foreign Affairs is aware of a news item circulating on social media regarding the rescue of Sri Lankan students in the Kharkiv region, Ukraine on 17 September.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Ali Sabry highlights Sri Lanka’s commitment to continuing progress in human rights and reconciliation through a credible domestic process at the 51st session of the Human Rights Council",
    "Date": "16.09.2022",
    "Link": "https://mfa.gov.lk/en/unhrc2022/",
    "Summary": "Foreign Minister Ali Sabry emphasized Sri Lanka's dedication to advancing human rights and reconciliation through a credible domestic process at the 51st session of the Human Rights Council. Despite economic challenges, Sri Lanka remains committed to progress in these areas.",
    "Category": "Ministry News"
  },
  {
    "Title": "Ambassador of Israel to Sri Lanka Gilon calls on Foreign Minister Sabry",
    "Date": "16.09.2022",
    "Link": "https://mfa.gov.lk/en/israel-ambassador-slfm/",
    "Summary": "Israel's Ambassador to Sri Lanka, Naor Gilon, based in New Delhi, met with Foreign Minister Ali Sabry on September 15, 2022. They discussed various ways of enhancing bilateral relations during the meeting.",
    "Category": "Ministry News"
  },
  {
    "Title": "​​Computer System Breakdown at the Consular Affairs Division",
    "Date": "16.09.2022",
    "Link": "https://mfa.gov.lk/en/consular-division/",
    "Summary": "The Verification and Attestation units of the Consular Affairs Division at the Ministry of Foreign Affairs in Colombo 01 and its Regional Offices in Jaffna, Trincomalee, and Mat are experiencing service disruptions due to a computer system breakdown.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Statement by the Minister of Foreign Affairs of Sri Lanka at the 51st  Regular Session of the United Nations Human Rights Council in Geneva on 12 September 2022",
    "Date": "12.09.2022",
    "Link": "https://mfa.gov.lk/en/regular-session-51st-12-09-2022/",
    "Summary": "During the 51st Regular Session of the United Nations Human Rights Council in Geneva on September 12, 2022, the Minister of Foreign Affairs of Sri Lanka reaffirmed the government's steadfast dedication to promoting and safeguarding human rights. The statement emphasized their commitment to advancing and protecting human rights.",
    "Category": "Ministry News"
  },
  {
    "Title": "State Minister of Foreign Affairs Tharaka Balasuriya assumes duties",
    "Date": "09.09.2022",
    "Link": "https://mfa.gov.lk/en/state-minister-mfa-assumes-duties/",
    "Summary": "State Minister of Foreign Affairs Tharaka Balasuriya officially started his duties today at the Ministry of Foreign Affairs in a modest ceremony. He was joined by Foreign Secretary Aruni Wijewardane and other senior officials.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka donates a consignment of tea to Pakistan flood victims",
    "Date": "06.09.2022",
    "Link": "https://mfa.gov.lk/en/sl-donates-tea-pakistan/",
    "Summary": "Sri Lanka's Government donated a consignment of Ceylon Tea to aid flood victims in Pakistan after recent devastating flash floods. The donation was handed over by the Minister of Foreign Affairs, Ali Sabry, to support those affected by the natural disaster.",
    "Category": "Ministry News"
  },
  {
    "Title": "World Food Programme Regional Director for Asia and the Pacific calls on Foreign Minister Ali Sabry",
    "Date": "02.09.2022",
    "Link": "https://mfa.gov.lk/en/wfp-regional-director-asia-pacific/",
    "Summary": "World Food Programme (WFP) Regional Director for Asia and the Pacific, John Aylieff, visited Sri Lanka and met with Foreign Minister Ali Sabry on September 1, 2022. The meeting was a courtesy call during Aylieff's current visit to the country.",
    "Category": "Ministry News"
  },
  {
    "Title": "Egyptian Ambassador to Sri Lanka calls on the Minister of Foreign Affairs",
    "Date": "01.09.2022",
    "Link": "https://mfa.gov.lk/en/egyptian-ambassador-slfm/",
    "Summary": "Egyptian Ambassador to Sri Lanka, Maged Mosleh, met with Sri Lankan Minister of Foreign Affairs Ali Sabry on August 31, 2022, at the Ministry of Foreign Affairs. The meeting between Foreign Minister Sabry and Ambassador Mosleh covered a wide range of topics.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister to address the 51st Session of the Human Rights Council   on 12 September 2022",
    "Date": "29.08.2022",
    "Link": "https://mfa.gov.lk/en/hrc8_29/",
    "Summary": "Foreign Minister Ali Sabry will lead the Sri Lanka delegation at the 51st Session of the Human Rights Council in Geneva from September 12 to October 7, 2022. He is scheduled to address the council on September 12, 2022.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lankan trained nurses ready to begin their careers in the UK",
    "Date": "28.08.2022",
    "Link": "https://mfa.gov.lk/en/uknuress/",
    "Summary": "Sri Lankan trained nurses received letters of appointment from Minister of Foreign Affairs Ali Sabry, marking the start of their careers in the UK. The nurses are set to commence employment at hospitals in the United Kingdom following a ceremony held on August 25.",
    "Category": "Ministry News"
  },
  {
    "Title": "UNICEF Regional Director for South Asia George Laryea-Adjei calls on Foreign Minister Ali Sabry",
    "Date": "26.08.2022",
    "Link": "https://mfa.gov.lk/en/unicef-2/",
    "Summary": "UNICEF Regional Director for South Asia, George Laryea-Adjei, visited Sri Lanka and met with Foreign Minister Ali Sabry on August 24, 2022. The meeting was a courtesy call during his visit to the country.",
    "Category": "Ministry News"
  },
  {
    "Title": "Regional Director of the United Nations Development Cooperation Office calls on Foreign Minister Ali Sabry",
    "Date": "19.08.2022",
    "Link": "https://mfa.gov.lk/en/undco/",
    "Summary": "The Regional Director for Asia and the Pacific of the United Nations Development Cooperation Office (UNDCO), David Mclachlan-Karr, visited Sri Lanka and met with Foreign Minister Ali Sabry during his official visit. The meeting was a courtesy call to discuss cooperation and development initiatives.",
    "Category": "Ministry News"
  },
  {
    "Title": "Appointment of the Ambassador of the Nepal to Sri Lanka",
    "Date": "18.08.2022",
    "Link": "https://mfa.gov.lk/en/ambassador-of-the-nepal-to-sl/",
    "Summary": "The Government of Nepal, with the approval of the Government of Sri Lanka, has appointed Mr. Bashu Dev Mishra as the new Ambassador Extraordinary and Plenipotentiary of Nepal to Sri Lanka. He will be based in Colombo and has already presented his credentials.",
    "Category": "Ministry News"
  },
  {
    "Title": "Appointment of the High Commissioner of Australia to Sri Lanka",
    "Date": "18.08.2022",
    "Link": "https://mfa.gov.lk/en/hc-of-australia-to-sl/",
    "Summary": "The Government of Australia, with the agreement of the Government of Sri Lanka, has appointed Mr. Paul Wesley Stephens as the new High Commissioner of Australia to Sri Lanka. He is based in Colombo and has already presented his credentials.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister briefs the Diplomatic Corps on current developments",
    "Date": "16.08.2022",
    "Link": "https://mfa.gov.lk/en/dccd/",
    "Summary": "Foreign Minister Ali Sabry briefed Colombo-based Ambassadors and High Commissioners on current developments at the Ministry of Foreign Affairs on August 15, 2022, ahead of the 51st session.",
    "Category": "Ministry News"
  },
  {
    "Title": "​​Ambassador of Iran Hashem Ashjazadeh calls on Foreign Minister Ali Sabry",
    "Date": "16.08.2022",
    "Link": "https://mfa.gov.lk/en/ambassador-of-iran-hashem-ashjazadeh/",
    "Summary": "Iran's Ambassador Hashem Ashjazadeh met with Foreign Minister Ali Sabry at the Ministry of Foreign Affairs on August 15, 2022. The Foreign Minister highlighted the countries' longstanding cordial relations during the meeting.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Ali Sabry meets with visiting UNDP Deputy Regional Director Christophe Bahuet",
    "Date": "15.08.2022",
    "Link": "https://mfa.gov.lk/en/undp-deputy-regional-director/",
    "Summary": "Foreign Minister Ali Sabry met with Christophe Bahuet, the Deputy Regional Director for Asia and the Pacific of the UNDP, who is currently visiting Sri Lanka. They discussed matters related to development and cooperation during the meeting.",
    "Category": "Ministry News"
  },
  {
    "Title": "Chinese vessel Yuan Wang 5",
    "Date": "12.08.2022",
    "Link": "https://mfa.gov.lk/en/chinese-vessel-yuan-wang-5/",
    "Summary": "The Ministry of Foreign Affairs received notification from the Chinese Embassy in Colombo regarding the Chinese vessel Yuan Wang 5 on June 28, 2022. The Embassy informed the Ministry through a Diplomatic Note.",
    "Category": "Ministry News"
  },
  {
    "Title": "​UAE Ambassador Calls on Foreign Minister",
    "Date": "10.08.2022",
    "Link": "https://mfa.gov.lk/en/uae-ambassador-calls-on/",
    "Summary": "The Ambassador of the United Arab Emirates, Khaled Nasser Al-Ameri, met with Foreign Minister Ali Sabry at the Ministry of Foreign Affairs today. During the meeting, Foreign Minister Ali Sabry briefed the Ambassador on important matters.",
    "Category": "Ministry News"
  },
  {
    "Title": "High Commissioner of New Zealand calls on Foreign Minister",
    "Date": "10.08.2022",
    "Link": "https://mfa.gov.lk/en/hc-new-zealand/",
    "Summary": "The High Commissioner of New Zealand, Michael Appleton, met with Foreign Minister Ali Sabry at the Ministry of Foreign Affairs on August 9, 2022. During the meeting, the Foreign Minister acknowledged the long-standing cordial relationship between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Secretary Aruni Wijewardane at the 55th ASEAN Day Celebrations in Colombo",
    "Date": "09.08.2022",
    "Link": "https://mfa.gov.lk/en/fs-55th-asean/",
    "Summary": "Foreign Secretary Aruni Wijewardane attended the 55th ASEAN Day celebrations on August 8, 2022, at the Indonesian Embassy in Colombo as the Chief Guest. The event was hosted by the Indonesian Ambassador, Dewi Gus.",
    "Category": "Ministry News"
  },
  {
    "Title": "Latest Developments on the Chinese vessel Yuang Wang 5",
    "Date": "08.08.2022",
    "Link": "https://mfa.gov.lk/en/lyuang-wang-5/",
    "Summary": "The Ministry of Foreign Affairs has granted diplomatic clearance for the Chinese vessel Yuang Wang 5 to make a port call at the Hambantota port from August 11 to 17, 2022.",
    "Category": "Ministry News"
  },
  {
    "Title": "U.S. Ambassador Julie Chung calls on Foreign Minister Ali Sabry",
    "Date": "04.08.2022",
    "Link": "https://mfa.gov.lk/en/us8_4/",
    "Summary": "U.S. Ambassador Julie Chung met with Sri Lankan Foreign Minister Ali Sabry on July 29, 2022, at the Ministry of Foreign Affairs. During the meeting, the Ambassador congratulated Minister Sabry.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Korean Ambassador calls on Foreign Minister Ali Sabry",
    "Date": "03.08.2022",
    "Link": "https://mfa.gov.lk/en/korean-ambassadar-08-2022/",
    "Summary": "The Korean Ambassador in Sri Lanka, Woonjin Jeong, visited Foreign Minister Ali Sabry on July 29, 2022, to discuss enhancing bilateral cooperation. The meeting took place at the Ministry, where both sides exchanged views on strengthening their relationship.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister to attend 29th ASEAN Regional Forum (ARF) in Cambodia",
    "Date": "02.08.2022",
    "Link": "https://mfa.gov.lk/en/cambodia/",
    "Summary": "Foreign Minister M.U.M. Ali Sabry will attend the 29th ASEAN Regional Forum (ARF) Ministerial Meeting in Phnom Penh, Cambodia on August 4-5, 2022. The ARF is a key platform for dialogue and cooperation on security issues in the Asia-Pacific region.",
    "Category": "Ministry News"
  },
  {
    "Title": "Japanese Ambassador calls on the Minister of Foreign Affairs",
    "Date": "02.08.2022",
    "Link": "https://mfa.gov.lk/en/japan8_2/",
    "Summary": "Japanese Ambassador Mizukoshi Hideaki met with Sri Lanka's newly appointed Minister of Foreign Affairs, Ali Sabry on July 28, 2022, at the Ministry. During the meeting, they discussed bilateral relations and cooperation between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Ali Sabry briefs Colombo-based Diplomatic Corps on Key Developments",
    "Date": "02.08.2022",
    "Link": "https://mfa.gov.lk/en/cmb-based-diplomatic-corps/",
    "Summary": "Foreign Minister Ali Sabry briefed the Colombo-based Diplomatic Corps on key developments following the election of the new President and the formation of the new Government. The briefing aimed to update Ambassadors and High Commissioners on recent political changes in the country.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Russian Ambassador calls on new Foreign Minister",
    "Date": "31.07.2022",
    "Link": "https://mfa.gov.lk/en/yury-materiy-called-on-fam/",
    "Summary": "The Russian Ambassador to Sri Lanka, Yury Materiy, met with the newly appointed Foreign Minister, Ali Sabry, on July 28, 2022, at the Foreign Ministry to congratulate Minister Sabry.",
    "Category": "Ministry News"
  },
  {
    "Title": "High Commissioner of Pakistan calls on Minister of Foreign Affairs of Sri Lanka",
    "Date": "31.07.2022",
    "Link": "https://mfa.gov.lk/en/hc-pakistan-mfa/",
    "Summary": "The High Commissioner of Pakistan to Sri Lanka, Maj. Gen. (Rtd) Umar Farooq Burki, visited the Ministry of Foreign Affairs on July 29, 2022, and met with Minister Ali Sabry. During the meeting, they discussed bilateral relations and cooperation between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Chinese Ambassador pays courtesy call on Foreign Minister",
    "Date": "28.07.2022",
    "Link": "https://mfa.gov.lk/en/chinese-ambassador-paid-a-courtesy-call-on/",
    "Summary": "Chinese Ambassador Qi Zhenhong paid a courtesy call on Foreign Minister Ali Sabry at the Ministry on July 27, 2022. During the meeting, Ambassador Qi congratulated the Foreign Minister on his recent appointment.",
    "Category": "Ministry News"
  },
  {
    "Title": "High Commissioner of India pays a courtesy call on the newly appointed Minister of Foreign Affairs",
    "Date": "27.07.2022",
    "Link": "https://mfa.gov.lk/en/hci-mfa/",
    "Summary": "The High Commissioner of India to Sri Lanka, Gopal Baglay, paid a courtesy call on Sri Lanka's newly appointed Minister of Foreign Affairs, Ali Sabry, on July 26, 2022, at the Ministry. The meeting aimed to strengthen diplomatic ties between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "​​Foreign Minister Ali Sabry assumes duties",
    "Date": "25.07.2022",
    "Link": "https://mfa.gov.lk/en/fm-ali-sabry-assumes-duties/",
    "Summary": "Foreign Minister Ali Sabry officially began his duties at the Ministry of Foreign Affairs today in a simple ceremony attended by Foreign Secretary Aruni Wijewardane and senior officials. In his address to the officials, Minister Sabry emphasized the importance of diplomacy in advancing the country's interests.",
    "Category": "Ministry News"
  },
  {
    "Title": "Demise of Mr. Moragodage Christopher Walter Pinto",
    "Date": "22.07.2022",
    "Link": "https://mfa.gov.lk/en/demise-of-mr-moragodage-christopher-walter-pinto/",
    "Summary": "The Foreign Ministry announced the passing of Mr. Moragodage Christopher Walter Pinto, also known as Mr. Chris Pinto, on July 21, 2022, in The Hague, Netherlands. Mr. Pinto was the first Legal A. We extend our deepest condolences to his family and friends during this difficult time.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka concludes bilateral consultations with Japan",
    "Date": "17.07.2022",
    "Link": "https://mfa.gov.lk/en/sl-japan/",
    "Summary": "Sri Lanka recently concluded bilateral consultations with Japan. The discussions were led by Secretary of Foreign Affairs Aruni Wijewardane and a senior delegation from the Japanese Ministry of Foreign Affairs, headed by the Assistant Minister of Southwest and Southeast Asia Affairs.",
    "Category": "Ministry News"
  },
  {
    "Title": "Outgoing Ambassador for Sultanate of  Oman calls on Foreign Minister Prof. Peiris",
    "Date": "10.07.2022",
    "Link": "https://mfa.gov.lk/en/sultanate-oman/",
    "Summary": "Ambassador Juma Hamdan Hassan Al Shehhi of the Sultanate of Oman bid farewell to Foreign Minister Prof. G.L. Peiris during a meeting at the Ministry of Foreign Affairs on July 7, 2022. The ambassador paid a courtesy visit before concluding his term.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister meets with the Ambassador of the European Union in Colombo",
    "Date": "08.07.2022",
    "Link": "https://mfa.gov.lk/en/eun-7-8/",
    "Summary": "Foreign Minister Prof. G.L. Peiris met with the European Union Ambassador Denis Chaibi in Colombo at the Ministry of Foreign Affairs on July 6, 2022. The meeting involved discussions on various matters of mutual interest between the two parties.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister G.L Peiris reviews progress on the work of domestic mechanisms in relation to reconciliation and human rights",
    "Date": "07.07.2022",
    "Link": "https://mfa.gov.lk/en/mfamd7_7/",
    "Summary": "Foreign Minister G.L. Peiris and Justice Minister Wijeyadasa Rajapakshe co-chaired a meeting on July 4, 2022, at the Ministry of Foreign Affairs to review progress on domestic mechanisms related to reconciliation and human rights. The meeting aimed to assess the work done so far in these areas and discuss future steps for improvement.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Meets with the UN Resident Coordinator in Colombo",
    "Date": "06.07.2022",
    "Link": "https://mfa.gov.lk/en/un-resident-coordinator-in-cmb/",
    "Summary": "Foreign Minister Prof. G.L. Peiris met with the United Nations Resident Coordinator Hanna Singer-Hamdy in Colombo on July 1, 2022. They discussed various matters during the meeting at the Ministry of Foreign Affairs.",
    "Category": "Ministry News"
  },
  {
    "Title": "Minister of Foreign Affairs and Minister of Labour & Foreign Employment co-host a meeting on Promotion of Foreign Employment",
    "Date": "05.07.2022",
    "Link": "https://mfa.gov.lk/en/mol-fe/",
    "Summary": "Minister of Foreign Affairs Prof. G.L. Peiris and Minister of Labour & Foreign Employment Manusha Nanayakkara co-hosted a meeting at the Ministry of Foreign Affairs on July 4, 2022, to discuss the promotion of foreign employment. They explored potential avenues for enhancing opportunities in this sector.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Foreign Minister meets with Chinese Ambassador",
    "Date": "03.07.2022",
    "Link": "https://mfa.gov.lk/en/chinese-ambassador/",
    "Summary": "Foreign Minister Professor G.L. Peiris met with Chinese Ambassador Qi Zhenhong on June 30, 2022, at the Ministry of Foreign Affairs. The meeting involved discussions on bilateral relations and cooperation between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Consular Affairs Division of Ministry of Foreign Affairs  Resumes its Regular Services",
    "Date": "01.07.2022",
    "Link": "https://mfa.gov.lk/en/con_01-07/",
    "Summary": "The Consular Affairs Division of the Ministry of Foreign Affairs has resumed its regular services to meet the high demand for consular assistance. The division will now be open to the public on weekdays, from Monday to Friday starting in July. This change aims to better serve the public's needs for consular services.",
    "Category": "Ministry News"
  },
  {
    "Title": "Charge d’ Affaires a.i. of the Embassy of Kingdom of Saudi Arabia Abdullah A. Orkobi called on the Foreign Minister",
    "Date": "01.07.2022",
    "Link": "https://mfa.gov.lk/en/ksa/",
    "Summary": "Charge d’Affaires a.i. of the Embassy of the Kingdom of Saudi Arabia, Abdullah A. Orkobi, met with Foreign Minister G.L. Peiris at the Foreign Ministry on June 30, 2022. The meeting aimed to discuss bilateral relations between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Russian Ambassador calls on Foreign Minister Peiris",
    "Date": "30.06.2022",
    "Link": "https://mfa.gov.lk/en/ruassian-ambassador-to-sl/",
    "Summary": "Russian Ambassador Yury Materiy visited Foreign Minister G.L. Peiris on June 29, 2022, at the Ministry of Foreign Affairs in Sri Lanka. The meeting aimed to discuss diplomatic matters between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Consular Services for public only on Monday, Wednesday, and Friday",
    "Date": "29.06.2022",
    "Link": "https://mfa.gov.lk/en/consular-services/",
    "Summary": "Starting June 30, 2022, the Consular Affairs Division of the Ministry of Foreign Affairs will offer services to the public on Mondays, Wednesdays, and Fridays due to the current situation in the country.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Peiris attends the Commonwealth Heads of Government Meeting 2022 (CHOGM) in Kigali, Rwanda from 23–25 June, 2022",
    "Date": "29.06.2022",
    "Link": "https://mfa.gov.lk/en/chogm-commonwealth-hog/",
    "Summary": "Foreign Minister Prof. G.L. Peiris represented President Gotabaya Rajapaksa at the 2022 Commonwealth Heads of Government Meeting (CHOGM) held in Kigali, Rwanda from June 23 to 25, 2022. The meeting aimed to address key issues affecting Commonwealth nations.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Secretary Aruni Wijewardane meets visiting delegation from  U.S.Treasury and State Department",
    "Date": "28.06.2022",
    "Link": "https://mfa.gov.lk/en/sfausa/",
    "Summary": "Foreign Secretary Aruni Wijewardane met with a senior delegation from the U.S. Department of the Treasury and the Department of State. The delegation was led by Rob, the Deputy Assistant Secretary of Treasury for Asia.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Peiris holds bilateral discussions with Commonwealth Foreign Ministers on the side-lines of CHOGM 2022",
    "Date": "28.06.2022",
    "Link": "https://mfa.gov.lk/en/chogm-heads-of-delegations/",
    "Summary": "Foreign Minister Prof. G.L. Peiris engaged in bilateral discussions with Commonwealth Foreign Ministers during the CHOGM 2022 in Kigali, Rwanda on June 24-25. The meetings aimed to strengthen diplomatic ties and cooperation among participating countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka’s Candidate Prof. Rangita De Silva De Alwis elected to the Committee on the Elimination of All Forms of Discrimination Against Women (CEDAW)",
    "Date": "24.06.2022",
    "Link": "https://mfa.gov.lk/en/rangita/",
    "Summary": "Professor Rangita De Silva De Alwis from Sri Lanka has been elected to the UN Committee on the Elimination of All Forms of Discrimination Against Women for the term 2023-2026. She will represent Sri Lanka in this role following the recent elections.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Peiris meets India’s External Affairs Minister  on the side-lines of CHOGM 2022",
    "Date": "24.06.2022",
    "Link": "https://mfa.gov.lk/en/fmiea/",
    "Summary": "Foreign Minister Prof. G.L. Peiris met with India’s External Affairs Minister Dr. S. Jaishankar on the sidelines of the CHOGM Summit in Kigali, Rwanda on June 23. The bilateral discussion aimed to strengthen diplomatic ties between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Consular Service on 24 June, 2022",
    "Date": "23.06.2022",
    "Link": "https://mfa.gov.lk/en/consular-service-on-24-06-2022/",
    "Summary": "On 24 June, 2022, the Consular Affairs Division of the Ministry of Foreign Affairs will serve only 400 applicants due to maintenance work at their premises. Please plan accordingly if you require consular services on that day.",
    "Category": "Ministry News"
  },
  {
    "Title": "Indian Foreign Secretary Vinay Kwatra calls on Foreign Secretary Aruni Wijewardane",
    "Date": "23.06.2022",
    "Link": "https://mfa.gov.lk/en/indian-fs-and-sl-fs/",
    "Summary": "Indian Foreign Secretary Vinay Kwatra visited Sri Lanka on June 23, 2022, and met with Sri Lankan Foreign Secretary Aruni Wijewardane at the Ministry of Foreign Affairs. The meeting aimed to discuss bilateral relations and cooperation between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Indian Foreign Secretary Vinay Kwatra and delegation visit Sri Lanka",
    "Date": "23.06.2022",
    "Link": "https://mfa.gov.lk/en/indian-fm-visit-sl/",
    "Summary": "Indian Foreign Secretary Vinay Kwatra and his delegation visited Sri Lanka today to discuss bilateral assistance provided by India amid the current economic situation. The visit aimed to strengthen ties between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka and New Zealand Foreign Ministers meet on the sidelines of CHOGM 2022",
    "Date": "23.06.2022",
    "Link": "https://mfa.gov.lk/en/new-zealand-chogm-2022/",
    "Summary": "Sri Lanka's Minister of Foreign Affairs G.L. Peiris met with New Zealand's Minister for Foreign Affairs and Local Government Nanaia Mahuta on June 22 during the CHOGM Summit in Kigali. The bilateral meeting aimed to discuss mutual interests and strengthen diplomatic ties between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Peiris to attend Commonwealth Heads of Government Meeting in Kigali, Rwanda",
    "Date": "21.06.2022",
    "Link": "https://mfa.gov.lk/en/chogm-rwanda/",
    "Summary": "Foreign Minister Prof. G.L. Peiris will represent President Gotabaya Rajapaksa at the Commonwealth Heads of Government Meeting (CHOGM) in Kigali, Rwanda from June 21 to 25, 2022. The meeting aims to address key issues affecting member countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Joint Press Release by Clare O’Neil MP, Australia’s Minister for Home Affairs and Prof G. L. Peiris, Sri Lanka’s Minister of Foreign Affairs on 20 June 2022",
    "Date": "20.06.2022",
    "Link": "https://mfa.gov.lk/en/joinpressaus/",
    "Summary": "Australia's Minister for Home Affairs, Clare O’Neil MP, met with Sri Lanka’s Minister of Foreign Affairs, Prof G. L. Peiris, during her visit to Colombo from 19 to 21 June 2022. This meeting marks an important diplomatic engagement between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister meets High Commissioner for Human Rights",
    "Date": "19.06.2022",
    "Link": "https://mfa.gov.lk/en/unhrc-19-06-22/",
    "Summary": "Foreign Minister G.L. Peiris met with the UN High Commissioner for Human Rights, the Secretary General of the International Federation of the Red Cross, and the Permanent Representatives of China. The meeting aimed to discuss human rights issues and international cooperation.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka stresses importance of relations with Japan",
    "Date": "16.06.2022",
    "Link": "https://mfa.gov.lk/en/japan-16-06-22/",
    "Summary": "Sri Lanka's Minister of Foreign Affairs, Prof. G.L. Peiris, emphasized the importance of relations with Japan during meetings with the Vice Minister for Foreign Affairs of Japan, the UK's Minister for Foreign and Commonwealth Affairs, and Ambassadors/Permanent Representatives of the United Nations. The discussions highlighted the significance of strengthening diplomatic ties between Sri Lanka and these key international partners.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Foreign Minister Peiris briefs the President of the Human Rights Council on Sri Lankan Issues",
    "Date": "15.06.2022",
    "Link": "https://mfa.gov.lk/en/unhrc-brazil/",
    "Summary": "Foreign Minister Prof. G.L. Peiris briefed the President of the Human Rights Council on Sri Lankan issues during meetings with the Coordinator of the Non-Aligned Movement (Geneva Chapter) and the Permanent Representative of Brazil.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Statement by the Minister of Foreign Affairs of Sri Lanka at the 50th Regular Session of the United Nations Human Rights Council in Geneva on 13 June 2022",
    "Date": "13.06.2022",
    "Link": "https://mfa.gov.lk/en/statement-mfa-50th-sesson-unhrc/",
    "Summary": "During the 50th Regular Session of the United Nations Human Rights Council in Geneva on 13 June 2022, the Minister of Foreign Affairs of Sri Lanka highlighted the country's progress and challenges in an open exchange with the Council and other UN organs, emphasizing transparency, candor, and openness.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister to address the Human Rights Council on Monday 13 June, 2022",
    "Date": "13.06.2022",
    "Link": "https://mfa.gov.lk/en/address-the-hrc-on-13-6-2022/",
    "Summary": "Foreign Minister Prof. G.L. Peiris will address the Human Rights Council on Monday, June 13, 2022, leading the Sri Lankan delegation at the 50th Session. The statement is scheduled for noon GMT.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Peiris attends 19th IISS Shangri-La Dialogue in Singapore 10-11 June, 2022",
    "Date": "13.06.2022",
    "Link": "https://mfa.gov.lk/en/shangri-la-dialogue-singapore/",
    "Summary": "Foreign Minister Prof. G.L. Peiris attended the 19th IISS Shangri-La Dialogue in Singapore on June 10-11, 2022. The summit is recognized as Asia's premier Security Summit. Peiris participated in discussions on regional security issues during the event.",
    "Category": "Ministry News"
  },
  {
    "Title": "Consular Services on Special Holiday, 13 June, 2022",
    "Date": "12.06.2022",
    "Link": "https://mfa.gov.lk/en/limited-services-13-06-2022/",
    "Summary": "On Monday, 13 June 2022, the Consular Affairs Division of the Ministry of Foreign Affairs will provide services only for urgent cases due to the high number of service seekers. Regular consular services will be limited on this special holiday.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Foreign Minister Peiris meets Australia’s Deputy Prime Minister in Singapore",
    "Date": "12.06.2022",
    "Link": "https://mfa.gov.lk/en/australia-dpm/",
    "Summary": "Foreign Minister Professor G. L. Peiris met with Australia’s Deputy Prime Minister and Minister of Defence, Dr. Richard Marles, in Singapore during the Shangri La dialogue. Minister Peiris discussed matters of mutual interest with Dr. Marles during the meeting.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister of Sri Lanka meets Singapore’s Senior Minister and Coordinating Minister for Social Policies",
    "Date": "10.06.2022",
    "Link": "https://mfa.gov.lk/en/fmcm/",
    "Summary": "Sri Lanka's Foreign Minister Prof. G. L. Peiris recently met with Singapore's Senior Minister and Coordinating Minister for Social Policies, Tharman Shanmugaratnam, at the Ministry of Finance in Singapore on 9 January. The meeting aimed to discuss bilateral relations and cooperation between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Peiris in Singapore for Official Visit",
    "Date": "10.06.2022",
    "Link": "https://mfa.gov.lk/en/sp6-10/",
    "Summary": "Foreign Minister Prof. G. L. Peiris visited Singapore from June 8-9, 2022, at the invitation of Singapore's Minister for Foreign Affairs, Dr. Vivian Balakrishnan. The visit was an official engagement aimed at strengthening diplomatic ties between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Ambassador of Qatar calls on the Minister of Foreign Affairs",
    "Date": "08.06.2022",
    "Link": "https://mfa.gov.lk/en/ambassador-qatar/",
    "Summary": "Ambassador Jassim bin Jaber Al-Sorour of Qatar visited Minister of Foreign Affairs Prof. G.L. Peiris at the Ministry of Foreign Affairs on June 6, 2022. The meeting aimed to discuss diplomatic matters and strengthen bilateral relations between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Peiris to visit Singapore for bilateral visit and take part in Asia Security Summit",
    "Date": "07.06.2022",
    "Link": "https://mfa.gov.lk/en/singapore-asia-security-summit/",
    "Summary": "Foreign Minister Prof. G.L. Peiris will visit Singapore on June 8-9, 2022, at the invitation of Singapore's Foreign Affairs Minister Vivian Balakrishnan for a bilateral visit. He will also participate in the Asia Security Summit during his visit.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Minister of Foreign Affairs chairs a webinar on current challenges to the economy and seeking remedies through all Missions abroad",
    "Date": "07.06.2022",
    "Link": "https://mfa.gov.lk/en/webinar-economic-channelings/",
    "Summary": "The Minister of Foreign Affairs, Prof. G.L. Peiris, chaired a webinar addressing current economic challenges and seeking solutions through all Missions abroad. The webinar was attended by the Governor of the Central Bank, Dr. Nandalal Weerasinghe, the Secretary of Foreign Affairs, Aruni Wijewardane, and heads of all overseas missions. Discussions focused on strategies to address the economic issues faced by the country.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Peiris thanks Indian High Commissioner Baglay for generous assistance",
    "Date": "06.06.2022",
    "Link": "https://mfa.gov.lk/en/fam-indian-hc/",
    "Summary": "Foreign Minister Prof. G.L. Peiris expressed gratitude to Indian High Commissioner Shri Gopal Baglay for their generous assistance during a meeting at the Ministry of Foreign Affairs on June 2, 2022. The discussion likely focused on strengthening bilateral relations between Sri Lanka and India.",
    "Category": "Ministry News"
  },
  {
    "Title": "Chinese Ambassador pays a courtesy call on the Minister of Foreign Affairs",
    "Date": "05.06.2022",
    "Link": "https://mfa.gov.lk/en/china-fam-sl/",
    "Summary": "Chinese Ambassador Qi Zhenhong paid a courtesy call on Sri Lanka's Minister of Foreign Affairs, Prof. G.L. Peiris, at the Ministry on June 2, 2022. During the meeting, Ambassador Zhenhong briefed the Minister on assistance initiatives.",
    "Category": "Ministry News"
  },
  {
    "Title": "Statement by the Ministry of Foreign Affairs on the Aeroflot passenger aircraft at the Bandaranaike International Airport",
    "Date": "04.06.2022",
    "Link": "https://mfa.gov.lk/en/statement-mfa-sl-aeroflot/",
    "Summary": "The Ministry of Foreign Affairs issued a statement regarding the Aeroflot passenger aircraft flight SU-289 at Bandaranaike International Airport. The statement was made on 2 June 2022.",
    "Category": "Ministry News"
  },
  {
    "Title": "Minister of Foreign Affairs Prof. Peiris addresses Colombo based Diplomatic corps on the present situation in Sri Lanka",
    "Date": "02.06.2022",
    "Link": "https://mfa.gov.lk/en/mfa-sl-colombo-based-dip-corps/",
    "Summary": "Minister of Foreign Affairs Prof. G. L. Peiris addressed the Colombo-based Diplomatic Corps on June 2, 2022, at the Ministry of Foreign Affairs in Sri Lanka. During his briefing, he outlined the current situation in the country.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Peiris meets with Japanese Deputy Head of Mission",
    "Date": "31.05.2022",
    "Link": "https://mfa.gov.lk/en/fm-sl-japanese-dh-of-mission/",
    "Summary": "Foreign Minister Prof. G.L. Peiris met with Japanese Deputy Head of Mission Katsuki Kotaro on May 27, 2022. They discussed bilateral engagements, domestic developments, and assistance during the meeting.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Foreign Minister Peiris seeks assistance from the World Bank",
    "Date": "30.05.2022",
    "Link": "https://mfa.gov.lk/en/fam-sl-world-bank/",
    "Summary": "Foreign Minister Prof. G.L. Peiris met with World Bank Country Manager Chiyo Kanda in Colombo on May 27, 2022, seeking assistance. The meeting took place at the Ministry of Foreign Affairs.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Foreign Minister Peiris meets with U.S. Ambassador Chung",
    "Date": "29.05.2022",
    "Link": "https://mfa.gov.lk/en/us-ambassador-fam-sl-2/",
    "Summary": "Foreign Minister Prof. G.L. Peiris met with U.S. Ambassador Julie Chung at the Ministry of Foreign Affairs on Friday, 27 May 2022. They discussed a wide range of topics, focusing on bilateral relations and current domestic developments.",
    "Category": "Ministry News"
  },
  {
    "Title": "British High Commissioner Hulton meets with Foreign Minister Peiris to discuss recent developments",
    "Date": "27.05.2022",
    "Link": "https://mfa.gov.lk/en/bhc-hulton-fam-sl/",
    "Summary": "British High Commissioner Sarah Hulton met with Sri Lanka's Foreign Minister G.L. Peiris on May 26, 2022, to discuss recent developments. During the meeting at the Ministry of Foreign Affairs, Hulton congratulated Peiris.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign​ Affairs ​Minister Peiris meets with the UN Food and Agriculture Organization (FAO) Representative and the Country Director of the World Food Programme (WFP) to Sri Lanka",
    "Date": "26.05.2022",
    "Link": "https://mfa.gov.lk/en/fam-sl-fao/",
    "Summary": "Foreign Affairs Minister Prof. G.L. Peiris held meetings with Vimlendra Sharan, the UN Food and Agriculture Organization (FAO) Representative, and Abdur Rahim Siddiqui, the Country Director of the World Food Programme (WFP) in Sri Lanka.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign ​Affairs ​Minister Peiris meets with the World Health Organisation (WHO) Representative to Sri Lanka",
    "Date": "26.05.2022",
    "Link": "https://mfa.gov.lk/en/representative-who-fam-sl/",
    "Summary": "Foreign Affairs Minister Prof. G.L. Peiris met with Dr. Alaka Singh, the World Health Organisation (WHO) Representative to Sri Lanka, on May 25, 2022, at the Ministry of Foreign Affairs to discuss ongoing health-related matters.",
    "Category": "Ministry News"
  },
  {
    "Title": "UN assures assistance to Sri Lanka in addressing current economic challenges",
    "Date": "24.05.2022",
    "Link": "https://mfa.gov.lk/en/un-fam-sl/",
    "Summary": "The Minister of Foreign Affairs, Prof. G. L. Peiris, met with the UN Resident Coordinator in Colombo, Hanaa Singer-Hamdy on May 23, 2022, to address the economic challenges facing Sri Lanka. The UN has pledged assistance to help the country navigate through the current economic situation.",
    "Category": "Ministry News"
  },
  {
    "Title": "New Foreign Secretary Aruni Wijewardane assumes duties",
    "Date": "23.05.2022",
    "Link": "https://mfa.gov.lk/en/newsec/",
    "Summary": "Aruni Wijewardane assumed duties as the new Secretary to the Ministry of Foreign Affairs on 23 May 2022, following her appointment with effect from 20 May 2022. The ceremony marking her assumption of office was held at the Foreign Ministry.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka registers strong protest with Canada on House of Commons motion",
    "Date": "20.05.2022",
    "Link": "https://mfa.gov.lk/en/cahocom/",
    "Summary": "Sri Lanka's Foreign Affairs Minister, Prof. G.L. Peiris, strongly protested and expressed deep concern to Canada regarding a motion adopted by the Canadian Parliament on May 18, 2022, alleging genocide.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka Missions abroad generate Rs.3,221 million in the year 2021",
    "Date": "20.05.2022",
    "Link": "https://mfa.gov.lk/en/slmiss2021/",
    "Summary": "Sri Lanka's Missions abroad generated Rs.3,221 million in 2021, according to the Ministry of Foreign Affairs. The revenue was generated amidst the challenges posed by the COVID-19 pandemic.",
    "Category": "Ministry News"
  },
  {
    "Title": "The Sri Lanka rejects motion on alleged genocide adopted in Canadian Parliament",
    "Date": "19.05.2022",
    "Link": "https://mfa.gov.lk/en/slrejects/",
    "Summary": "The Government of Sri Lanka expressed regret over the Canadian Parliament's adoption of a motion on the alleged genocide of Tamils in Sri Lanka and the recognition of May 18 as Tamil Genocide Remembrance Day. Sri Lanka rejected the motion.",
    "Category": "Ministry News"
  },
  {
    "Title": "Minister of Foreign Affairs signs the Book of Condolence",
    "Date": "16.05.2022",
    "Link": "https://mfa.gov.lk/en/mfasl-signs-condolence-book/",
    "Summary": "The Minister of Foreign Affairs, Prof. G.L. Peiris, signed the book of condolence at the residence of the Ambassador following the passing of the President of the United Arab Emirates, Sheikh Khalifa bin Zayed Al Nahyan.",
    "Category": "Ministry News"
  },
  {
    "Title": "The message of H.E. Gotabaya Rajapaksa President of Sri Lanka for Vesak Day 2022",
    "Date": "15.05.2022",
    "Link": "https://mfa.gov.lk/en/presidents-vesak-day-message/",
    "Summary": "Sri Lankan President Gotabaya Rajapaksa delivered a message for Vesak Day 2022, emphasizing the significance of the occasion. In his address, he highlighted the importance of peace, compassion, and unity in celebrating Vesak.",
    "Category": "Ministry News"
  },
  {
    "Title": "Demise of Consul General of Sri Lanka in Sydney Lakshman Hulugalle",
    "Date": "14.05.2022",
    "Link": "https://mfa.gov.lk/en/demise-consul-general-of-sl-in-sydney/",
    "Summary": "The Ministry of Foreign Affairs announced the passing of Consul General of Sri Lanka in Sydney, Lakshman Hulugalle, who died in Sydney, Australia on Saturday, May 14, 2022. He passed away due to a undisclosed cause. Our condolences go out to his family and loved ones during this difficult time.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Australia delegation in Colombo marks 75th Anniversary of relations",
    "Date": "01.05.2022",
    "Link": "https://mfa.gov.lk/en/australia-cmb-75-relations/",
    "Summary": "A delegation from Australia, led by Gary Cowan, the First Assistant Secretary of the Department of Foreign Affairs and Trade, visited Colombo to commemorate the 75th Anniversary of diplomatic relations. During the visit, discussions were held with officials from the Ministry of Foreign Affairs.",
    "Category": "Ministry News"
  },
  {
    "Title": "Diplomatic briefing by Foreign Minister Peiris on post conflict reconciliation and related issues",
    "Date": "29.04.2022",
    "Link": "https://mfa.gov.lk/en/dbfm29/",
    "Summary": "Foreign Minister Prof. G.L. Peiris briefed a group of Ambassadors on April 26, 2022, highlighting the Government of Sri Lanka's progress in addressing post-conflict reconciliation and related issues.",
    "Category": "Ministry News"
  },
  {
    "Title": "Indonesia donates 3.1 tonnes of Humanitarian Aid to Sri Lanka",
    "Date": "28.04.2022",
    "Link": "https://mfa.gov.lk/en/indonesia-donates-to-sl/",
    "Summary": "Indonesia donated 3.1 tonnes of humanitarian aid to Sri Lanka. Minister of Foreign Affairs Prof. G.L. Peiris received Ambassador Dewi Gustina Tobing at the Foreign Ministry on April 27, 2022, who provided an update on the aid from the Indonesian government.",
    "Category": "Ministry News"
  },
  {
    "Title": "ICRC to provide humanitarian assistance to Sri Lanka",
    "Date": "27.04.2022",
    "Link": "https://mfa.gov.lk/en/icrc-mfa-sl/",
    "Summary": "The Head of the ICRC Delegation in Sri Lanka, Loukas Petridis, met with Foreign Affairs Minister Prof. G.L. Peiris on April 25, 2022, to discuss providing humanitarian assistance. The ICRC aims to support Sri Lanka in addressing humanitarian needs effectively.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka collaborates with Blue Planet Fund",
    "Date": "22.04.2022",
    "Link": "https://mfa.gov.lk/en/bpf/",
    "Summary": "Sri Lanka recently collaborated with the Blue Planet Fund (BPF) through the Ocean Country Partnership Programme (OCPP). The partnership was officially introduced during the Biodiversity Stakeholder Session held on 14 March at the Ministry of Environment.",
    "Category": "Ministry News"
  },
  {
    "Title": "Chinese Ambassador pledges continues support to Sri Lanka",
    "Date": "21.04.2022",
    "Link": "https://mfa.gov.lk/en/china-sl-pledges-support/",
    "Summary": "Chinese Ambassador Qi Zhenhong pledged continued support to Sri Lanka during a meeting with Minister of Foreign Affairs, Professor G.L. Peiris on April 21, 2022. Minister Peiris welcomed the Ambassador and expressed appreciation for China's ongoing assistance.",
    "Category": "Ministry News"
  },
  {
    "Title": "Pakistan’s Anti-Terrorism Court sentences six of the accused to death for the murder of Sri Lankan factory manager Priyantha Kumara Diyawadanage",
    "Date": "20.04.2022",
    "Link": "https://mfa.gov.lk/en/atc-pakistan-priyantha/",
    "Summary": "Pakistan's Anti-Terrorism Court in Gujranwala sentenced six individuals to death for the murder of Sri Lankan factory manager Priyantha Kumara Diyawadanage. The Ministry of Foreign Affairs has welcomed this verdict, which was issued on April 18, 2022.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Minister of Foreign Affairs Prof. Peiris briefs donor nations",
    "Date": "17.04.2022",
    "Link": "https://mfa.gov.lk/en/mfa-briefs-donar-nations/",
    "Summary": "Minister of Foreign Affairs Prof. Peiris, along with Minister of Finance M. U. M. Ali Sabry PC and the Governor of the Central Bank Dr. Nandalal Weer, briefed donor nations at the Ministry of Foreign Affairs on April 12, 2022.",
    "Category": "Ministry News"
  },
  {
    "Title": "Bandu Samarasinghe not appointed Consul General in Milan",
    "Date": "16.04.2022",
    "Link": "https://mfa.gov.lk/en/mil/",
    "Summary": "The Ministry of Foreign Affairs has clarified that Mr. Bandu Samarasinghe will not be appointed as the Consul General in Milan. This decision was confirmed by the Ministry in Colombo on April 16, 2022.",
    "Category": "Ministry News"
  },
  {
    "Title": "The message of H.E. Gotabaya Rajapaksa, President of Sri Lanka for Easter Sunday",
    "Date": "15.04.2022",
    "Link": "https://mfa.gov.lk/en/easter-sunday-message/",
    "Summary": "President of Sri Lanka, H.E. Gotabaya Rajapaksa, delivered a message for Easter Sunday. The message emphasized the significance of the occasion and conveyed well wishes to the nation.",
    "Category": "Ministry News"
  },
  {
    "Title": "President’s New Year Message",
    "Date": "13.04.2022",
    "Link": "https://mfa.gov.lk/en/presidents-new-year-message-sl/",
    "Summary": "President delivers a New Year message in English and Tamil to the nation. The message highlights key priorities and goals for the upcoming year, emphasizing unity and progress for all citizens.",
    "Category": "Ministry News"
  },
  {
    "Title": "Minister of Foreign Affairs Prof. Peiris briefs NAM envoys",
    "Date": "10.04.2022",
    "Link": "https://mfa.gov.lk/en/maf-nam-envoys/",
    "Summary": "Minister of Foreign Affairs Professor G.L. Peiris briefed High Commissioners and Ambassadors from Non-Aligned Movement (NAM) countries at the Ministry of Foreign Affairs on April 7, 2022. The meeting aimed to discuss important diplomatic matters and strengthen relationships within the NAM.",
    "Category": "Ministry News"
  },
  {
    "Title": "The Ministry of Foreign Affairs notes that attention has been focused on the revision of the U.S. Travel Advisory",
    "Date": "08.04.2022",
    "Link": "https://mfa.gov.lk/en/usad/",
    "Summary": "The Ministry of Foreign Affairs highlights the recent revision of the U.S. Travel Advisory for Sri Lanka as of April 6, 2022. This revision follows the ongoing attention since June 2021, amidst the COVID-19 pandemic. The Ministry emphasizes the importance of staying informed about travel advisories for Sri Lanka.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lankan Community in Jordan donates Medical Equipment",
    "Date": "08.04.2022",
    "Link": "https://mfa.gov.lk/en/sljo/",
    "Summary": "The Sri Lankan Community in Jordan donated medical equipment through the Sri Lankan Embassy in Jordan. The donation was handed over at a ceremony, strengthening ties between the two nations.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lankan Community in Frankfurt donates Medical Equipment",
    "Date": "08.04.2022",
    "Link": "https://mfa.gov.lk/en/slcfr/",
    "Summary": "The Sri Lankan Community in Frankfurt, Germany donated medical equipment through the Consulate General of Sri Lanka in Frankfurt. The donation was handed over to support healthcare efforts in the region.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka and the Netherlands hold inaugural bilateral political consultations",
    "Date": "07.04.2022",
    "Link": "https://mfa.gov.lk/en/slnl/",
    "Summary": "Sri Lanka and the Netherlands held their first bilateral political consultations at the Foreign Ministry level on April 5, 2022, conducted virtually. The consultations marked an important milestone in the diplomatic relations between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Minister of Foreign Affairs Prof. Peiris briefs Colombo based Diplomatic corps on the prevailing situation in Sri Lanka",
    "Date": "07.04.2022",
    "Link": "https://mfa.gov.lk/en/diplomatic-corps-sl-mfa/",
    "Summary": "Minister of Foreign Affairs Prof. G. L. Peiris briefed the Colombo-based Diplomatic corps on the current situation in Sri Lanka on April 6, 2022. He emphasized the Government's stance during the address at the Ministry of Foreign Affairs.",
    "Category": "Ministry News"
  },
  {
    "Title": "Temporary Closure of Sri Lanka’s Embassies in Oslo and Baghdad, and Consulate General in Sydney",
    "Date": "05.04.2022",
    "Link": "https://mfa.gov.lk/en/temporary-closure/",
    "Summary": "The Ministry of Foreign Affairs has started the process of temporarily closing the Sri Lanka Embassies in Oslo and Baghdad, along with the Consulate General in Sydney. This decision follows a recent announcement by the Cabinet of Ministers.",
    "Category": "Ministry News"
  },
  {
    "Title": "Korea doubles its employment quota for Sri Lankan migrant workers and increases Overseas Development Assistance amount to Sri Lanka- Minister for Government Policy Coordination of the Republic of Korea, Koo Yun-cheol",
    "Date": "05.04.2022",
    "Link": "https://mfa.gov.lk/en/sl-mfa-south-korea/",
    "Summary": "During an official visit to Sri Lanka, Minister Koo Yun-cheol of the Republic of Korea announced the doubling of the employment quota for Sri Lankan migrant workers and an increase in Overseas Development Assistance to Sri Lanka. Minister Koo Yun-cheol met with Sri Lankan Minister of Foreign Affairs, Prof. G.L. Peiris, on April 1, 2022, to discuss these developments and strengthen bilateral relations.",
    "Category": "Ministry News"
  },
  {
    "Title": "Outgoing Ambassador for Saudi Arabia calls on Foreign Minister Prof. Peiris",
    "Date": "01.04.2022",
    "Link": "https://mfa.gov.lk/en/s-a-04_01/",
    "Summary": "Ambassador Abdulnaser bin Hussain Al-Harthi of Saudi Arabia bid farewell to Foreign Minister Prof. G.L. Peiris on March 25, 2022, at the Ministry of Foreign Affairs in Colombo. The meeting marked the conclusion of his term as the Saudi Arabian Ambassador.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Ministers of Sri Lanka and Nepal renew commitment to further expand bilateral relations into new areas of cooperation",
    "Date": "01.04.2022",
    "Link": "https://mfa.gov.lk/en/nepal01-04/",
    "Summary": "During the BIMSTEC Summit in Colombo, Foreign Minister of Nepal Dr. Narayan Khadka met with Prof. G.L. Peiris, Sri Lanka's Minister of Foreign Affairs, renewing their commitment to expand bilateral relations into new areas of cooperation. The meeting emphasized strengthening ties between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "The Minister of Foreign Affairs of Sri Lanka and the Deputy Prime Minister and Foreign Minister of Thailand hold discussions on the sidelines of the BIMSTEC Summit",
    "Date": "31.03.2022",
    "Link": "https://mfa.gov.lk/en/fam-sl-dpm-fm-thailand-bimstec/",
    "Summary": "Minister of Foreign Affairs Prof. G. L. Peiris and Deputy Prime Minister and Foreign Minister of Thailand Don Pramudwinai held discussions on the sidelines of the 5th Bay of Bengal Initiative for Multi-Sectoral Technical and Economic Cooperation (BIMSTEC) Summit. The meeting aimed to strengthen bilateral relations between Sri Lanka and Thailand.",
    "Category": "Ministry News"
  },
  {
    "Title": "The Minister of Foreign Affairs of Sri Lanka and the Foreign Minister of Bangladesh hold discussions on the sidelines of the BIMSTEC Summit",
    "Date": "31.03.2022",
    "Link": "https://mfa.gov.lk/en/bimstec-bangladesh-sl-fam/",
    "Summary": "The Minister of Foreign Affairs of Sri Lanka, Prof. G. L. Peiris, and the Foreign Minister of Bangladesh, Dr. A. K. Abdul Momen MP, held discussions on the sidelines of the 5th Bay of Bengal Initiative for Multi-Sectoral Technical and Economic Cooperation (BIMSTEC) Summit. The meeting aimed to strengthen bilateral ties and cooperation between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "​President Gotabaya Rajapaksa chairs the 5th BIMSTEC Summit in Colombo",
    "Date": "30.03.2022",
    "Link": "https://mfa.gov.lk/en/president-chairs-5th-bimstec/",
    "Summary": "President Gotabaya Rajapaksa of Sri Lanka chaired the 5th BIMSTEC Summit in Colombo on March 30, 2022, held in virtual mode. The Summit focused on enhancing cooperation among BIMSTEC member countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Ministerial Meeting of BIMSTEC held in Colombo",
    "Date": "29.03.2022",
    "Link": "https://mfa.gov.lk/en/ministerial-meeting-of-bimstec-held-in-colombo/",
    "Summary": "The 18th Ministerial Meeting of BIMSTEC took place on March 29, 2022, in Colombo at the Bandaranaike Memorial International Conference Hall (BMICH).",
    "Category": "Ministry News"
  },
  {
    "Title": "Minister of External Affairs of India Dr. S. Jaishankar and the Minister of Foreign Affairs of Sri Lanka Prof. G.L Peiris hold talks on the sidelines of the BIMSTEC Summit",
    "Date": "29.03.2022",
    "Link": "https://mfa.gov.lk/en/mfa-sl-moea-india-bimstec/",
    "Summary": "During his official visit for the 5th BIMSTEC Summit in Colombo, India's Minister of External Affairs Dr. S. Jaishankar met with Sri Lanka's Minister of Foreign Affairs Prof. G.L Peiris to discuss bilateral matters. The talks took place on the sidelines of the summit.",
    "Category": "Ministry News"
  },
  {
    "Title": "BIMSTEC Senior Officials’ Meeting held in Colombo today",
    "Date": "28.03.2022",
    "Link": "https://mfa.gov.lk/en/bimstec-colombo/",
    "Summary": "The BIMSTEC Senior Officials’ Meeting took place in Colombo today, chaired by Sri Lanka. The meeting was held in hybrid mode on 28 March 2022.",
    "Category": "Ministry News"
  },
  {
    "Title": "​U.S. Under Secretary for Political Affairs, Victoria Nuland concludes successful visit to Sri Lanka",
    "Date": "28.03.2022",
    "Link": "https://mfa.gov.lk/en/us-under-secretary-sl/",
    "Summary": "U.S. Under Secretary for Political Affairs, Victoria Nuland successfully concluded her visit to Sri Lanka on March 23, 2022. She engaged in productive discussions with Sri Lanka's Minister of Foreign Affairs, G.L. Peiri during her visit.",
    "Category": "Ministry News"
  },
  {
    "Title": "Minister of Foreign​ Affairs​ Prof. Peiris meets the Ambassador of South Africa",
    "Date": "27.03.2022",
    "Link": "https://mfa.gov.lk/en/fam-sl-meets-ambassador-sa/",
    "Summary": "Minister of Foreign Affairs Professor G. L. Peiris met with the Ambassador of South Africa, Sandile Edwin Schalk, at the Ministry of Foreign Affairs on 25 March 2021. The main focus of the discussion was to enhance diplomatic relations between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka hosts the Fifth BIMSTEC Summit in Colombo",
    "Date": "27.03.2022",
    "Link": "https://mfa.gov.lk/en/sl-hosts-5th-bimstec-cmb/",
    "Summary": "Sri Lanka will host the Fifth BIMSTEC Summit in Colombo from 28-30 March 2022 in a hybrid mode. The summit will bring together Senior Officials from member countries for discussions on technical and economic cooperation in the Bay of Bengal region.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Peiris meets a delegation of French Senators",
    "Date": "25.03.2022",
    "Link": "https://mfa.gov.lk/en/fam-french-senators/",
    "Summary": "Foreign Minister Professor G.L. Peiris met with a delegation of French Senators from the French Republic in Colombo on Thursday, 24 March 2022. The discussions during the meeting covered a variety of issues, enhancing diplomatic relations between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Prof. Peiris discusses follow-up action on matters raised at the Mobile Service “Access to Justice” in Jaffna",
    "Date": "24.03.2022",
    "Link": "https://mfa.gov.lk/en/fam-mof-special-mobile-service/",
    "Summary": "Foreign Minister Prof. G.L. Peiris led a meeting on March 21, 2022, with Justice Minister Ali Sabry and MP Angajan Ramanathan to address follow-up actions from the \"Access to Justice\" Mobile Service event in Jaffna. Discussions focused on addressing key issues raised during the event.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka participates at “EnviroteQ|AgriteQ 2022” in Doha",
    "Date": "23.03.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-participates-at-enviroteqagriteq-2022-in-doha/",
    "Summary": "Sri Lanka participated in \"EnviroteQ|AgriteQ 2022\" in Doha for the first time, showcasing its agricultural products in collaboration with the Export Development Board. The event marked Qatar's 9th International Agriculture Exhibition, organized by the Sri Lanka Embassy in Doha.",
    "Category": "Ministry News"
  },
  {
    "Title": "Joint Statement-Fourth Session of the Sri Lanka – United States Partnership Dialogue",
    "Date": "23.03.2022",
    "Link": "https://mfa.gov.lk/en/joint-statement-4th-session-usa/",
    "Summary": "The Governments of Sri Lanka and the United States released a joint statement on the Fourth Sri Lanka – U.S. Partnership Dialogue held on March 23, 2022, in Colombo. The statement outlines the discussions and agreements reached during the dialogue.",
    "Category": "Ministry News"
  },
  {
    "Title": "Minister of Foreign Affairs Prof. Peiris and Qatar’s Ambassador Al – Sorour discuss the multifaceted relations between Sri Lanka and Qatar",
    "Date": "22.03.2022",
    "Link": "https://mfa.gov.lk/en/mfa-sl-qatar/",
    "Summary": "Minister of Foreign Affairs Prof. G. L. Peiris met with Qatar's Ambassador Jassim bin Jaber J.B. Al-Sorour on March 21, 2022, in Colombo to discuss the multifaceted relations between Sri Lanka and Qatar. The meeting took place at the Ministry of Foreign Affairs, focusing on strengthening bilateral ties between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Minister of Foreign Affairs Prof. Peiris and United Arab Emirates Ambassador Al – Ameri discuss the importance of strengthening bilateral cooperation",
    "Date": "22.03.2022",
    "Link": "https://mfa.gov.lk/en/mfa-sl-uae-ambassador/",
    "Summary": "Minister of Foreign Affairs Prof. G.L. Peiris and United Arab Emirates Ambassador Khaled Nasser Al-Ameri discussed the importance of enhancing bilateral cooperation during a meeting at the Ministry of Foreign Affairs in Colombo on March 16, 2022. They emphasized the need to strengthen ties between Sri Lanka and the United Arab Emirates.",
    "Category": "Ministry News"
  },
  {
    "Title": "​U.S. Under Secretary for Political Affairs, Victoria Nuland to visit Sri Lanka",
    "Date": "21.03.2022",
    "Link": "https://mfa.gov.lk/en/us-secretary-visit-sl/",
    "Summary": "U.S. Under Secretary for Political Affairs, Victoria Nuland, will visit Sri Lanka from March 22 to 23, 2022. She oversees regional and bilateral policy issues at the U.S. Department of State. This visit aims to strengthen diplomatic relations between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Newly Appointed Egyptian Ambassador to Sri Lanka calls on the Minister of Foreign Affairs",
    "Date": "21.03.2022",
    "Link": "https://mfa.gov.lk/en/egypt-sl-fam/",
    "Summary": "The newly appointed Egyptian Ambassador to Sri Lanka, Maged Mosleh, met with the Minister of Foreign Affairs, Prof. G.L. Peiris, on March 19, 2022, at the Ministry of Foreign Affairs in Colombo. During the meeting, Minister Peiris extended a warm welcome and discussed bilateral relations between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Chinese Ambassador pays courtesy call on the Minister of Foreign Affairs",
    "Date": "20.03.2022",
    "Link": "https://mfa.gov.lk/en/sl-fam-china/",
    "Summary": "Chinese Ambassador Qi Zhenhong paid a courtesy call on Sri Lankan Minister of Foreign Affairs Prof. G.L Peiris on March 18, 2022. The meeting included discussions and the presentation of a first-day cover issued by the Chinese authorities.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Foreign Secretary Colombage discusses areas of cooperation with the new U.S. Ambassador to Sri Lanka",
    "Date": "18.03.2022",
    "Link": "https://mfa.gov.lk/en/fam-secretary-us-ambassador/",
    "Summary": "Foreign Secretary Colombage met with the new U.S. Ambassador to Sri Lanka, Julie Chung, on March 16, 2022, at the Ministry of Foreign Affairs. They discussed areas of cooperation between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Foreign Minister Prof. Peiris meets Core Group in Sri Lanka",
    "Date": "18.03.2022",
    "Link": "https://mfa.gov.lk/en/fam-meets-core-group/",
    "Summary": "Foreign Minister Prof. Peiris held an informal discussion with the Core Group on Sri Lanka at the Ministry of Foreign Affairs on Friday, March 18. The meeting included the Secretary to the Ministry of Foreign Affairs.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Joint Press Statement of the 5th NSA Level Meeting of the Colombo Security   Conclave held on 09 – 10 March 2022, in Maldives.",
    "Date": "16.03.2022",
    "Link": "https://mfa.gov.lk/en/5th-nsa-level-meeting/",
    "Summary": "Delegations from the founding members of the Colombo Security Conclave - Maldives, India, and Sri Lanka - along with the newest member, Mauritius, successfully concluded the 5th National Security Advisor Level Meeting held on 09-10 March 2022 in Maldives.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister conveys Sri Lanka’s concerns over UK Travel Advisory",
    "Date": "16.03.2022",
    "Link": "https://mfa.gov.lk/en/fam-uk-travel-advisory/",
    "Summary": "Foreign Minister Prof. G.L. Peiris raised concerns about inaccuracies in the UK Travel Advisory on Sri Lanka, leading to a negative portrayal of the country. He highlighted the need for revisions to present a more accurate image.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka delegation attends the 49th Session of the Human Rights Council in Geneva",
    "Date": "15.03.2022",
    "Link": "https://mfa.gov.lk/en/49th-unhrc-sl-fam/",
    "Summary": "Sri Lanka's delegation, led by Minister of Foreign Affairs Prof. G.L. Peiris, participated in the 49th Session of the Human Rights Council in Geneva. The delegation also included Minister of Justice Ali Sabry and State Minister.",
    "Category": "Ministry News"
  },
  {
    "Title": "​​Minister of Foreign Affairs of the Kingdom of Saudi Arabia, Prince Faisal bin Farhan bin Abdulla Al Saud and the accompanying delegation make an official visit to Sri Lanka",
    "Date": "14.03.2022",
    "Link": "https://mfa.gov.lk/en/mfa-sl-ksa-fam/",
    "Summary": "The Minister of Foreign Affairs of Saudi Arabia, Prince Faisal bin Farhan bin Abdulla Al Saud, and his delegation visited Sri Lanka. During the visit, they paid courtesy calls on President Gotabaya Rajapaksa and Prime Minister Mahinda Rajapaksa.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Cabinet Sub Committees on Economic Way Forward initiate deliberations under the Chairmanship of Minister of Foreign Affairs Prof. G.L. Peiris",
    "Date": "13.03.2022",
    "Link": "https://mfa.gov.lk/en/economic-sub-committees-fam/",
    "Summary": "Cabinet Sub Committees on Economic Way Forward, chaired by Minister of Foreign Affairs Prof. G.L. Peiris, began deliberations on economic matters with China, Japan, and the Middle East last month. The committees held their inaugural meetings on March 9 and 10, 2022, at the Parli.",
    "Category": "Ministry News"
  },
  {
    "Title": "​New U.S. Ambassador to Sri Lanka calls on Foreign Affairs Minister Peiris",
    "Date": "10.03.2022",
    "Link": "https://mfa.gov.lk/en/us-ambassador-fam-sl/",
    "Summary": "The newly appointed U.S. Ambassador to Sri Lanka, Julie Chung, met with Foreign Affairs Minister G.L. Peiris on March 9, 2022, at the Ministry of Foreign Affairs in Colombo. Minister Peiris warmly welcomed Ambassador Chung during the visit.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Overwhelming support for Sri Lanka at the Interactive Dialogue at the Human Rights Council",
    "Date": "08.03.2022",
    "Link": "https://mfa.gov.lk/en/unhrc-interactive-dialogue/",
    "Summary": "During the Interactive Dialogue at the Human Rights Council, Sri Lanka garnered significant support from countries in the Global South regarding the written update by the High Commissioner for Human Rights on March 7, 2022.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Interactive dialogue on the OHCHR report on Sri Lanka  Statement by Hon. Prof. G.L. Peiris Minister of Foreign Affairs of Sri Lanka  (Geneva, 04 March 2022)",
    "Date": "05.03.2022",
    "Link": "https://mfa.gov.lk/en/ohchr-statement-sl-fam/",
    "Summary": "During an interactive dialogue on the OHCHR report on Sri Lanka, Hon. Prof. G.L. Peiris, the Minister of Foreign Affairs of Sri Lanka, stated that Resolution 46/1 was adopted by a divided vote in the Council. Sri Lanka and other Member States opposed the resolution due to fundamental disagreement with its deeply flawed procedure.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Advisory to Sri Lankan Students in Belarus",
    "Date": "04.03.2022",
    "Link": "https://mfa.gov.lk/en/advisory-sl-students-belarus/",
    "Summary": "The Ministry of Foreign Affairs, in coordination with the Sri Lanka Embassy in Moscow, is monitoring the situation in Belarus regarding recent developments. An advisory has been issued to Sri Lankan students in Belarus to stay informed and take necessary precautions. Sri Lankan students are encouraged to follow guidance from the embassy for their safety and well-being.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Foreign Affairs Minister Prof. Peiris holds multiple meetings on the sidelines of the Human Rights Council in Geneva",
    "Date": "04.03.2022",
    "Link": "https://mfa.gov.lk/en/unhrc-uk-usa-iran-sl-fam/",
    "Summary": "Foreign Affairs Minister Prof. G.L. Peiris held meetings with the Permanent Representatives of the United States of America, the United Kingdom, and Iran on the sidelines of the Human Rights Council in Geneva. Among those he met were Bathsheba Nell Crocker, Simon Manley, and Esmaeil Bghaei Hamaneh.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Foreign Affairs Minister G.L. Peiris meets with President of the Human Rights Council and Permanent Representative of Argentina",
    "Date": "04.03.2022",
    "Link": "https://mfa.gov.lk/en/fam-unhrc-argentina/",
    "Summary": "Foreign Affairs Minister Prof. G.L. Peiris met with Federico Villegas, President of the Human Rights Council and Permanent Representative of Argentina, at the Palais des Nations. They discussed a range of issues during the meeting.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Foreign Affairs Minister G.L. Peiris meets with the United Nations High Commissioner for Human Rights",
    "Date": "03.03.2022",
    "Link": "https://mfa.gov.lk/en/fam-sl-unhc/",
    "Summary": "Foreign Affairs Minister G.L. Peiris met with United Nations High Commissioner for Human Rights Michelle Bachelet at her office in the Palaise des Nations in Geneva. They engaged in wide-ranging discussions during the meeting.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Affairs Minister Peiris holds multiple meetings on the sidelines of the Human Rights Council in Geneva",
    "Date": "03.03.2022",
    "Link": "https://mfa.gov.lk/en/fam-sl-geneva/",
    "Summary": "Foreign Affairs Minister Peiris led a high-level Sri Lankan delegation at the 49th session of the Human Rights Council in Geneva. During the event, he held meetings with delegations from Pakistan, Palestine, South Africa, and Saudi Arabia.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Foreign Ministry Facilitates Evacuation of Sri Lankans in Ukraine and Belarus in Coordination with Sri Lanka Missions in Ankara, Warsaw and Moscow",
    "Date": "02.03.2022",
    "Link": "https://mfa.gov.lk/en/fam-sl-facilitates/",
    "Summary": "The Foreign Ministry is working closely with Sri Lanka's missions in Ankara, Warsaw, and Moscow to facilitate the safe evacuation of Sri Lankan expatriates and students from Ukraine and Belarus. Seventeen Sri Lankans have been successfully evacuated so far.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Seven Sri Lankan Fishermen detained in Myanmar granted pardon by the Myanmar Government",
    "Date": "02.03.2022",
    "Link": "https://mfa.gov.lk/en/sl-fisherman-myanmar/",
    "Summary": "Seven Sri Lankan fishermen detained in Myanmar have been granted a pardon by the Myanmar Government. The fishermen were serving their sentences in jail, and this decision reflects the positive bilateral relations between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Affairs Minister G.L. Peiris attends bilateral meetings on the sidelines of the High-Level Segment of the 49th session of the Human Rights Council in Geneva",
    "Date": "02.03.2022",
    "Link": "https://mfa.gov.lk/en/fam-sl-oic-wipo/",
    "Summary": "Foreign Affairs Minister G.L. Peiris and the Sri Lanka delegation held high-level bilateral meetings on February 28, 2022, with representatives from the United Kingdom, the Commonwealth Secretariat, and the Organization of Islamic Cooperation during the High-Level Segment of the 49th session of the Human Rights Council in Geneva.",
    "Category": "Ministry News"
  },
  {
    "Title": "​49th session of the Human Rights Council High Level Segment Statement by Hon. Prof. G.L. Peiris, Minister of Foreign Affairs of Sri Lanka",
    "Date": "01.03.2022",
    "Link": "https://mfa.gov.lk/en/49th-session-unhrc-sl/",
    "Summary": "During the 49th session of the Human Rights Council's High Level Segment, Hon. Prof. G.L. Peiris, Sri Lanka's Minister of Foreign Affairs, emphasized the country's active participation in promoting and protecting human rights within the multilateral framework. He highlighted that fundamental rights are enshrined in Sri Lanka's Constitution and continuously advanced.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Developments in Ukraine: Status Update on Sri Lankan Nationals",
    "Date": "28.02.2022",
    "Link": "https://mfa.gov.lk/en/%e2%80%8bdevelopments-in-ukraine-sl/",
    "Summary": "The Foreign Ministry is actively monitoring developments in Ukraine and is evacuating around forty Sri Lankan nationals, including two students.",
    "Category": "Ministry News"
  },
  {
    "Title": "Strengthening Economic relations the focus of several meetings in Paris",
    "Date": "27.02.2022",
    "Link": "https://mfa.gov.lk/en/economic-relations-paris-sl/",
    "Summary": "Foreign Minister Prof. G.L Peiris met with Minister Delegate for Trade and Economic Attractiveness Franck Reister at the Foreign Ministry in Paris to discuss strengthening economic relations. The focus of the meetings was on French support for expanding economic ties between the two countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "Appointment of ​the ​Ambassador of the State of Libya to Sri Lanka",
    "Date": "25.02.2022",
    "Link": "https://mfa.gov.lk/en/appointment-libya-ambassador-sl/",
    "Summary": "The State of Libya, in agreement with the Government of Sri Lanka, has appointed Mr. Nasser Yonis Alfurjani as the Ambassador Extraordinary and Plenipotentiary of Libya to Sri Lanka. He will be based in Colombo.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Appointment of​ the​ Ambassador of the United States of America to Sri Lanka",
    "Date": "25.02.2022",
    "Link": "https://mfa.gov.lk/en/appointment-ambassador-usa-sl/",
    "Summary": "The United States of America, with the approval of the Government of Sri Lanka, has named Ms. Julie J. Chung as the Ambassador Extraordinary and Plenipotentiary to Sri Lanka. Ms. Chung will represent the United States in Sri Lanka in her new role.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Appointment of ​​the ​Ambassador of ​​the United Arab Emirates to Sri Lanka",
    "Date": "25.02.2022",
    "Link": "https://mfa.gov.lk/en/appointment-uae-ambassador-sl/",
    "Summary": "The United Arab Emirates, with the approval of the Government of Sri Lanka, has appointed Mr. Khaled Nasser AlAmeri as the Ambassador Extraordinary and Plenipotentiary to Sri Lanka. Mr. AlAmeri will represent the United Arab Emirates in Sri Lanka in his new role.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka and the European Union identify areas for close collaboration",
    "Date": "25.02.2022",
    "Link": "https://mfa.gov.lk/en/sl-eu-collaboration/",
    "Summary": "Sri Lanka's Foreign Minister Prof. G.L Peiris and the European Union's Commissioner for International Partnerships Jutta Urpilainen discussed areas for collaboration at the Indo-Pacific Ministerial Forum. The meeting aimed to strengthen ties between Sri Lanka and the EU.",
    "Category": "Ministry News"
  },
  {
    "Title": "Statement on Developments in Ukraine",
    "Date": "25.02.2022",
    "Link": "https://mfa.gov.lk/en/mst-ukraine/",
    "Summary": "Sri Lanka's government expresses deep concern over the escalating violence in Ukraine and urges all parties to show restraint and work towards an immediate cessation of hostilities.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Advisory to Sri Lankan Nationals in Ukraine",
    "Date": "24.02.2022",
    "Link": "https://mfa.gov.lk/en/advisory-to-sl-in-ukraine/",
    "Summary": "The Foreign Ministry has advised Sri Lankan nationals in Ukraine to stay safe amidst the escalating situation. The Sri Lanka Embassy in Ankara, which is also accredited to Kyiv, has been instructed to coordinate safe passage for its citizens. Sri Lankans in Ukraine are urged to follow the embassy's guidance for their safety.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Prof. Peiris presents Sri Lankan perspective to senators of the French Republic",
    "Date": "24.02.2022",
    "Link": "https://mfa.gov.lk/en/fm-sl-senators-french-republic/",
    "Summary": "Foreign Minister Prof. G.L. Peiris presented the Sri Lankan perspective to the senators of the French Republic during a breakfast meeting with the France-Sri Lanka Friendship Group. He expressed gratitude for the opportunity to engage with the Chair and Members of the group.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lankan and Dutch Foreign ​Ministers resolve to intensify cooperation",
    "Date": "24.02.2022",
    "Link": "https://mfa.gov.lk/en/sl-dutch-fms/",
    "Summary": "Sri Lankan Foreign Minister Professor G.L Peiris and Dutch Foreign Minister Wopke Hoekstra met at the Ministerial Forum for Cooperation in the Indo-Pacific to enhance collaboration. The meeting took place at the Foreign Ministry of the Netherlands. Both ministers resolved to intensify cooperation between their countries.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Foreign Minister Prof. Peiris emphasizes Sri Lanka’s role at Ocean Affairs Ministerial Forum in Paris",
    "Date": "23.02.2022",
    "Link": "https://mfa.gov.lk/en/fm-sl-oamf-in-paris/",
    "Summary": "Foreign Minister Prof. G.L. Peiris highlighted Sri Lanka's role at the Ocean Affairs Ministerial Forum in Paris, addressing the Ministerial Forum for Co-operation in the Indo-Pacific at the Conference Centre of the Ministry for Europe and Foreign Affairs. The forum aimed to discuss cooperation in the Indo-Pacific region.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Foreign Minister Peiris addresses Diplomatic Corps based in New Delhi",
    "Date": "22.02.2022",
    "Link": "https://mfa.gov.lk/en/fm-sl-diplomatic-corps-nd/",
    "Summary": "Foreign Minister Prof. G.L. Peiris virtually addressed the Diplomatic Corps based in New Delhi on February 18, 2022. The briefing aimed to share updates on progress related to human rights and reconciliation efforts.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Advisory on Sri Lankan Nationals in Ukraine",
    "Date": "21.02.2022",
    "Link": "https://mfa.gov.lk/en/advisory-on-sl-ukraine/",
    "Summary": "The Government of Sri Lanka is closely monitoring the situation in Ukraine following recent developments. The Sri Lanka Embassy in Ankara, which is also accredited to Kyiv, is maintaining close contact with its nationals in the region. Sri Lankan nationals in Ukraine are advised to stay informed and follow any guidance provided by the embassy.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Foreign Minister Peiris to lead Sri Lanka’s delegation to the UNHRC",
    "Date": "20.02.2022",
    "Link": "https://mfa.gov.lk/en/fm-sl-unhrc/",
    "Summary": "Foreign Minister Peiris will lead Sri Lanka's delegation to the 49th Session of the United Nations Human Rights Council in Geneva from 28 February to 1 April, 2022. The UN High Commissioner for Human Rights will present a written update on Sri Lanka during the session.",
    "Category": "Ministry News"
  },
  {
    "Title": "65th Anniversary of the Establishment of Diplomatic Relations between Sri Lanka and Russia in 2022",
    "Date": "19.02.2022",
    "Link": "https://mfa.gov.lk/en/65th-anniversary-sl-russia-2022/",
    "Summary": "In 2022, Sri Lanka and Russia marked the 65th anniversary of establishing diplomatic relations. Messages of felicitation were exchanged between the Presidents of both countries to commemorate this milestone. The messages were also translated into English for wider understanding.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Sri Lankan Missions to promote Batik, Handloom and Local Apparels",
    "Date": "18.02.2022",
    "Link": "https://mfa.gov.lk/en/sl-batik-promote/",
    "Summary": "Sri Lankan Missions are collaborating with the State Ministry of Batik, Handloom, and Local Apparel Products to promote Sri Lankan batik, handloom, and local apparel. A joint session was held on 18 February 2022 at the Foreign Ministry to discuss and strategize these promotional efforts.",
    "Category": "Ministry News"
  },
  {
    "Title": "Australia to assist Sri Lanka in developing a comprehensive national maritime disaster preparedness mechanism",
    "Date": "18.02.2022",
    "Link": "https://mfa.gov.lk/en/australia-assist-sl-maritime/",
    "Summary": "Australia is set to assist Sri Lanka in developing a comprehensive national maritime disaster preparedness mechanism. The meeting, organized by the Ocean Affairs, Environment & Climate Change Division of the Foreign Ministry and the High Commission of Australia to Sri Lanka and the Maldives, aimed to discuss this collaboration. This initiative will enhance Sri Lanka's readiness to respond to maritime disasters effectively.",
    "Category": "Ministry News"
  },
  {
    "Title": "Loan Agreement from Kuwait Fund to construct Medical Faculty at the University of Moratuwa signed in Colombo",
    "Date": "10.02.2022",
    "Link": "https://mfa.gov.lk/en/kuwait-fund-uom-colombo/",
    "Summary": "A delegation led by the Deputy Director General for Administration & Financial Affairs of the Kuwait Fund for Arab Economic Development (KFAED), Nedhal A. Al-Olayan, visited Sri Lanka to sign a loan agreement for constructing a Medical Faculty at the University of Moratuwa in Colombo.",
    "Category": "Ministry News"
  },
  {
    "Title": "Joint Press Release – EU-Sri Lanka Joint Commission",
    "Date": "09.02.2022",
    "Link": "https://mfa.gov.lk/en/eu-sri-lanka-joint-commission/",
    "Summary": "The European Union (EU) and Sri Lanka convened their 24th Joint Commission meeting on February 8, 2022, in Brussels. The meeting took place in a friendly and open atmosphere, fostering productive discussions and cooperation between the two parties.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Prof. G.L. Peiris concludes successful visit to New Delhi",
    "Date": "08.02.2022",
    "Link": "https://mfa.gov.lk/en/fm-new-delhi/",
    "Summary": "Foreign Minister of Sri Lanka Prof. G.L. Peiris successfully concluded a two-day official visit to New Delhi on February 6-8, 2022. This marked his first visit to India after assuming office.",
    "Category": "Ministry News"
  },
  {
    "Title": "The proposed amendment to the present Prevention of Terrorism Act is a progressive step towards securing, advancing and protecting fundamental rights guaranteed under the Constitution",
    "Date": "07.02.2022",
    "Link": "https://mfa.gov.lk/en/pta-sl/",
    "Summary": "The proposed amendment to the Prevention of Terrorism Act in Sri Lanka is seen as a positive step towards safeguarding fundamental rights guaranteed under the Constitution. The Government's intention to introduce this bill in Parliament is aimed at enhancing legal protections for citizens.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Israel donates a consignment of COVID 19 related medical equipment to Sri Lanka",
    "Date": "07.02.2022",
    "Link": "https://mfa.gov.lk/en/israel-donates-sl/",
    "Summary": "Israel, through the Israeli Agency for International Development Cooperation (MASHAV), donated a consignment of COVID-19 medical equipment to Sri Lanka. The donation includes ventilators, personal protective equipment (PPEs), and pulse oximeters, aiding Sri Lanka's efforts in combating the pandemic.",
    "Category": "Ministry News"
  },
  {
    "Title": "Israel Ambassador calls on Foreign Minister",
    "Date": "04.02.2022",
    "Link": "https://mfa.gov.lk/en/israel-ambassador-fm-sl/",
    "Summary": "Israel Ambassador Naor Itzhak Gilon, concurrently accredited to Sri Lanka, met with Foreign Minister Prof. G.L. Peiris on February 3, 2022. They discussed various matters of mutual interest during the courtesy call.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Ministry refutes claims made by Ambika Satkunanathan to the European Parliament’s Subcommittee on Human Rights",
    "Date": "04.02.2022",
    "Link": "https://mfa.gov.lk/en/fm-refutes-claims-ambika/",
    "Summary": "The Foreign Ministry refutes claims made by Ambika Satkunanathan to the European Parliament’s Subcommittee on Human Rights, citing numerous misleading statements in her testimony. The Ministry expressed concern over the inaccuracies presented during the exchange of views on the situation.",
    "Category": "Ministry News"
  },
  {
    "Title": "Appointment of Ambassador of the Republic of Estonia to Sri Lanka",
    "Date": "03.02.2022",
    "Link": "https://mfa.gov.lk/en/estonia-sl/",
    "Summary": "The Government of the Republic of Estonia, in agreement with the Government of Sri Lanka, has appointed Ms. Katrin Kivi as the Ambassador Extraordinary and Plenipotentiary of Estonia to Sri Lanka. Ms. Kivi will represent Estonia in Sri Lanka in her new diplomatic role.",
    "Category": "Ministry News"
  },
  {
    "Title": "Appointment of Ambassador of the Israel to Sri Lanka",
    "Date": "03.02.2022",
    "Link": "https://mfa.gov.lk/en/israel-sl/",
    "Summary": "The Government of Israel, in agreement with Sri Lanka, has appointed Mr. Naor Gilon as the new Ambassador of Israel to Sri Lanka. He will serve as the Ambassador Extraordinary and Plenipotentiary based in Sri Lanka.",
    "Category": "Ministry News"
  },
  {
    "Title": "Appointment of Ambassador of the Iceland to Sri Lanka",
    "Date": "03.02.2022",
    "Link": "https://mfa.gov.lk/en/iceland-sl/",
    "Summary": "The Government of Iceland, in agreement with Sri Lanka, has appointed Mr. Guðni Bragason as the new Ambassador of Iceland to Sri Lanka. Mr. Bragason will serve as the Ambassador Extraordinary and Plenipotentiary of Iceland in Sri Lanka.",
    "Category": "Ministry News"
  },
  {
    "Title": "Appointment of Ambassador of the Austria to Sri Lanka",
    "Date": "03.02.2022",
    "Link": "https://mfa.gov.lk/en/austria-sl/",
    "Summary": "The Government of the Republic of Austria, with the approval of the Government of Sri Lanka, has named Ms. Katharina Wieser as the new Ambassador Extraordinary and Plenipotentiary of Austria to Sri Lanka. Ms. Wieser will represent Austria in Sri Lanka in her diplomatic capacity.",
    "Category": "Ministry News"
  },
  {
    "Title": "Appointment of Ambassador of the Philippines to Sri Lanka",
    "Date": "03.02.2022",
    "Link": "https://mfa.gov.lk/en/philippines-sl/",
    "Summary": "The Government of the Republic of the Philippines, with the concurrence of Sri Lanka, has appointed Mr. Alan Deniega as the Ambassador Extraordinary and Plenipotentiary of the Philippines to Sri Lanka. Mr. Deniega will represent the Philippines in his new diplomatic role.",
    "Category": "Ministry News"
  },
  {
    "Title": "Appointment of Ambassador of the Republic of the Kazakhstan to Sri Lanka",
    "Date": "03.02.2022",
    "Link": "https://mfa.gov.lk/en/kazakhstan-sl/",
    "Summary": "The Government of Kazakhstan, with the approval of Sri Lanka, has appointed Mr. Nurlan Zhalgasbayev as the new Ambassador of Kazakhstan to Sri Lanka. Mr. Zhalgasbayev will serve as the Ambassador Extraordinary and Plenipotentiary in this role.",
    "Category": "Ministry News"
  },
  {
    "Title": "Appointment of High Commissioner of the Republic of the Gambia to Sri Lanka",
    "Date": "03.02.2022",
    "Link": "https://mfa.gov.lk/en/gambia-sl/",
    "Summary": "Mr. Mustapha Jawara has been appointed as the High Commissioner of the Republic of the Gambia to Sri Lanka by the Government of the Republic of the Gambia, with the concurrence of the Government of Sri Lanka. He will be based in New Delhi for his diplomatic role.",
    "Category": "Ministry News"
  },
  {
    "Title": "​​Appointment of Ambassador of the Kingdom of Denmark to Sri Lanka",
    "Date": "03.02.2022",
    "Link": "https://mfa.gov.lk/en/denmark-sl/",
    "Summary": "The Kingdom of Denmark, with the approval of the Government of Sri Lanka, has named Mr. Freddy Svane as the Ambassador Extraordinary and Plenipotentiary to Sri Lanka. He will be stationed in New Delhi for his diplomatic duties.",
    "Category": "Ministry News"
  },
  {
    "Title": "High Commissioner-designate of Sri Lanka to Malaysia assumes duties",
    "Date": "03.02.2022",
    "Link": "https://mfa.gov.lk/en/high-commissioner-designate-of-sri-lanka-to-malaysia-assumes-duties/",
    "Summary": "Air Chief Marshal Sumangala Dias, the newly appointed High Commissioner-designate of Sri Lanka to Malaysia, assumed his duties at the Sri Lanka High Commission in Kuala Lumpur on 27 January 2022. He officially began his role, representing Sri Lanka in Malaysia.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka’s Envoy to Maldives presents credentials to President Solih",
    "Date": "03.02.2022",
    "Link": "https://mfa.gov.lk/en/sri-lankas-envoy-to-maldives-presents-credentials-to-president-solih/",
    "Summary": "Sri Lanka's High Commissioner-designate to Maldives, A.M.J. Sadiq, presented his Letter of Credence and his predecessor's Letter of Recall to Maldives President Ibrahim Mohamed Solih.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister Peiris refutes the alleged purchase of weapons from North Korea",
    "Date": "01.02.2022",
    "Link": "https://mfa.gov.lk/en/fm-north-korea/",
    "Summary": "Foreign Minister Peiris has denied the reported purchase of weapons from North Korea following a news item on newsfirst.lk alleging such transactions. The Foreign Ministry addressed the claim made by Minister Basil R on January 31, 20.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Donation of Medical Equipment by the Sri Lankan Community in Saudi Arabia",
    "Date": "31.01.2022",
    "Link": "https://mfa.gov.lk/en/donation-saudi-arabia/",
    "Summary": "The Embassy of Sri Lanka in Saudi Arabia facilitated a donation of medical equipment worth SLRs 1.2 million for hospitals in Sri Lanka. The Sri Lanka Cultural Forum collaborated with the Sri Lankan community in Saudi Arabia to make this contribution, benefiting healthcare facilities in Sri Lanka.",
    "Category": "Ministry News"
  },
  {
    "Title": "​The Minister of Foreign Affairs of Turkey pays an official visit to Sri Lanka",
    "Date": "30.01.2022",
    "Link": "https://mfa.gov.lk/en/fam-turkey-visit-sl/",
    "Summary": "The Minister of Foreign Affairs of Turkey visited Sri Lanka, where Foreign Minister Prof. G.L. Peiris highlighted the strong partnership between the two countries during their bilateral meeting.",
    "Category": "Ministry News"
  },
  {
    "Title": "High Commissioner – designate of Sri Lanka to Maldives presents the open copy of the letter of credentials to the Foreign Ministry in Malé",
    "Date": "29.01.2022",
    "Link": "https://mfa.gov.lk/en/high-commissioner-designate-of-sri-lanka-to-maldives-presents-the-open-copy-of-the-letter-of-credentials-to-the-foreign-ministry-in-male/",
    "Summary": "The High Commissioner-designate of Sri Lanka to Maldives, A.M.J. Sadiq, presented the open copy of his letter of credentials to the Foreign Ministry in Malé upon his arrival on January 25, 2022. He assumed duties at the High Commission of Sri Lanka in Malé on the same day following a simple ceremony attended by staff.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Launching of 1919 Call Centre Services for Appointment Reservation System in the Consular Affairs Division of the Foreign Ministry",
    "Date": "28.01.2022",
    "Link": "https://mfa.gov.lk/en/1919-consular-reservation-system/",
    "Summary": "The Foreign Ministry has launched 1919 Call Centre Services to streamline appointment reservations at the Consular Affairs Division, aiding daily visitors. This collaboration with the Government Information Centre aims to enhance public assistance and operational efficiency.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Foreign Minister Prof. G.L. Peiris Briefs Diplomatic Corps on Current Initiatives",
    "Date": "27.01.2022",
    "Link": "https://mfa.gov.lk/en/fm-briefs-dpl/",
    "Summary": "Foreign Minister Prof. G.L. Peiris briefed the Diplomatic Corps at the Foreign Ministry Auditorium on January 26, 2022, marking the first diplomatic briefing of the New Year. During the address, Foreign Minister Peiris discussed current initiatives and expressed appreciation for the diplomatic community's support.",
    "Category": "Ministry News"
  },
  {
    "Title": "Human Remains of the Late Consul General of Sri Lanka in Milan Visharada Neela Wickramasinghe to Sri Lanka",
    "Date": "25.01.2022",
    "Link": "https://mfa.gov.lk/en/late-consul-general-millan/",
    "Summary": "The human remains of the late Consul General of Sri Lanka in Milan, Visharada Neela Wickramasinghe, who passed away on 17 January 2022 due to a sudden illness, will be repatriated to Sri Lanka on 27 January 2022. The repatriation is scheduled to take place on the specified date.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Foreign Minister Peiris Indonesia Ambassador identify areas of collaboration",
    "Date": "25.01.2022",
    "Link": "https://mfa.gov.lk/en/indonesia-fm-sl/",
    "Summary": "Foreign Minister Prof. G.L. Peiris and the Indonesian Ambassador discussed areas of collaboration, emphasizing the common interests and historical ties between Sri Lanka and Indonesia. They highlighted the shared goals that are rooted in their longstanding cultural connections.",
    "Category": "Ministry News"
  },
  {
    "Title": "A delegation from Bangladesh Foreign Service Academy visits the Foreign Ministry",
    "Date": "23.01.2022",
    "Link": "https://mfa.gov.lk/en/bangladesh-fs-academy-sl/",
    "Summary": "A delegation from the Bangladesh Foreign Service Academy visited the Foreign Ministry on January 21, 2021, as part of their study tour. The delegation was composed of Farha, the Director of the Foreign Service Academy of Bangladesh.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Response to the Human Rights Watch “World Report 2022”: Sri Lanka Section",
    "Date": "22.01.2022",
    "Link": "https://mfa.gov.lk/en/hrw-world-report-2022-sl/",
    "Summary": "The Foreign Ministry expressed regret over the portrayal of Sri Lanka in the HRW \"World Report 2022,\" citing it as exaggerated and overly negative. The ministry emphasized that the report does not accurately reflect the current human rights situation in the country.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Foreign Minister discusses range of projects with Korean Speaker",
    "Date": "21.01.2022",
    "Link": "https://mfa.gov.lk/en/fm-sl-korean-speaker/",
    "Summary": "Foreign Minister Prof. G.L. Peiris hosted a lunch on January 20, 2022, in honor of the visiting Korean Delegation led by Speaker Park Byeong-Seug of the National Assembly of the Republic of Korea. They discussed a range of projects during the meeting.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Joint Press Conference to launch the celebration of the 70th anniversary of the establishment of Diplomatic Relations between Sri Lanka and Japan",
    "Date": "20.01.2022",
    "Link": "https://mfa.gov.lk/en/japan-sl-joint-conference/",
    "Summary": "The Foreign Ministry and Embassy of Japan held a joint press conference at the Sasakawa Center to mark the 70th anniversary of diplomatic relations between Sri Lanka and Japan. The event launched the celebration of this milestone achievement.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Sri Lanka and the UK acknowledge multifaceted partnership at meeting between Foreign Minister and British Minister for South Asia Lord Ahmad",
    "Date": "19.01.2022",
    "Link": "https://mfa.gov.lk/en/uk-sl-mou/",
    "Summary": "During a meeting between Sri Lanka's Foreign Minister Prof. G. L. Peiris and British Minister for South Asia Lord Ahmad, they acknowledged the unique and multifaceted partnership between Sri Lanka and the UK, based on shared democratic values and historical ties. The discussions highlighted the strong relationship between the two countries, emphasizing cooperation in various areas.",
    "Category": "Ministry News"
  },
  {
    "Title": "Government of Sri Lanka corrects erroneous and outdated information contained in the Canadian Travel Advisory on Sri Lanka",
    "Date": "19.01.2022",
    "Link": "https://mfa.gov.lk/en/sl-canadian/",
    "Summary": "The Government of Sri Lanka has corrected erroneous and outdated information in the Canadian Travel Advisory issued on January 13, 2022. The advisory did not accurately reflect the current situation in Sri Lanka.",
    "Category": "Ministry News"
  },
  {
    "Title": "Sri Lanka condemns terrorist attacks in United Arab Emirates",
    "Date": "18.01.2022",
    "Link": "https://mfa.gov.lk/en/condemns-attacks-uae/",
    "Summary": "Sri Lanka's government strongly condemns the recent terrorist attacks on civilian facilities in the United Arab Emirates, leading to the deaths of several civilians. We extend our deepest condolences to the families of the victims during this tragic event.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Demise of Consul General of Sri Lanka in Milan Visharada Neela Wickramasinghe",
    "Date": "18.01.2022",
    "Link": "https://mfa.gov.lk/en/demise-visharada-wickramasinghe/",
    "Summary": "The Foreign Ministry announced the passing of Consul General of Sri Lanka in Milan, Visharada D.D. Neela Wickramasinghe, who died in Milan, Italy on January 17, 2022. The ministry expressed deep sorrow at the loss.",
    "Category": "Ministry News"
  },
  {
    "Title": "The message of H.E. Gotabaya Rajapaksa, President of Sri Lanka for Thai Pongal 2022",
    "Date": "14.01.2022",
    "Link": "https://mfa.gov.lk/en/the-message-of-h-e-gotabaya-rajapaksa-president-of-sri-lanka-for-thai-pongal-2022/",
    "Summary": "President of Sri Lanka, H.E. Gotabaya Rajapaksa, delivered a message for Thai Pongal 2022. The message was conveyed in English, Sinhala, and Tamil languages, emphasizing the significance of the festival for the people of Sri Lanka.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Hungarian Minister of Foreign Affairs and Trade Visits Sri Lanka",
    "Date": "13.01.2022",
    "Link": "https://mfa.gov.lk/en/hungarian-sl-affairs/",
    "Summary": "Hungarian Minister of Foreign Affairs and Trade visited Sri Lanka, where Foreign Minister Prof. G.L. Peiris expressed Sri Lanka's interest in enhancing bilateral ties with Hungary. Both countries aim to develop a results-oriented, multi-faceted partnership.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Sri Lanka to host Asian Development Bank Annual Meeting in Colombo",
    "Date": "12.01.2022",
    "Link": "https://mfa.gov.lk/en/adb-annual-meeting/",
    "Summary": "Sri Lanka will host the Asian Development Bank Annual Meeting in Colombo. Foreign Secretary Admiral Prof. Jayanath Colombage chaired a meeting at the Foreign Ministry on January 11, 2022, to discuss the arrangements for the event.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Foreign Ministry of China donates COVID 19 related medical equipment to Sri Lanka",
    "Date": "12.01.2022",
    "Link": "https://mfa.gov.lk/en/china-donation/",
    "Summary": "The Foreign Ministry of China donated a large consignment of COVID-19 related medical equipment to Sri Lanka. The donation includes multipara monitors, high flow oxygen nasal therapy machines, oxygen concentrators, and oxygen cylinders. This aid aims to support Sri Lanka in its fight against the pandemic.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Speaker of the National Assembly of the Republic of Korea to visit Sri Lanka next week",
    "Date": "11.01.2022",
    "Link": "https://mfa.gov.lk/en/rok_sl/",
    "Summary": "The Speaker of the National Assembly of the Republic of Korea, Park Byeong-Seng, will visit Sri Lanka next week. This follows recent discussions held at the Speaker’s Office in Seoul with Foreign Minister Professor G. L. Peiris.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Sri Lanka and China re-affirm the special bonds of friendship between the two nations",
    "Date": "10.01.2022",
    "Link": "https://mfa.gov.lk/en/china-sl-friendship/",
    "Summary": "Sri Lanka's Foreign Minister Prof. G.L. Peiris emphasized the strong and diverse partnership between Sri Lanka and China during a bilateral meeting. The meeting aimed to reaffirm the special bonds of friendship between the two nations.",
    "Category": "Ministry News"
  },
  {
    "Title": "Foreign Minister of Sri Lanka meets Prime Minister of the Republic of Korea",
    "Date": "07.01.2022",
    "Link": "https://mfa.gov.lk/en/fm-sl-pm-korea/",
    "Summary": "During his courtesy call on the Prime Minister of the Republic of Korea in Seoul, Foreign Minister Prof. G. L. Peiris requested increased opportunities for Sri Lankan workers. The meeting aimed to strengthen bilateral relations between Sri Lanka and South Korea.",
    "Category": "Ministry News"
  },
  {
    "Title": "Special Investment Zone for South Korea Proposed by Foreign Minister Prof. G. L. Peiris",
    "Date": "07.01.2022",
    "Link": "https://mfa.gov.lk/en/special-investment-zone-fm-sl/",
    "Summary": "Foreign Minister Prof. G. L. Peiris proposed a Special Investment Zone for South Korea during discussions in Seoul. The meeting focused on trade, investment, political cooperation, defense initiatives, tourism, and labor issues between Sri Lanka and South Korea.",
    "Category": "Ministry News"
  },
  {
    "Title": "​Foreign Minister Prof. G. L. Peiris meets Deputy Prime Minister and Minister of Education of the Republic of Korea in Seoul",
    "Date": "06.01.2022",
    "Link": "https://mfa.gov.lk/en/fm-sl-meets-korea-dpm/",
    "Summary": "Foreign Minister Prof. G. L. Peiris discussed assistance for vocational education during a meeting with Deputy Prime Minister and Minister of Education Yoo Eun-hye in Seoul. They held discussions on enhancing cooperation in this area.",
    "Category": "Ministry News"
  },
  {
    "Title": "New Year message of H.E Gotabaya Rajapaksa, President of Sri Lanka -2022",
    "Date": "01.01.2022",
    "Link": "https://mfa.gov.lk/en/new-year-message-of-h-e-gotabaya-rajapaksa-president-of-sri-lanka-2022/",
    "Summary": "In his New Year message for 2022, Sri Lankan President Gotabaya Rajapaksa emphasized the importance of unity and solidarity among citizens to overcome challenges and achieve national development goals. He called for collective efforts to build a prosperous and peaceful future for the country.",
    "Category": "Ministry News"
  }
]