[
  {
    "Title": "Another donation of urgent medicine worth USD 7.2 million from  Heart to heart international in the United States to the people of Sri Lanka",
    "Date": "30.12.2022",
    "Link": "https://mfa.gov.lk/en/another-donation-of-urgent-medicine-worth-usd-7-2-million-from-heart-to-heart-international-in-the-united-states-to-the-people-of-sri-lanka/",
    "Summary": "Heart to Heart International in the United States has donated urgent medicine worth USD 7.2 million to the people of Sri Lanka. The donation was made under the guidance of His Excellency Ambassador Mahinda Samarasinghe, according to a joint press release by the Embassy of Sri Lanka, Washington D.C., and Heart to Heart International.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka participates at the OTOP City-2022 in Thailand for the first time",
    "Date": "30.12.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-participates-at-the-otop-city-2022-in-thailand-for-the-first-time/",
    "Summary": "For the first time, Sri Lanka participated in the OTOP City-2022 event in Thailand, organized by the Embassy and Permanent Mission of Sri Lanka in Bangkok in collaboration with the Community Development Department of the Ministry of Interior of Thailand. The event aimed to showcase Sri Lankan products and promote cultural exchange between the two countries.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka High Commission in Singapore celebrates Christmas",
    "Date": "30.12.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-high-commission-in-singapore-celebrates-christmas-2/",
    "Summary": "The Sri Lanka High Commission in Singapore celebrated Christmas on 28 December 2022 with prayers, carols, and entertainment. The event began with a welcome address by the High Commissioner, marking a festive evening of joy and celebration.",
    "Category": "Mission News"
  },
  {
    "Title": "Embassy in Kuwait Celebrates Christmas with the Sri Lankan Community",
    "Date": "29.12.2022",
    "Link": "https://mfa.gov.lk/en/embassy-in-kuwait-celebrates-christmas-with-the-sri-lankan-community/",
    "Summary": "The Embassy of Sri Lanka in Kuwait, along with the Sri Lankan community, celebrated Christmas on December 22, 2022, at the Embassy premises, fostering unity and harmony during the festivities. The event brought together members of the community to mark the holiday season.",
    "Category": "Mission News"
  },
  {
    "Title": "Ambassador of Sri Lanka to Türkiye  Hasanthi Dissanayake, Presents Credentials in Ankara",
    "Date": "29.12.2022",
    "Link": "https://mfa.gov.lk/en/ambassador-of-sri-lanka-to-turkiye-hasanthi-dissanayake-presents-credentials-in-ankara/",
    "Summary": "Saranya Hasanthi Urugodawatte Dissanayake, the new Ambassador of Sri Lanka to Türkiye, presented her credentials to President Recep Tayyip Erdoğan on 27 December 2021 in Ankara.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka joins “Reinvigoration of Ayutthaya’s Foreign Relations” conducted by the National Assembly of   the Kingdom of Thailand",
    "Date": "28.12.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-joins-reinvigoration-of-ayutthayas-foreign-relations-conducted-by-the-national-assembly-of-the-kingdom-of-thailand/",
    "Summary": "Sri Lanka has joined the \"Reinvigoration of Ayutthaya’s Foreign Relations\" initiative led by the National Assembly of the Kingdom of Thailand. The Ambassador and Pe were invited by the Chairman of the Senate Committee on Upholding the Monarchy and the Senate Standing Committee on Foreign Affairs.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka shines at “3rd International Thai Silk Fashion Week”   in Bangkok",
    "Date": "28.12.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-shines-at-3rd-international-thai-silk-fashion-week-in-bangkok-2/",
    "Summary": "Sri Lanka showcased its talent at the \"3rd International Thai Silk Fashion Week\" in Bangkok with the participation of Creative Director Darshi Keerthisena from Buddhi Batiks, coordinated by the Embassy and Permanent Mission of Sri Lanka in Bangkok. The event was held at Royal Paragon Hall.",
    "Category": "Mission News"
  },
  {
    "Title": "Embassy of Sri Lanka in Brazil networks with Brazilian media  to promote Sri Lankan Tourism, Cuisine and Ceylon Tea",
    "Date": "27.12.2022",
    "Link": "https://mfa.gov.lk/en/embassy-of-sri-lanka-in-brazil-networks-with-brazilian-media-to-promote-sri-lankan-tourism-cuisine-and-ceylon-tea/",
    "Summary": "The Embassy of Sri Lanka in Brazil recently held a networking session with journalists from Brasilia-based printed and electronic media to promote Sri Lankan tourism, cuisine, and Ceylon tea. This initiative is part of the embassy's efforts to boost trade and tourism promotion between the two countries.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka and Cambodia Exempt Visa for holders of Diplomatic and Official Passports with effect from 24 December 2022",
    "Date": "27.12.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-and-cambodia-exempt-visa-for-holders-of-diplomatic-and-official-passports-with-effect-from-24-december-2022/",
    "Summary": "Sri Lanka and Cambodia have agreed to exempt visa requirements for holders of Diplomatic and Official Passports starting from 24 December 2022. The agreement was signed on 10 May 2022 at the Ministry of Foreign Affairs and International Cooperation. This initiative aims to facilitate easier travel for diplomatic and official passport holders between the two countries.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lankan Ambassador calls on the Kuwait Parliament Speaker",
    "Date": "23.12.2022",
    "Link": "https://mfa.gov.lk/en/sri-lankan-ambassador-calls-on-the-kuwait-parliament-speaker/",
    "Summary": "Sri Lanka’s Ambassador to Kuwait, U. L. Mohammed Jauhar, recently met with Kuwait's Parliament Speaker, Ahmad Abdulaziz Al-Saadoun, who has been appointed to the position for the fourth time. The meeting was a courtesy call to strengthen diplomatic ties between the two nations.",
    "Category": "Mission News"
  },
  {
    "Title": "False information on Pirith Chanting Ceremony held at the Embassy premises reported in Sri Lankan Media",
    "Date": "22.12.2022",
    "Link": "https://mfa.gov.lk/en/false-information-on-pirith-chanting-ceremony-held-at-the-embassy-premises-reported-in-sri-lankan-media/",
    "Summary": "The Embassy of Sri Lanka in Oman refutes false information reported by several Television Channels regarding a Pirith Chanting Ceremony held at the Embassy premises on 16 December 2022.",
    "Category": "Mission News"
  },
  {
    "Title": "South Indian investors are invited to invest in Sri Lanka",
    "Date": "22.12.2022",
    "Link": "https://mfa.gov.lk/en/south-indian-investors-are-invited-to-invest-in-sri-lanka/",
    "Summary": "South Indian investors are invited to explore trade and investment opportunities in Sri Lanka by the Deputy High Commission of Sri Lanka in Chennai in collaboration with the Southern India Chamber of Commerce & Industry (SICCI). This initiative aims to enhance awareness and foster economic partnerships between the two regions.",
    "Category": "Mission News"
  },
  {
    "Title": "High Commissioner Navaratne reiterates   that Sri Lanka  stands  for a healthy and sustainable planet at COP-15 in Montreal, Canada",
    "Date": "21.12.2022",
    "Link": "https://mfa.gov.lk/en/high-commissioner-navaratne-reiterates-that-sri-lanka-stands-for-a-healthy-and-sustainable-planet-at-cop-15-in-montreal-canada/",
    "Summary": "High Commissioner Harsh Kumara Navaratne reiterated Sri Lanka's commitment to a healthy and sustainable planet at COP-15 in Montreal, Canada. He stated that Sri Lanka is always ready to stand with the international community in achieving this goal.",
    "Category": "Mission News"
  },
  {
    "Title": "The Deputy High Commission of Sri Lanka in Chennai celebrates Christmas",
    "Date": "21.12.2022",
    "Link": "https://mfa.gov.lk/en/the-deputy-high-commission-of-sri-lanka-in-chennai-celebrates-christmas/",
    "Summary": "The Deputy High Commission of Sri Lanka in Chennai celebrated Christmas on December 16, 2022, at the Chancery premises. Rev. V. S. Vijayakumar delivered the Christmas message and bestowed blessings during the event. It was a festive celebration marking the holiday season.",
    "Category": "Mission News"
  },
  {
    "Title": "65th Anniversary of diplomatic relations between Sri Lanka and Nepal celebrated in   Kathmandu",
    "Date": "21.12.2022",
    "Link": "https://mfa.gov.lk/en/65th-anniversary-of-diplomatic-relations-between-sri-lanka-and-nepal-celebrated-in-kathmandu/",
    "Summary": "In Kathmandu, a dialogue titled \"Nepal-Sri Lanka Friendship: From Ancient Links to the Present\" was held on December 19, 2022, to celebrate the 65th anniversary of diplomatic relations between Sri Lanka and Nepal. The event was organized by the Embassy of Sri Lanka.",
    "Category": "Mission News"
  },
  {
    "Title": "Deputy High Commission of Sri Lanka for Southern India conducts  the 20th special consular camp",
    "Date": "20.12.2022",
    "Link": "https://mfa.gov.lk/en/deputy-high-commission-of-sri-lanka-for-southern-india-conducts-the-20th-special-consular-camp/",
    "Summary": "The Deputy High Commission of Sri Lanka for Southern India held its 20th special consular camp on December 14, 2022, at the Chancery premises. The event was attended by State Minister of Fisheries Piyal Nishantha De Silva.",
    "Category": "Mission News"
  },
  {
    "Title": "Appointment of Honorary Consul of Sri Lanka in Mindanao",
    "Date": "16.12.2022",
    "Link": "https://mfa.gov.lk/en/appointment-of-honorary-consul-of-sri-lanka-in-mindanao/",
    "Summary": "The Democratic Socialist Republic of Sri Lanka, in agreement with the Republic of the Philippines, has appointed William Chen as the Honorary Consul of Sri Lanka in Mindanao. He will have consular jurisdiction over the Davao region.",
    "Category": "Mission News"
  },
  {
    "Title": "The Consulate General of Sri Lanka inaugurates   ‘Tourism Promotional Window’",
    "Date": "16.12.2022",
    "Link": "https://mfa.gov.lk/en/the-consulate-general-of-sri-lanka-inaugurates-tourism-promotional-window/",
    "Summary": "The Consulate General of Sri Lanka in Jeddah, Falah Mowlana Alhabshi, officially inaugurated the 'Tourism Promotional Window' with the support of the Sri Lanka Tourism Promotion Bureau and guidance from the Ministry of Foreign Affairs. This initiative aims to promote tourism in Sri Lanka effectively.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lankan Film “The Newspaper” screened in Riyadh",
    "Date": "16.12.2022",
    "Link": "https://mfa.gov.lk/en/sri-lankan-film-the-newspaper-screened-in-riyadh/",
    "Summary": "The Sri Lankan film \"The Newspaper,\" directed by Sartah Kothalawala and Kumara Thirimadura, was screened in Riyadh, Saudi Arabia as part of the \"Ambassador's Choice: Film Festival\" organized by the Embassy of India.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka promotes business ties with the UAE",
    "Date": "16.12.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-promotes-business-ties-with-the-uae/",
    "Summary": "Sri Lanka's Consulate General in Dubai, along with the National Chamber of Exporters, facilitated a visit by a 12-member business delegation from Sri Lanka to the UAE from December 5 to 9. The delegation aimed to strengthen business ties between the two countries.",
    "Category": "Mission News"
  },
  {
    "Title": "Ambassador Wishwanath Aponsu presents Letter of Credence to Chairperson of Mejlis of Turkmenistan Gülşat Mämmedowa",
    "Date": "15.12.2022",
    "Link": "https://mfa.gov.lk/en/ambassador-wishwanath-aponsu-presents-letter-of-credence-to-chairperson-of-mejlis-of-turkmenistan-gulsat-mammedowa/",
    "Summary": "Ambassador G.M.V. Wishwanath Aponsu presented his Letter of Credence to Gülşat Mämmedowa, the Chairperson of the Mejlis of Turkmenistan, on December 8, 2022, at the Mejlis Complex in Ashgabat.",
    "Category": "Mission News"
  },
  {
    "Title": "Consul General-designate of the Consulate General of Sri Lanka in Melbourne assumes duties",
    "Date": "15.12.2022",
    "Link": "https://mfa.gov.lk/en/consul-general-designate-of-the-consulate-general-of-sri-lanka-in-melbourne-assumes-duties/",
    "Summary": "Sandith Samarasinghe, the Consul General-designate of Sri Lanka to Victoria, South Australia, and Tasmania, assumed duties at the Consulate General of Sri Lanka in Melbourne on December 12, 2022. He officially started his role at the consulate, addressing the responsibilities and tasks ahead.",
    "Category": "Mission News"
  },
  {
    "Title": "Ambassador of Sri Lanka to the Philippines pays a farewell call on the Secretary (Minister) of Foreign Affairs of the Philippines",
    "Date": "13.12.2022",
    "Link": "https://mfa.gov.lk/en/ambassador-of-sri-lanka-to-the-philippines-pays-a-farewell-call-on-the-secretary-minister-of-foreign-affairs-of-the-philippines/",
    "Summary": "Sri Lankan Ambassador to the Philippines, Shobini Gunasekera, bid farewell to Philippine Foreign Affairs Secretary Enrique A. Manalo as she concluded her assignment. The ambassador paid a courtesy visit to Secretary Manalo to mark the end of her tenure.",
    "Category": "Mission News"
  },
  {
    "Title": "High Commissioner Moragoda meets Chief Coordinator for  India’s G20 Presidency to discuss engagement opportunities for  Sri Lanka",
    "Date": "13.12.2022",
    "Link": "https://mfa.gov.lk/en/high-commissioner-moragoda-meets-chief-coordinator-for-indias-g20-presidency-to-discuss-engagement-opportunities-for-sri-lanka/",
    "Summary": "Sri Lanka’s High Commissioner to India, Milinda Moragoda, met with Harsh Vardhan Shringla, the Chief Coordinator for India’s G20 Presidency for 2023, in New Delhi on December 12, 2022. The meeting aimed to discuss engagement opportunities for Sri Lanka in the context of India's G20 Presidency.",
    "Category": "Mission News"
  },
  {
    "Title": "High Commissioner Moragoda discusses ways to enhance cooperation at parliamentary level with Chairman of the Committee on External Affairs of the Indian Parliament",
    "Date": "13.12.2022",
    "Link": "https://mfa.gov.lk/en/high-commissioner-moragoda-discusses-ways-to-enhance-cooperation-at-parliamentary-level-with-chairman-of-the-committee-on-external-affairs-of-the-indian-parliament/",
    "Summary": "Sri Lanka's High Commissioner to India, Milinda Moragoda, discussed enhancing cooperation at the parliamentary level with the Chairman of the Committee on External Affairs of the Indian Parliament. Both countries explored ways to strengthen collaboration during the meeting.",
    "Category": "Mission News"
  },
  {
    "Title": "Appointment of a new Honorary Consul in Tyrol",
    "Date": "13.12.2022",
    "Link": "https://mfa.gov.lk/en/appointment-of-a-new-honorary-consul-in-tyrol/",
    "Summary": "Dr. Christian Steppan has been appointed as the new Honorary Consul of Sri Lanka in Tyrol, with the approval of both the Government of Sri Lanka and the Government of the Republic of Austria. The official ceremony for the appointment has taken place.",
    "Category": "Mission News"
  },
  {
    "Title": "The Embassy of Sri Lanka in Viet Nam participates in  International Food Festival 2022",
    "Date": "12.12.2022",
    "Link": "https://mfa.gov.lk/en/the-embassy-of-sri-lanka-in-viet-nam-participates-in-international-food-festival-2022/",
    "Summary": "The Embassy of Sri Lanka in Ha Noi, Viet Nam took part in the 2022 International Food Festival organized by the Ministry of Foreign Affairs of Viet Nam on December 11.",
    "Category": "Mission News"
  },
  {
    "Title": "High Commissioner Moragoda invited to address the Economic Advisory Council to the Prime Minister of India",
    "Date": "08.12.2022",
    "Link": "https://mfa.gov.lk/en/high-commissioner-moragoda-invited-to-address-the-economic-advisory-council-to-the-prime-minister-of-india/",
    "Summary": "Sri Lanka’s High Commissioner to India, Milinda Moragoda, was invited to address the Economic Advisory Council to the Prime Minister of India. He met with the Chairman of the EAC-PM, Dr. Bibek Debroy, on December 8, 2022, at the latter’s office in New Delhi.",
    "Category": "Mission News"
  },
  {
    "Title": "Transit visit of State Minister of Foreign Affairs to Singapore",
    "Date": "07.12.2022",
    "Link": "https://mfa.gov.lk/en/transit-visit-smfa-singapore/",
    "Summary": "State Minister of Foreign Affairs Tharaka Balasuriya made a brief transit visit to Singapore on December 7, 2022. During the visit, he met with the Senior Minister of State from the Ministry of Foreign Affairs and Ministry of N.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka showcases handicraft, Ceylon tea and cuisine at UNWG International Charity Bazaar 2022",
    "Date": "06.12.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-showcases-handicraft-ceylon-tea-and-cuisine-at-unwg-international-charity-bazaar-2022/",
    "Summary": "Sri Lanka, along with other embassies, showcased its handicrafts, Ceylon tea, and cuisine at the UNWG International Charity Bazaar 2022 organized by the United Nations Women’s Guild. The Embassy and Permanent Mission of Sri Lanka actively participated in the event, highlighting the country's cultural offerings to support charity initiatives.",
    "Category": "Mission News"
  },
  {
    "Title": "High Commissioner Moragoda meets Finance Minister of India to review the status of bilateral economic cooperation",
    "Date": "06.12.2022",
    "Link": "https://mfa.gov.lk/en/high-commissioner-moragoda-meets-finance-minister-of-india-to-review-the-status-of-bilateral-economic-cooperation/",
    "Summary": "Sri Lankan High Commissioner to India, Milinda Moragoda, met with India's Finance and Corporate Affairs Minister, Nirmala Sitharaman, on December 6, 2022, at her office in North Block, New Delhi. The meeting aimed to review the status of bilateral economic cooperation between the two countries.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lankan businesses participate in the Viet Nam Expo for the first time",
    "Date": "06.12.2022",
    "Link": "https://mfa.gov.lk/en/sri-lankan-businesses-participate-in-the-viet-nam-expo-for-the-first-time/",
    "Summary": "Sri Lankan businesses participated in the Viet Nam Expo for the first time, organized by the Embassy of Sri Lanka in collaboration with the Export Development Board (EDB). The event took place from 01 to 03 December 2022 at Sai, marking a significant milestone in bilateral trade relations.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka signs the Second Additional Protocol to the Convention on Cybercrime on enhanced co-operation and disclosure of electronic evidence of the Council of Europe",
    "Date": "06.12.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-signs-the-second-additional-protocol-to-the-convention-on-cybercrime-on-enhanced-co-operation-and-disclosure-of-electronic-evidence-of-the-council-of-europe/",
    "Summary": "Ambassador Grace Asirwatham signed the Second Additional Protocol to the Convention on Cybercrime on Enhanced Cooperation and Disclosure of Electronic Evidence on behalf of the Government of Sri Lanka. This protocol aims to enhance cooperation and facilitate the disclosure of electronic evidence, aligning with the Council of Europe's objectives in combating cybercrime.",
    "Category": "Mission News"
  },
  {
    "Title": "Fostering goodwill and solidarity through charity:  Donation of medical supplies to Sri Lanka from the Philippines",
    "Date": "05.12.2022",
    "Link": "https://mfa.gov.lk/en/fostering-goodwill-and-solidarity-through-charity-donation-of-medical-supplies-to-sri-lanka-from-the-philippines/",
    "Summary": "The Embassy of Sri Lanka in Manila facilitated a donation of 5,000 units of peritoneal dialysis solutions from Michael Chen T., Chairman of the Philippines-Sri Lanka Business Council, to Sri Lanka, fostering goodwill and solidarity through charity.",
    "Category": "Mission News"
  },
  {
    "Title": "High Commissioner Moragoda interacts with envoys from Middle East, Central Asia and the Southeast Asian countries concurrently accredited to Sri Lanka",
    "Date": "05.12.2022",
    "Link": "https://mfa.gov.lk/en/high-commissioner-moragoda-interacts-with-envoys-from-middle-east-central-asia-and-the-southeast-asian-countries-concurrently-accredited-to-sri-lanka/",
    "Summary": "Sri Lanka's High Commissioner to India, Milinda Moragoda, engaged with envoys from Middle East, Central Asia, and Southeast Asian countries concurrently accredited to Sri Lanka in New Delhi. This interaction is part of the High Commission's efforts to strengthen engagement with diplomatic missions.",
    "Category": "Mission News"
  },
  {
    "Title": "High Commissioner of Sri Lanka in Pakistan makes an official  visit to Karachi",
    "Date": "05.12.2022",
    "Link": "https://mfa.gov.lk/en/high-commissioner-of-sri-lanka-in-pakistan-makes-an-official-visit-to-karachi/",
    "Summary": "The High Commissioner of Sri Lanka in Pakistan, Vice Admiral Mohan Wijewickrama, visited Karachi from 26 to 29 November 2022. During his visit, he engaged with business communities and participated in promotional activities, strengthening bilateral ties between the two countries.",
    "Category": "Mission News"
  },
  {
    "Title": "Foreign Minister Ali Sabry Meets U.S. Secretary of State Antony Blinken in Washington D.C.",
    "Date": "03.12.2022",
    "Link": "https://mfa.gov.lk/en/fmsl-us-sec-2022/",
    "Summary": "Foreign Minister Ali Sabry visited Washington D.C. from November 30 to December 2, 2022, to meet with U.S. Secretary of State Antony Blinken. The two officials held discussions during the visit.",
    "Category": "Mission News"
  },
  {
    "Title": "​Sinopec to Import and Market Sri Lanka Products at 27,000 Outlets",
    "Date": "02.12.2022",
    "Link": "https://mfa.gov.lk/en/%e2%80%8bsinopec-to-import-and-market-sri-lanka-products-at-27000-outlets/",
    "Summary": "Sinopec, a major oil company with 27,000 service stations in China, has partnered with Beijing Sri Road Connection Trade Company Limited at the Shanghai CIIE to import and market products from Sri Lanka. The agreement will enable the distribution of Sri Lankan products through Sinopec's extensive network of outlets.",
    "Category": "Mission News"
  },
  {
    "Title": "Honorary Consul in Belgium, felicitated for 25 years of service to Sri Lanka",
    "Date": "01.12.2022",
    "Link": "https://mfa.gov.lk/en/honorary-consul-in-belgium-felicitated-for-25-years-of-service-to-sri-lanka/",
    "Summary": "The Embassy of Sri Lanka in Brussels honored Monique De Decker-Deprez for her 25 years of service as Sri Lanka's Honorary Consul in Antwerp, Belgium on November 22, 2022. The event celebrated her long-standing dedication to fostering relations between the two countries.",
    "Category": "Mission News"
  },
  {
    "Title": "The former President of China, Jiang Zemin will be long remembered",
    "Date": "01.12.2022",
    "Link": "https://mfa.gov.lk/en/the-former-president-of-china-jiang-zemin-will-be-long-remembered/",
    "Summary": "The Embassy of Sri Lanka to China expresses deep sadness over the passing of former Chinese President Jiang Zemin, who was widely regarded as an outstanding leader and greatly respected by his people. Jiang Zemin will be long remembered for his leadership and the sincere love he received from the Chinese population.",
    "Category": "Mission News"
  },
  {
    "Title": "Showcasing Sri Lanka’s finest products: Ceylon Tea, Spices, and Coffee at the International Bazaar 2022",
    "Date": "29.11.2022",
    "Link": "https://mfa.gov.lk/en/showcasing-sri-lankas-finest-products-ceylon-tea-spices-and-coffee-at-the-international-bazaar-2022/",
    "Summary": "The Embassy of Sri Lanka in Manila showcased the country's finest products, including Ceylon Tea, Spices, and Coffee, at the International Bazaar 2022 in Pasay City, Philippines on November 20, 2022. The event featured participation from local distributors of these renowned Sri Lankan products, held at the World Trade Center.",
    "Category": "Mission News"
  },
  {
    "Title": "Foreign Minister Ali Sabry calls on Prime Minister Sheikh Hasina of Bangladesh",
    "Date": "26.11.2022",
    "Link": "https://mfa.gov.lk/en/foreign-minister-ali-sabry-calls-on-prime-minister-sheikh-hasina-of-bangladesh/",
    "Summary": "Foreign Minister Ali Sabry visited Prime Minister Sheikh Hasina at her Official Residence in Dhaka, Bangladesh on 25 November 2022. During the meeting, they discussed longstanding diplomatic relations between their countries.",
    "Category": "Mission News"
  },
  {
    "Title": "Chinese cruise ships to visit Sri Lanka after travel restrictions are relaxed",
    "Date": "25.11.2022",
    "Link": "https://mfa.gov.lk/en/chinese-cruise-ships-to-visit-sri-lanka-after-travel-restrictions-are-relaxed/",
    "Summary": "Chinese cruise ships and yachts will soon visit Sri Lanka as travel restrictions are eased. The Sri Lanka Embassy in Beijing is working to attract more Chinese tourists, exploring opportunities for increased tourism. Ambassador Dr. Pa is actively involved in these efforts to enhance tourism between the two countries.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lankan Embassy in Jakarta explores opportunities for Sri Lankan companies to enter the Indonesian market through Shopee– Ecommerce platform",
    "Date": "25.11.2022",
    "Link": "https://mfa.gov.lk/en/sri-lankan-embassy-in-jakarta-explores-opportunities-for-sri-lankan-companies-to-enter-the-indonesian-market-through-shopee-ecommerce-platform/",
    "Summary": "The Sri Lankan Embassy in Jakarta is exploring opportunities for Sri Lankan companies to enter the Indonesian market through Shopee, a leading e-commerce platform. Shopee, a Singapore-based multinational tech company, is the largest e-commerce platform in South East Asia with 343 million monthly visitors, serving consumers and businesses.",
    "Category": "Mission News"
  },
  {
    "Title": "Foreign Minister Sabry meets Sri Lankan business community in Bangladesh",
    "Date": "25.11.2022",
    "Link": "https://mfa.gov.lk/en/foreign-minister-sabry-meets-sri-lankan-business-community-in-bangladesh/",
    "Summary": "Foreign Minister Ali Sabry met with the Sri Lankan business community in Bangladesh, as well as Bangladesh business professionals, at a reception hosted at the official residence of Sri Lanka’s High Commissioner Prof. Sudharshan. The meeting aimed to strengthen economic ties and foster collaboration between the two countries.",
    "Category": "Mission News"
  },
  {
    "Title": "Foreign Minister Sabry discusses key areas of collaboration in shipping sector with Bangladesh",
    "Date": "24.11.2022",
    "Link": "https://mfa.gov.lk/en/foreign-minister-sabry-discusses-key-areas-of-collaboration-in-shipping-sector-with-bangladesh/",
    "Summary": "Foreign Minister Ali Sabry discussed collaboration in the shipping sector with Bangladesh's State Minister of Shipping, Khalid Mahmud Chowdhury on November 23. The meeting aimed to strengthen cooperation between the two countries in key areas of the shipping industry.",
    "Category": "Mission News"
  },
  {
    "Title": "Foreign Minister Sabry meets Foreign Minister of Bangladesh",
    "Date": "24.11.2022",
    "Link": "https://mfa.gov.lk/en/foreign-minister-sabry-meets-foreign-minister-of-bangladesh/",
    "Summary": "Foreign Minister Ali Sabry met with his counterpart, Foreign Minister Dr. A.K. Abdul Momen of Bangladesh, in Dhaka on 23 November. The meeting took place during Sabry's visit to Bangladesh to attend the Indian Ocean conference.",
    "Category": "Mission News"
  },
  {
    "Title": "New Ambassador to Japan assumes duties",
    "Date": "23.11.2022",
    "Link": "https://mfa.gov.lk/en/new-ambassador-to-japan-assumes-duties/",
    "Summary": "The newly appointed Ambassador of Sri Lanka to Japan, E. Rodney M. Perera, assumed duties on 27 October 2022 at the Sri Lanka Embassy in Tokyo. He is the eighteenth Sri Lankan Ambassador to Japan in the last 70 years.",
    "Category": "Mission News"
  },
  {
    "Title": "Bilateral collaboration in developing the migrant workers sector: Preliminary discussion between the Ministry of Labour and Foreign Employment and the Department of Migrant Workers-Philippines",
    "Date": "23.11.2022",
    "Link": "https://mfa.gov.lk/en/bilateral-collaboration-in-developing-the-migrant-workers-sector-preliminary-discussion-between-the-ministry-of-labour-and-foreign-employment-and-the-department-of-migrant-workers-philippines/",
    "Summary": "The Embassy of Sri Lanka in Manila organized a virtual meeting between the Ministry of Labour and Foreign Employment and the Department of Migrant Workers-Philippines to discuss bilateral collaboration in developing the migrant workers sector. The meeting served as a preliminary discussion on Sri Lanka's interest in conducting joint initiatives with the Philippines.",
    "Category": "Mission News"
  },
  {
    "Title": "The Government of Myanmar donates Medicines and Medical Supplies worth over USD 1.48 Million to Sri Lanka",
    "Date": "22.11.2022",
    "Link": "https://mfa.gov.lk/en/the-government-of-myanmar-donates-medicines-and-medical-supplies-worth-over-usd-1-48-million-to-sri-lanka/",
    "Summary": "The Government of Myanmar donated essential medicines and medical supplies valued at over USD 1.48 million to Sri Lanka on November 21, 2022. The donation aimed to address urgent medical needs in Sri Lanka.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka proposes to set up a group of Eminent Persons to galvanize greater political will to combat terrorist financing",
    "Date": "21.11.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-proposes-to-set-up-a-group-of-eminent-persons-to-galvanize-greater-political-will-to-combat-terrorist-financing/",
    "Summary": "Sri Lanka has proposed establishing a group of Eminent Persons to boost political will and raise global awareness on combating terrorist financing. This initiative aims to enhance international cooperation and strengthen efforts to combat terrorism.",
    "Category": "Mission News"
  },
  {
    "Title": "Visit Sri Lanka – The Irresistible Tourist Hotspot in  the Middle of the Indian Ocean",
    "Date": "21.11.2022",
    "Link": "https://mfa.gov.lk/en/visit-sri-lanka-the-irresistible-tourist-hotspot-in-the-middle-of-the-indian-ocean/",
    "Summary": "Ambassador Dr. Palitha Kohona highlighted Sri Lanka's top-quality agricultural exports, with black tea being a major import. His remarks were made at the Wenzhou International Import Expo, showcasing Sri Lanka as an attractive tourist destination in the Indian Ocean.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka Ambassador to the Philippines pays courtesy call on the Secretary (Minister) of Labor of the Philippines",
    "Date": "21.11.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-ambassador-to-the-philippines-pays-courtesy-call-on-the-secretary-minister-of-labor-of-the-philippines/",
    "Summary": "Sri Lanka's Ambassador to the Philippines, Shobini Gunasekera, recently visited the Secretary of the Department of Labor and Employment (DOLE) of the Philippines, Bienvenido E. Lague, for a courtesy call. The meeting aimed to strengthen diplomatic ties between the two countries.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lankans found in UAE",
    "Date": "18.11.2022",
    "Link": "https://mfa.gov.lk/en/sri-lankans-found-in-uae/",
    "Summary": "The Sri Lanka Embassy in Abu Dhabi is aware of media reports about 17 Sri Lankan nationals who entered Abu Dhabi on visit visas expecting job opportunities.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka monitors welfare of crew aboard vessel detained by Nigeria",
    "Date": "18.11.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-monitors-welfare-of-crew-aboard-vessel-detained-by-nigeria/",
    "Summary": "The High Commission of Sri Lanka in Kenya, also accredited to Nigeria, is overseeing the welfare of eight Sri Lankan crew members on the vessel M/T Heroic IDUN detained by Nigerian authorities. They are ensuring the crew's well-being during this situation.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka will be the First Tourism Destination for “Spring Travel”",
    "Date": "18.11.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-will-be-the-first-tourism-destination-for-spring-travel/",
    "Summary": "The Sri Lanka Embassy in Beijing is actively promoting Sri Lankan tourism in the Chinese market, aiming to attract one million Chinese tourists after the lifting of travel restrictions from China. Sri Lanka is set to become the first tourism destination for \"Spring Travel.",
    "Category": "Mission News"
  },
  {
    "Title": "The Singapore -Sri Lanka Business Association (SLBA) donates medical supplies to the Ministry of Health of Sri Lanka",
    "Date": "18.11.2022",
    "Link": "https://mfa.gov.lk/en/the-singapore-sri-lanka-business-association-slba-donates-medical-supplies-to-the-ministry-of-health-of-sri-lanka/",
    "Summary": "The Singapore-Sri Lanka Business Association (SLBA) donated medical supplies worth 38,983.85 SGD (approximately 10 million LKR) to address a shortage in Sri Lanka. The supplies were given to the Ministry of Health of Sri Lanka.",
    "Category": "Mission News"
  },
  {
    "Title": "Stranded Sri Lankan Female Domestic Workers in Oman",
    "Date": "17.11.2022",
    "Link": "https://mfa.gov.lk/en/stranded-sri-lankan-female-domestic-workers-in-oman/",
    "Summary": "Sri Lankan female domestic workers in Oman are stranded, with the Embassy of Sri Lanka in Muscat receiving numerous daily complaints. Many workers arrived in Oman on visit or tourist visas, facing challenges due to the current situation. The embassy is working to assist these workers and address their concerns effectively.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka successfully takes part in the 5th CIIE",
    "Date": "17.11.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-successfully-takes-part-in-the-5th-ciie/",
    "Summary": "Sri Lanka participated in the 5th CIIE in Shanghai, China, showcasing its Food and Beverages and Gems and Jewellery sectors. The expo concluded on November 11, 2022, with Sri Lankan exhibitors actively engaging with international visitors and businesses.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka excels at the 4th Asian Under 18 Athletics Championship in Kuwait",
    "Date": "16.11.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-excels-at-the-4th-asian-under-18-athletics-championship-in-kuwait/",
    "Summary": "Sri Lanka performed exceptionally at the 4th Asian Under 18 Athletics Championship 2022 in Kuwait City. The biennial competition featured Asian athletes aged 15 to 17 and took place at the Ahmed Al Rashdan Track and Field Stadium from 13 to 15.",
    "Category": "Mission News"
  },
  {
    "Title": "Deputy High Commissioner of Sri Lanka in Chennai hosts a dinner for Heads of the Mission in Chennai",
    "Date": "16.11.2022",
    "Link": "https://mfa.gov.lk/en/deputy-high-commissioner-of-sri-lanka-in-chennai-hosts-a-dinner-for-heads-of-the-mission-in-chennai/",
    "Summary": "The Deputy High Commissioner of Sri Lanka in Chennai, Dr. D. Venkateshwaran, hosted a dinner at his official residence on November 11, 2022, for the Heads of Mission in Chennai. The event aimed to facilitate networking and collaboration among diplomats in the region.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka Embassy in Jakarta organizes a programme for Indonesian Immigration Polytechnic",
    "Date": "15.11.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-embassy-in-jakarta-organizes-a-programme-for-indonesian-immigration-polytechnic/",
    "Summary": "The Sri Lanka Embassy in Jakarta organized a successful interactive event with the Indonesian Immigration Polytechnic (POLTEKIM) on November 11, 2022, at the Embassy premises. The programme aimed to foster collaboration and exchange between the two institutions.",
    "Category": "Mission News"
  },
  {
    "Title": "“Come Visit the Sapphire Capital of the World”- Ambassador Dr. Palitha Kohona at the CIIE International Jewellery Summit, Shanghai",
    "Date": "15.11.2022",
    "Link": "https://mfa.gov.lk/en/come-visit-the-sapphire-capital-of-the-world-ambassador-dr-palitha-kohona-at-the-ciie-international-jewellery-summit-shanghai/",
    "Summary": "Ambassador Dr. Palitha Kohona, keynote speaker at the CIIE International Jewellery Summit on November 10, 2022, encouraged attendees to visit Sri Lanka, known as the Sapphire Capital of the World. He highlighted the country's allure for fulfilling their dreams of exploring exquisite gemstones and jewelry.",
    "Category": "Mission News"
  },
  {
    "Title": "Ambassador C.A. Chaminda I. Colonne presents Letters of Credence  to President Thongloun Sisoulith of the Lao People’s Democratic Republic at Vientiane",
    "Date": "15.11.2022",
    "Link": "https://mfa.gov.lk/en/ambassador-c-a-chaminda-i-colonne-presents-letters-of-credence-to-president-thongloun-sisoulith-of-the-lao-peoples-democratic-republic-at-vientiane/",
    "Summary": "Ambassador C.A. Chaminda I. Colonne presented his Letters of Credence to President Thongloun Sisoulith of the Lao People’s Democratic Republic in Vientiane. Colonne serves as the Ambassador of Sri Lanka to the Kingdom of Thailand and Permanent Representative to the UNESCAP.",
    "Category": "Mission News"
  },
  {
    "Title": "Launch of the France- Sri Lanka Friendship Association",
    "Date": "11.11.2022",
    "Link": "https://mfa.gov.lk/en/launch-of-the-france-sri-lanka-friendship-association/",
    "Summary": "The France-Sri Lanka Friendship Association was launched during a meeting at the Embassy of Sri Lanka in Paris on November 3, 2022. The event was attended by well-wishers from different segments, marking the beginning of this new association.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka successfully participates at the 53rd Annual WIC Charity Bazaar",
    "Date": "11.11.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-successfully-participates-at-the-53rd-annual-wic-charity-bazaar/",
    "Summary": "Sri Lanka's Embassy in Jakarta took part in the 53rd Annual Charity Bazaar organized by the Women’s International Club (WIC) at the Grand Sahid Jaya Hotel on October 20, 2022. The event was a success, showcasing Sri Lankan culture and products to attendees.",
    "Category": "Mission News"
  },
  {
    "Title": "High Commission of Sri Lanka in New Delhi celebrates Diwali   felicitating long-serving staff members",
    "Date": "10.11.2022",
    "Link": "https://mfa.gov.lk/en/high-commission-of-sri-lanka-in-new-delhi-celebrates-diwali-felicitating-long-serving-staff-members/",
    "Summary": "The High Commission of Sri Lanka in New Delhi celebrated Diwali by honoring its long-serving Indian staff members. The event included a family get-together with the participation of both home-based staff and their family members.",
    "Category": "Mission News"
  },
  {
    "Title": "Ambassador Dr. Palitha Kohona Promotes Sri Lanka’s Tourist Attractions at the Shanghai CIIE",
    "Date": "10.11.2022",
    "Link": "https://mfa.gov.lk/en/ambassador-dr-palitha-kohona-promotes-sri-lankas-tourist-attractions-at-the-shanghai-ciie/",
    "Summary": "Ambassador Dr. Palitha Kohona promoted Sri Lanka's tourist attractions at the Shanghai CIIE by inviting dinner guests to consider it as their next travel option during the 5th China International Import Expo (CIIE) Culture, Tourism, and Health Summit Forum in Shanghai.",
    "Category": "Mission News"
  },
  {
    "Title": "“Visit to the Amazing Sri Lanka in NOWRUZ Season-2023”  A Tourism Promotion Programme held in Tehran",
    "Date": "10.11.2022",
    "Link": "https://mfa.gov.lk/en/visit-to-the-amazing-sri-lanka-in-nowruz-season-2023-a-tourism-promotion-programme-held-in-tehran/",
    "Summary": "The Embassy of Sri Lanka in Tehran, along with the Sri Lanka Tourism Promotion Bureau and the Association of Air Transport and Tourist Agencies in Iran, organized a Tourism Promotion Programme titled \"Visit to the Amazing Sri Lanka in NOWRUZ Season-2023.\" The event aimed to promote tourism to Sri Lanka during the NOWRUZ Season of 2023.",
    "Category": "Mission News"
  },
  {
    "Title": "Embassy participated in Annual Katina Ceremony in Vienna, Austria",
    "Date": "10.11.2022",
    "Link": "https://mfa.gov.lk/en/embassy-participated-in-annual-katina-ceremony-in-vienna-austria/",
    "Summary": "The Embassy and the Permanent Mission of Sri Lanka in Vienna, Austria participated in the Annual Katina Ceremony by offering Heel Danaya to 12 members of the Maha Sangha on October 26, 2022. The almsgiving was a significant part of the ceremony.",
    "Category": "Mission News"
  },
  {
    "Title": "Mobile Consular Services Conducted in Batupahat, Malaysia",
    "Date": "10.11.2022",
    "Link": "https://mfa.gov.lk/en/mobile-consular-services-conducted-in-batupahat-malaysia/",
    "Summary": "The Sri Lanka High Commission in Malaysia conducted Mobile Consular Services in Batupahat, Johor, Malaysia on Sunday, November 6, 2022. Batupahat is located about 250 km from Kuala Lumpur, making it accessible for residents in the area to access consular services. This initiative aimed to provide convenient consular assistance to Sri Lankan nationals living in the region.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka Tourism showcased at World Travel Market in London",
    "Date": "08.11.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-tourism-showcased-at-world-travel-market-in-london/",
    "Summary": "Sri Lanka Tourism Promotion Bureau (SLTPB) and 57 travel trade partners were showcased at the World Travel Market in London, facilitated by the Sri Lanka High Commission. The event took place at the ExCeL London, highlighting Sri Lanka's tourism offerings to a global audience.",
    "Category": "Mission News"
  },
  {
    "Title": "The Consulate General of Sri Lanka in Toronto constructively engages with the Sri Lankan Canadian Tamil Community in Ontario",
    "Date": "08.11.2022",
    "Link": "https://mfa.gov.lk/en/the-consulate-general-of-sri-lanka-in-toronto-constructively-engages-with-the-sri-lankan-canadian-tamil-community-in-ontario/",
    "Summary": "The Consulate General of Sri Lanka in Toronto, represented by Consul General Thushara Rodrigo, actively engaged with the Sri Lankan Canadian Tamil Community in Ontario by attending the Annual Festivals of the Murugan Kovil in Scarborough on October 30, 2022, at the invitation of the temple's Chief Priest. This event facilitated constructive interactions between the Consulate General and the community, fostering cultural and religious connections.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka Consulate General in Karachi promotes collaboration in the field of yarn materials through the Pakistan Yarn Merchants Association",
    "Date": "08.11.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-consulate-general-in-karachi-promotes-collaboration-in-the-field-of-yarn-materials-through-the-pakistan-yarn-merchants-association/",
    "Summary": "The Consul General of Sri Lanka in Karachi, Jagath Abeywarna, met with the newly elected Senior Vice-Chairman Sohail Nisar and members of the Pakistan Yarn Merchants Association on November 2, 2022, at their head office to promote collaboration in the field of yarn materials. The meeting aimed to strengthen ties and explore opportunities for cooperation between Sri Lanka and Pakistan in the yarn industry.",
    "Category": "Mission News"
  },
  {
    "Title": "President Ranil Wickremesinghe Addresses the CIIE",
    "Date": "08.11.2022",
    "Link": "https://mfa.gov.lk/en/president-ranil-wickremesinghe-addresses-the-ciie/",
    "Summary": "President Ranil Wickremesinghe was the first speaker after President Xi Jinping to address the 5th China International Import Expo (CIIE) and the Hongqiao Economic Forum virtually. The event was well-attended and highly prestigious.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lankan Fashion, Food and Product showcase in Singapore",
    "Date": "08.11.2022",
    "Link": "https://mfa.gov.lk/en/sri-lankan-fashion-food-and-product-showcase-in-singapore/",
    "Summary": "Sri Lankan designers Sonali Dharmawardhane and Sarita Rajendran showcased their work in Singapore at an Afternoon Tea event hosted at the Sri Lanka Residence on October 29, 2022. The showcase featured unique fashion, food, and products, highlighting the creativity and talent of Sri Lankan artisans.",
    "Category": "Mission News"
  },
  {
    "Title": "Tourism Promotion Event in Paris",
    "Date": "04.11.2022",
    "Link": "https://mfa.gov.lk/en/tourism-promotion-event-in-paris/",
    "Summary": "The Embassy of Sri Lanka in France participated in a tourism promotion event in Paris on October 4 from 7.00 pm to 9.00 pm. The event was organized by PONANT, a French cruise ship operating company, to raise awareness about Sri Lanka's tourism offerings.",
    "Category": "Mission News"
  },
  {
    "Title": "The Islamic Republic of Iran Donates a Consignment of Essential Medicine and Medical Supplies to Sri Lanka",
    "Date": "04.11.2022",
    "Link": "https://mfa.gov.lk/en/the-islamic-republic-of-iran-donates-a-consignment-of-essential-medicine-and-medical-supplies-to-sri-lanka/",
    "Summary": "The Islamic Republic of Iran, in collaboration with the Iranian Red Crescent, donated a much-needed consignment of essential medicines and medical supplies to Sri Lanka. The donation was presented at a ceremony held in Sri Lanka.",
    "Category": "Mission News"
  },
  {
    "Title": "UNESCAP successfully concludes the National Training for Women Entrepreneurs on Promoting Business through E-Commerce and Digital Marketing, at Suhurupaya, Sri Lanka",
    "Date": "04.11.2022",
    "Link": "https://mfa.gov.lk/en/unescap-successfully-concludes-the-national-training-for-women-entrepreneurs-on-promoting-business-through-e-commerce-and-digital-marketing-at-suhurupaya-sri-lanka/",
    "Summary": "UNESCAP successfully concluded the National Training for Women Entrepreneurs on Promoting Business through E-Commerce and Digital Marketing in Suhurupaya, Sri Lanka. The training was initiated by the Sri Lanka Embassy and Permanent Mission to UNESCAP in Thailand, and jointly organized to support women entrepreneurs in leveraging e-commerce and digital marketing for their businesses.",
    "Category": "Mission News"
  },
  {
    "Title": "Ambassador of Sri Lanka symbolically receives donations from Minister of Foreign Affairs of Thailand",
    "Date": "04.11.2022",
    "Link": "https://mfa.gov.lk/en/ambassador-of-sri-lanka-symbolically-receives-donations-from-minister-of-foreign-affairs-of-thailand/",
    "Summary": "At the Second handing over Ceremony at the Ministry of Foreign Affairs of Thailand, Deputy Prime Minister and Minister of Foreign Affairs Don Pramudwinai symbolically presented a cash donation of 14,000,000 T to the Ambassador of Sri Lanka.",
    "Category": "Mission News"
  },
  {
    "Title": "Presentation of Open Copy of Letter of Credence – Ambassador (designate) of Sri Lanka to Türkiye",
    "Date": "04.11.2022",
    "Link": "https://mfa.gov.lk/en/presentation-of-open-copy-of-letter-of-credence-ambassador-designate-of-sri-lanka-to-turkiye/",
    "Summary": "Ambassador (designate) of Sri Lanka to Türkiye, S. Hasanthi Urugodawatte Dissanayake, presented open copies of her Letter of Credence to the Director General of Protocol at the Ministry of Foreign Affairs. This formal presentation marks her official appointment as the Ambassador of Sri Lanka to Türkiye.",
    "Category": "Mission News"
  },
  {
    "Title": "Public Security Minister Tiran Alles undertakes official visit to Singapore",
    "Date": "04.11.2022",
    "Link": "https://mfa.gov.lk/en/public-security-minister-tiran-alles-undertakes-official-visit-to-singapore/",
    "Summary": "Public Security Minister Tiran Alles visited Singapore from October 25-29, 2022, at the invitation of Singapore's Minister for Home Affairs and Minister for Law, K Shanmugam. The visit aimed to strengthen bilateral cooperation between the two countries.",
    "Category": "Mission News"
  },
  {
    "Title": "High Commission in Canberra hosts the first ‘Wes Mangallaya Ceremony’",
    "Date": "03.11.2022",
    "Link": "https://mfa.gov.lk/en/high-commission-in-canberra-hosts-the-first-wes-mangallaya-ceremony/",
    "Summary": "The Sri Lanka High Commission in Canberra hosted the first 'Wes Mangallaya Ceremony' organized by the Bhagya School of Dance on October 15, 2022. The event took place at the High Commission premises, featuring ten students from the dance school.",
    "Category": "Mission News"
  },
  {
    "Title": "Ceylon Tea and Tourism featured at the Courtney International Day in Pretoria, South Africa",
    "Date": "03.11.2022",
    "Link": "https://mfa.gov.lk/en/ceylon-tea-and-tourism-featured-at-the-courtney-international-day-in-pretoria-south-africa/",
    "Summary": "The Sri Lanka High Commission in South Africa showcased Ceylon Tea and Tourism at the Courtney International Day in Pretoria on October 29, 2022. The event featured participation from international organizations like PEN Charity and missions from various countries. It aimed to promote cultural exchange and cooperation among nations.",
    "Category": "Mission News"
  },
  {
    "Title": "Port of call and goodwill visit to Singapore by Sri Lanka Navy OPV P627",
    "Date": "03.11.2022",
    "Link": "https://mfa.gov.lk/en/port-of-call-and-goodwill-visit-to-singapore-by-sri-lanka-navy-opv-p627/",
    "Summary": "Sri Lanka Navy's recently acquired Offshore Patrol Vessel (OPV) P627, formerly known as USCG Douglas Munro, visited Singapore on a goodwill mission from October 22 to 26, 2022, after departing from Seattle, USA on September 3. The vessel made a port of call and engaged in diplomatic activities during its stay in Singapore.",
    "Category": "Mission News"
  },
  {
    "Title": "Donation of Medical Supplies by the Government of Malaysia",
    "Date": "01.11.2022",
    "Link": "https://mfa.gov.lk/en/donation-of-medical-supplies-by-the-government-of-malaysia/",
    "Summary": "The High Commission of Sri Lanka in Kuala Lumpur requested the Government of Malaysia for medical supplies following a request from the Ministry of Health of Sri Lanka. Malaysia responded by donating the required medical supplies to assist Sri Lanka.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka Deputy High Commission in Chennai Celebrates Diwali",
    "Date": "01.11.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-deputy-high-commission-in-chennai-celebrates-diwali/",
    "Summary": "The Sri Lanka Deputy High Commission in Chennai celebrated Diwali, also known as the 'Festival of Lights', which is observed by Hindu, Jain, and Sikh communities in India and globally. The festival involves decorating homes, temples, and workspaces with lights and celebrating with family and friends.",
    "Category": "Mission News"
  },
  {
    "Title": "Ambassador Samarasinghe presents credentials to the Organization of American States",
    "Date": "31.10.2022",
    "Link": "https://mfa.gov.lk/en/ambassador-samarasinghe-presents-credentials-to-the-organization-of-american-states/",
    "Summary": "Ambassador Mahinda Samarasinghe of Sri Lanka, also accredited to Mexico and Trinidad and Tobago, presented his credentials to the Secretary-General of the Organization of American States (OAS), Ambassador Luis Almagro. This meeting signifies Samarasinghe's official recognition by the OAS.",
    "Category": "Mission News"
  },
  {
    "Title": "SLASSCOM ties up with INT@J in Jordan",
    "Date": "31.10.2022",
    "Link": "https://mfa.gov.lk/en/slasscom-ties-up-with-intj-in-jordan/",
    "Summary": "SLASSCOM and INT@J signed an MoU on October 27, 2022, under the Embassy of Sri Lanka in Jordan. The virtual signing was conducted by Chairman Ashique M. Ali on behalf of Sri Lanka, fostering collaboration between the two organizations.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka successfully participates at the  18th International Seminar and Exhibition –  “The World of Tea” in Tehran",
    "Date": "28.10.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-successfully-participates-at-the-18th-international-seminar-and-exhibition-the-world-of-tea-in-tehran/",
    "Summary": "Sri Lanka successfully participated in the 18th International Seminar and Exhibition \"The World of Tea\" in Tehran from October 24-26. The event was a collaboration between the Sri Lanka Embassy in Iran and the Sri Lanka Tea Board, held at the Parsian Esteghlal Hotel. Sri Lanka showcased its tea industry's excellence at the prestigious event.",
    "Category": "Mission News"
  },
  {
    "Title": "‘Friends of Sri Lanka Group’ re-launched in the European Parliament",
    "Date": "28.10.2022",
    "Link": "https://mfa.gov.lk/en/friends-of-sri-lanka-group-re-launched-in-the-european-parliament/",
    "Summary": "The Friends of Sri Lanka Group was re-launched at the Sri Lanka Residence in Brussels on October 25, 2022, with the announcement made by the Ambassador of Sri Lanka to the European Union, Grace Asirwatham.",
    "Category": "Mission News"
  },
  {
    "Title": "“Sri Lanka is open for business “– Visit of a Sri Lankan Business Delegation to the Philippines for the 48th PCCI Philippine Business Conference and Expo",
    "Date": "28.10.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-is-open-for-business-visit-of-a-sri-lankan-business-delegation-to-the-philippines-for-the-48th-pcci-philippine-business-conference-and-expo/",
    "Summary": "A 30-member business delegation from Sri Lanka visited the 48th PCCI Philippine Business Conference and Expo in Manila from October 18-20, 2022, facilitated by the Sri Lankan Embassy. The delegation's presence highlighted Sri Lanka's interest in fostering business ties with the Philippines, showcasing opportunities for collaboration.",
    "Category": "Mission News"
  },
  {
    "Title": "Hambantota participates in Photography Exhibition of Sister/ Friendship Cities of Guangzhou, China",
    "Date": "27.10.2022",
    "Link": "https://mfa.gov.lk/en/hambantota-participates-in-photography-exhibition-of-sister-friendship-cities-of-guangzhou-china/",
    "Summary": "Hambantota recently took part in a photography exhibition organized by the Foreign Affairs Office of the Guangzhou Municipal People’s Government. The exhibition aimed to celebrate milestone anniversaries of sister/friendship cities worldwide, showcasing images from various participating cities.",
    "Category": "Mission News"
  },
  {
    "Title": "Annual Kathina Ceremony 2022, hosted by the Embassy of  Sri Lanka in Yangon",
    "Date": "26.10.2022",
    "Link": "https://mfa.gov.lk/en/annual-kathina-ceremony-2022-hosted-by-the-embassy-of-sri-lanka-in-yangon/",
    "Summary": "The Embassy of Sri Lanka in Yangon successfully hosted the Annual Kathina Ceremony of Pa Thein Monastery in Myanmar on Saturday, 22 October 2022. The event was attended by a large gathering, including Ven. S.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka Ambassador to the Philippines pays courtesy call on the Secretary (Minister) of the Department of Migrant Workers of the Philippines",
    "Date": "25.10.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-ambassador-to-the-philippines-pays-courtesy-call-on-the-secretary-minister-of-the-department-of-migrant-workers-of-the-philippines/",
    "Summary": "Sri Lanka's Ambassador to the Philippines, Shobini Gunasekera, recently visited the Secretary of the Department of Migrant Workers of the Philippines, Susan V. Ople, for a courtesy call. The meeting aimed to explore potential collaborations and initiatives between the two countries.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka participates at the 11th Meeting of the Advisory Council of IORA Regional Centre for Science and Technology Transfer (RCSTT) in Tehran and highlights its interest in Enhancing Cooperation",
    "Date": "25.10.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-participates-at-the-11th-meeting-of-the-advisory-council-of-iora-regional-centre-for-science-and-technology-transfer-rcstt-in-tehran-and-highlights-its-interest-in-enhancing-cooperation/",
    "Summary": "Sri Lanka participated in the 11th Meeting of the Advisory Council of IORA Regional Centre for Science and Technology Transfer (RCSTT) in Tehran on October 23, 2022. During the meeting, Sri Lanka highlighted its interest in enhancing cooperation within the organization.",
    "Category": "Mission News"
  },
  {
    "Title": "Laxmi Pooja and Diwali Celebration at Sri Lanka Consulate General in Mumbai",
    "Date": "25.10.2022",
    "Link": "https://mfa.gov.lk/en/laxmi-pooja-and-diwali-celebration-at-sri-lanka-consulate-general-in-mumbai/",
    "Summary": "The Consulate General of Sri Lanka in Mumbai organized a Laxmi Pooja at the chancery premises to celebrate Diwali on October 21, 2022. The event was attended by over 80 participants, including dignitaries.",
    "Category": "Mission News"
  },
  {
    "Title": "Port of call and goodwill visit in Manila by Sri Lanka Navy OPV P627",
    "Date": "23.10.2022",
    "Link": "https://mfa.gov.lk/en/port-of-call-and-goodwill-visit-in-manila-by-sri-lanka-navy-opv-p627/",
    "Summary": "Sri Lanka Navy's recently acquired Offshore Patrol Vessel (OPV) P627, formerly known as USCG Douglas Munro, visited Manila for a goodwill visit from October 12 to 16, 2022. The visit aimed to strengthen naval diplomacy between the two countries.",
    "Category": "Mission News"
  },
  {
    "Title": "Ambassador Mahinda Samarasinghe presents copies of his letter of credence as the Ambassador of Sri Lanka to Mexico",
    "Date": "21.10.2022",
    "Link": "https://mfa.gov.lk/en/ambassador-mahinda-samarasinghe-presents-copies-of-his-letter-of-credence-as-the-ambassador-of-sri-lanka-to-mexico/",
    "Summary": "Ambassador Mahinda Samarasinghe presented copies of his letter of credence as the Ambassador of Sri Lanka to Mexico at a formal ceremony on 19 October 2022 at the Mexican Cultural Centre in Washington D.C. The credentials were presented to the Ambassador of Mexico to the US, Esteban Moctez, during the event.",
    "Category": "Mission News"
  },
  {
    "Title": "Ceylon Cinnamon EU-PGI status promoted in Belgium",
    "Date": "21.10.2022",
    "Link": "https://mfa.gov.lk/en/ceylon-cinnamon-eu-pgi-status-promoted-in-belgium/",
    "Summary": "The Embassy of Sri Lanka in Belgium hosted an event on October 18, 2022, to promote the EU Protected Geographical Indication (PGI) status awarded to Ceylon Cinnamon, focusing on Ceylon Cinnamon quills. This status highlights the unique quality and origin of Ceylon Cinnamon in the European market.",
    "Category": "Mission News"
  },
  {
    "Title": "His Majesty Sultan of Oman receives Credentials of Ambassador of Sri Lanka",
    "Date": "20.10.2022",
    "Link": "https://mfa.gov.lk/en/his-majesty-sultan-of-oman-receives-credentials-of-ambassador-of-sri-lanka/",
    "Summary": "The newly appointed Ambassador of Sri Lanka to Oman, A.L Sabarullah Khan, presented his Letter of Credence to His Majesty Sultan Haitham bin Tarik. Sultan Haitham officially received the credentials during the ceremony.",
    "Category": "Mission News"
  },
  {
    "Title": "Buddhist Associations in Indonesia donate medicines  And medical devices to Sri Lanka",
    "Date": "20.10.2022",
    "Link": "https://mfa.gov.lk/en/buddhist-associations-in-indonesia-donate-medicines-and-medical-devices-to-sri-lanka/",
    "Summary": "Buddhist Associations in Indonesia, including WALUBI, MAGABUDHI, WANDANI, and Theravada You, have donated medicines and medical devices to Sri Lanka.",
    "Category": "Mission News"
  },
  {
    "Title": "Courtesy call by Ambassador Shobini Gunasekera on the Secretary (Minister) of Foreign Affairs of the Philippines",
    "Date": "18.10.2022",
    "Link": "https://mfa.gov.lk/en/courtesy-call-by-ambassador-shobini-gunasekera-on-the-secretary-minister-of-foreign-affairs-of-the-philippines/",
    "Summary": "Sri Lanka's Ambassador to the Philippines, Shobini Gunasekera, recently visited the Secretary of Foreign Affairs of the Philippines, Enrique A. Manalo, at the Department of Foreign Affairs office for a courtesy call.",
    "Category": "Mission News"
  },
  {
    "Title": "Visit of the President of Sri Lanka Ranil Wickremesinghe to the Philippines for the 55th Annual Meeting of the Asian Development Bank Board of Governors",
    "Date": "14.10.2022",
    "Link": "https://mfa.gov.lk/en/visit-of-the-president-of-sri-lanka-ranil-wickremesinghe-to-the-philippines-for-the-55th-annual-meeting-of-the-asian-development-bank-board-of-governors/",
    "Summary": "President Ranil Wickremesinghe visited the Philippines from 28-30 September 2022 to chair the Governor’s Business Session at the 55th Annual Meeting of the Asian Development Bank (ADB) Board of Governors. His visit was in connection with the ADB's annual meeting.",
    "Category": "Mission News"
  },
  {
    "Title": "State Minister of Foreign Affairs Tharaka Balasuriya holds wide ranging discussions with the Sri Lankan Business Council in Dubai and the Northern Emirates",
    "Date": "13.10.2022",
    "Link": "https://mfa.gov.lk/en/state-minister-of-foreign-affairs-tharaka-balasuriya-holds-wide-ranging-discussions-with-the-sri-lankan-business-council-in-dubai-and-the-northern-emirates/",
    "Summary": "State Minister of Foreign Affairs Tharaka Balasuriya engaged in extensive discussions with the Chairman and Board of Directors of the Sri Lankan Business Council (SLBC) in Dubai and the Northern Emirates during a transit visit on October 11. The meeting aimed to strengthen ties and explore collaboration opportunities between Sri Lanka and the business community in the region.",
    "Category": "Mission News"
  },
  {
    "Title": "State Minister Tharaka Balasuriya meets the staff of the Consulate General of Sri Lanka in Dubai",
    "Date": "13.10.2022",
    "Link": "https://mfa.gov.lk/en/state-minister-tharaka-balasuriya-meets-the-staff-of-the-consulate-general-of-sri-lanka-in-dubai/",
    "Summary": "State Minister of Foreign Affairs Tharaka Balasuriya visited the Consulate General of Sri Lanka in Dubai on 11 October 2022 during a short transit visit. He met with the staff during his visit.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka Consulate General promotes export of construction related materials through the Association of Builders and Developers (ABAD) in Pakistan",
    "Date": "13.10.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-consulate-general-promotes-export-of-construction-related-materials-through-the-association-of-builders-and-developers-abad-in-pakistan/",
    "Summary": "The Consul General of Sri Lanka in Karachi met with the newly elected Chairman Altaf Tai and members of ABAD at the ABAD house to promote Sri Lankan construction materials. The CEO of Swissteck was also present during the meeting to discuss potential collaborations.",
    "Category": "Mission News"
  },
  {
    "Title": "A series of webinars for the promotion of coconut related products in Pakistan",
    "Date": "13.10.2022",
    "Link": "https://mfa.gov.lk/en/a-series-of-webinars-for-the-promotion-of-coconut-related-products-in-pakistan/",
    "Summary": "The Consulate General of Sri Lanka in Karachi and the Coconut Development Authority in Sri Lanka are collaborating to organize a series of webinars aimed at promoting coconut-related products in Pakistan. The goal is to enhance awareness and market opportunities for Sri Lankan coconut products in Pakistan.",
    "Category": "Mission News"
  },
  {
    "Title": "Ambassador Savitri Panabokke presents credentials to  President of the Republic of Korea",
    "Date": "13.10.2022",
    "Link": "https://mfa.gov.lk/en/ambassador-savitri-panabokke-presents-credentials-to-president-of-the-republic-of-korea/",
    "Summary": "Ambassador Savitri I. Panabokke of Sri Lanka presented her Letters of Credence to President Yoon Suk-yeol of the Republic of Korea at a ceremony in the President’s Office on October 11. This formal event marked the official beginning of her role as Sri Lanka's Ambassador to Korea.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka successfully participates  at the 67th YWCA Diplomatic Charity Bazaar 2022 in Bangkok",
    "Date": "10.10.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-successfully-participates-at-the-67th-ywca-diplomatic-charity-bazaar-2022-in-bangkok/",
    "Summary": "Sri Lanka successfully participated in the 67th YWCA Diplomatic Charity Bazaar 2022 in Bangkok. The Embassy and Permanent Mission of Sri Lanka in Bangkok collaborated with the Spices and Allied Products Marketing Board, National Crafts Council, Sri Lanka Export Development Board, and Industrial Development Board for the event.",
    "Category": "Mission News"
  },
  {
    "Title": "“Discover the Tropical Island Paradise of Sri Lanka”: an event to promote Sri Lanka Tourism in Washington D.C., USA",
    "Date": "07.10.2022",
    "Link": "https://mfa.gov.lk/en/discover-the-tropical-island-paradise-of-sri-lanka-an-event-to-promote-sri-lanka-tourism-in-washington-d-c-usa/",
    "Summary": "The Embassy of Sri Lanka to the United States, in partnership with the International Club of DC, organized an evening reception on September 30, 2022, in Washington D.C. to showcase Sri Lanka as a tropical island paradise, aiming to promote tourism in the country.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka participates in UN International Charity Luncheon",
    "Date": "07.10.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-participates-in-un-international-charity-luncheon/",
    "Summary": "Sri Lanka joined other countries in attending the United Nations International Charity Luncheon hosted by the United Nations Women’s Guild Vienna (UNWG) on September 22, 2022. The event aimed to support charitable causes and promote global cooperation.",
    "Category": "Mission News"
  },
  {
    "Title": "The Governor of the Province of Namur in Belgium Inaugurates Sri Lanka Tourism Promotion Workshop",
    "Date": "06.10.2022",
    "Link": "https://mfa.gov.lk/en/the-governor-of-the-province-of-namur-in-belgium-inaugurates-sri-lanka-tourism-promotion-workshop/",
    "Summary": "The Governor of the Namur Province in Belgium, Denis Mathen, inaugurated a Sri Lanka Tourism Promotion Workshop organized by the Embassy of Sri Lanka in Brussels on October 4, 2022. Mathen expressed support for the promotion efforts during the event.",
    "Category": "Mission News"
  },
  {
    "Title": "Travellers from Bangladesh keen to visit Sri Lanka",
    "Date": "04.10.2022",
    "Link": "https://mfa.gov.lk/en/travellers-from-bangladesh-keen-to-visit-sri-lanka/",
    "Summary": "Travellers from Bangladesh are eager to visit Sri Lanka, as shown by their interest at the 9th Asian Tourism Fair. The High Commission of Sri Lanka in Bangladesh and Sri Lankan Airlines collaborated at the event held from September 29 to October 1, 2022, at the International Convention Center.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lankan Embassy in Washington DC Facilitates over USD 12 million in Medical Aid",
    "Date": "03.10.2022",
    "Link": "https://mfa.gov.lk/en/sri-lankan-embassy-in-washington-dc-facilitates-over-usd-12-million-in-medical-aid/",
    "Summary": "The Sri Lankan Embassy in Washington DC has facilitated over USD 12 million in medical aid through collaboration with American humanitarian donor organizations. This milestone includes the provision of free medicines and medical supplies, benefiting those in need.",
    "Category": "Mission News"
  },
  {
    "Title": "Permanent Representative of Sri Lanka to the United Nations in New York, Ambassador Mohan Pieris appointed as the Chair of the United Nations First Committee",
    "Date": "30.09.2022",
    "Link": "https://mfa.gov.lk/en/permanent-representative-of-sri-lanka-to-the-united-nations-in-new-york-ambassador-mohan-pieris-appointed-as-the-chair-of-the-united-nations-first-committee/",
    "Summary": "Sri Lanka's Ambassador and Permanent Representative to the United Nations in New York, Mohan Pieris, has been appointed as the Chair of the United Nations First Committee, which focuses on disarmament and international security matters.",
    "Category": "Mission News"
  },
  {
    "Title": "Minister of Foreign Affairs Ali Sabry engages with multiple stakeholders at the 77th Session of the United Nations General Assembly in New York",
    "Date": "29.09.2022",
    "Link": "https://mfa.gov.lk/en/minister-of-foreign-affairs-ali-sabry-engages-with-multiple-stakeholders-at-the-77th-session-of-the-united-nations-general-assembly-in-new-york/",
    "Summary": "Minister of Foreign Affairs Ali Sabry has returned to the country after engaging with multiple stakeholders at the 77th Session of the United Nations General Assembly in New York. During the General Debate, Minister Sabry addressed key issues and represented the country's interests on the global stage.",
    "Category": "Mission News"
  },
  {
    "Title": "Educational and Cultural Exchange Awareness Programme in Iran",
    "Date": "29.09.2022",
    "Link": "https://mfa.gov.lk/en/educational-and-cultural-exchange-awareness-programme-in-iran/",
    "Summary": "The Embassy of Sri Lanka in Iran, in collaboration with the General Sir John Kotelawala Defence University, hosted an educational and cultural exchange awareness programme at the Chancery premises in Tehran on 21 Sep. The event aimed to promote mutual understanding and cooperation between the two countries.",
    "Category": "Mission News"
  },
  {
    "Title": "President Ranil Wickremesinghe attends the State Funeral of   former Japanese Prime Minister Shinzo Abe",
    "Date": "29.09.2022",
    "Link": "https://mfa.gov.lk/en/president-ranil-wickremesinghe-attends-the-state-funeral-of-former-japanese-prime-minister-shinzo-abe/",
    "Summary": "President Ranil Wickremesinghe of Sri Lanka visited Japan on September 27-28, 2022, to attend the State Funeral of former Japanese Prime Minister Shinzo Abe.",
    "Category": "Mission News"
  },
  {
    "Title": "​HOPE worldwide makes a generous in-kind donation to Sri Lanka",
    "Date": "28.09.2022",
    "Link": "https://mfa.gov.lk/en/%e2%80%8bhope-worldwide-makes-a-generous-in-kind-donation-to-sri-lanka/",
    "Summary": "HOPE worldwide has generously donated in-kind assistance to Sri Lanka in response to a request from the Sri Lankan Embassy in Washington, D.C. The donation was made under the guidance of His Excellency the Ambassador, strengthening ties between the two nations.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka Ambassador’s Trophy – 2022 Cricket Tournament in Lebanon",
    "Date": "28.09.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-ambassadors-trophy-2022-cricket-tournament-in-lebanon/",
    "Summary": "The Embassy of Sri Lanka to Lebanon and Syria, in collaboration with the St. Joseph Cricket Club in Achrafieh, organized a six-a-side softball cricket tournament as part of their Community outreach program. The event, known as the Sri Lanka Ambassador’s Trophy, took place in Lebanon in 2022.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka participates at the IFTM TOP RESA, International and French Travel Market 2022",
    "Date": "27.09.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-participates-at-the-iftm-top-resa-international-and-french-travel-market-2022/",
    "Summary": "Sri Lanka Association of Inbound Tour Operators (SLAITO) successfully participated in the IFTM TOP RESA, International and French Travel Market 2022 from September 20 to 22, 2022. The event was coordinated by SLAITO, showcasing Sri Lanka's tourism offerings to an international audience.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka promotes commercial relations with the State of Goiás in Brazil",
    "Date": "27.09.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-promotes-commercial-relations-with-the-state-of-goias-in-brazil/",
    "Summary": "Sri Lanka's Ambassador to Brazil, Sumith Dassanayake, visited the State of Goiás on September 19, 2022, as part of an initiative to strengthen commercial ties. The visit aimed to promote trade and economic relations between Sri Lanka and Goiás, Brazil.",
    "Category": "Mission News"
  },
  {
    "Title": "“Celebration of Ceylon Spices”: an event to promote Ceylon Spices in Washington D.C., USA",
    "Date": "27.09.2022",
    "Link": "https://mfa.gov.lk/en/celebration-of-ceylon-spices-an-event-to-promote-ceylon-spices-in-washington-d-c-usa/",
    "Summary": "The Embassy of Sri Lanka in the United States, along with the American Spice Trade Association (ASTA), organized the \"Celebration of Ceylon Spices\" event in Washington D.C. on September 13, 2022. The event aimed to promote Ceylon Spices and featured a vibrant evening reception at the Embassy premises.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka donates Ceylon Tea to the flood victims in Pakistan",
    "Date": "27.09.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-donates-ceylon-tea-to-the-flood-victims-in-pakistan/",
    "Summary": "Sri Lanka's Government donated Ceylon Tea to flood victims in Pakistan at a ceremony on September 21, 2022, at Jinnah International Airport. The Sri Lanka Tea Board collaborated on the donation, providing support to those affected by the floods.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lankan design techniques get exposure in Jordan",
    "Date": "23.09.2022",
    "Link": "https://mfa.gov.lk/en/sri-lankan-design-techniques-get-exposure-in-jordan/",
    "Summary": "The Embassy of Sri Lanka in Jordan collaborated with the Academy of Design (AOD) to host a virtual workshop, highlighting innovative design and marketing techniques from the Academy. The workshop aimed to showcase Sri Lankan design expertise to a Jordanian audience, fostering cultural exchange and knowledge sharing.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lankan companies make successful contacts with Maldivian firms at the inaugural ITE Maldives 2022",
    "Date": "23.09.2022",
    "Link": "https://mfa.gov.lk/en/sri-lankan-companies-make-successful-contacts-with-maldivian-firms-at-the-inaugural-ite-maldives-2022/",
    "Summary": "Sri Lankan companies achieved successful business connections with Maldivian firms at the inaugural ITE Maldives 2022. The event served as a productive Business-to-Business meeting platform in Male, facilitating valuable interactions between participants.",
    "Category": "Mission News"
  },
  {
    "Title": "High Commissioner Milinda Moragoda interacts with Indian Women’s Press Corps and IAAN School of Mass Communication",
    "Date": "22.09.2022",
    "Link": "https://mfa.gov.lk/en/high-commissioner-milinda-moragoda-interacts-with-indian-womens-press-corps-and-iaan-school-of-mass-communication/",
    "Summary": "Sri Lankan High Commissioner to India, Milinda Moragoda, engaged with the Indian Women’s Press Corps (IWPC) and students from the IAAN School of Mass Communication on September 19. The interactions aimed to foster dialogue and collaboration between the parties.",
    "Category": "Mission News"
  },
  {
    "Title": "President Ranil Wickremesinghe attends the State Funeral Service of Her Majesty Queen Elizabeth II",
    "Date": "21.09.2022",
    "Link": "https://mfa.gov.lk/en/president-ranil-wickremesinghe-attends-the-state-funeral-service-of-her-majesty-queen-elizabeth-ii/",
    "Summary": "President Ranil Wickremesinghe visited the United Kingdom from 17-20 September 2022 to attend the State Funeral Service of the late Queen Elizabeth II. On Sunday, 18 September, the President accompanied the dignitaries at the funeral service.",
    "Category": "Mission News"
  },
  {
    "Title": "High Commissioner Moragoda interacts with a second group of African  envoys concurrently accredited to Sri Lanka",
    "Date": "21.09.2022",
    "Link": "https://mfa.gov.lk/en/high-commissioner-moragoda-interacts-with-a-second-group-of-african-envoys-concurrently-accredited-to-sri-lanka/",
    "Summary": "High Commissioner of Sri Lanka to India, Milinda Moragoda, engaged with a second group of African envoys concurrently accredited to Sri Lanka, as part of ongoing diplomatic engagements with missions from New Delhi.",
    "Category": "Mission News"
  },
  {
    "Title": "Another Donation of Medicines from the U.S.  Americares Donates more than $773,000 USD worth of Urgently Needed Medicines and Medical Supplies to Sri Lanka",
    "Date": "20.09.2022",
    "Link": "https://mfa.gov.lk/en/another-donation-of-medicines-u-s-americares/",
    "Summary": "Americares has donated over $773,000 USD worth of urgently needed medicines and medical supplies to Sri Lanka in response to a request from the Embassy of Sri Lanka in Washington D.C. The donation aims to support the country's healthcare system during this critical time.",
    "Category": "Mission News"
  },
  {
    "Title": "High Commission of Sri Lanka in New Delhi opens a High Commissioners’ Gallery",
    "Date": "16.09.2022",
    "Link": "https://mfa.gov.lk/en/high-commission-of-sri-lanka-in-new-delhi-opens-a-high-commissioners-gallery/",
    "Summary": "The High Commission of Sri Lanka in New Delhi inaugurated a 'High Commissioners’ Gallery' today, dedicated to all the High Commissioners of Sri Lanka to India. This gallery is located in the chancery building and aims to showcase the contributions of the High Commissioners.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka joins hands with Bangladesh to boost the electronic and  electrical industry",
    "Date": "16.09.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-joins-hands-with-bangladesh-to-boost-the-electronic-and-electrical-industry/",
    "Summary": "Sri Lanka has partnered with Bangladesh to enhance the electronic and electrical industry. The High Commission of Sri Lanka in Bangladesh, along with the Sri Lanka Export Development Board (SLEDB) and the Federation of Bangladesh Chamber of Commerce and Industry (FBCCI), organized a virtual B2B session to facilitate this collaboration. This initiative aims to boost trade and cooperation between the two countries in the mentioned industry.",
    "Category": "Mission News"
  },
  {
    "Title": "The Sri Lanka Consulate General in Karachi and the Pakistan Sri Lanka Business Forum jointly organized live screening of Asia Cup final cricket match in Karachi",
    "Date": "16.09.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-consulate-general-in-karachi-and-the-pakistan-sri-lanka-business-forum-jointly-organized-live-screening-of-asia-cup-final-cricket-match-in-karachi/",
    "Summary": "The Sri Lanka Consulate General in Karachi and the Pakistan Sri Lanka Business Forum collaborated to host a live screening of the Asia Cup final cricket match on September 11, 2022, at the Sri Lanka Consulate General in Karachi. Cricket enthusiasts gathered to watch the exciting match together in a shared viewing experience.",
    "Category": "Mission News"
  },
  {
    "Title": "Donation  of USD 10,000 to Sri Lanka by Sitagu Sayadaw Most. Ven. Dr. Ashin Nyanissara,   The Vice Sangha Raja of Myanmar",
    "Date": "15.09.2022",
    "Link": "https://mfa.gov.lk/en/donation-of-usd-10000-to-sri-lanka-by-sitagu-sayadaw-most-ven-dr-ashin-nyanissara-the-vice-sangha-raja-of-myanmar/",
    "Summary": "The Vice Sangha Raja of Myanmar, Sitagu Sayadaw Most Ven. Dr. Ashin Nyanissara, donated USD 10,000 (approximately Sri Lankan Rupees 3,679,200) to the Government of Sri Lanka for purchasing essentials.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka Embassy in Doha holds “Explore Sri Lanka”- Qatar MENASA 2022, Years of Culture festival",
    "Date": "14.09.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-embassy-in-doha-holds-explore-sri-lanka-qatar-menasa-2022-years-of-culture-festival/",
    "Summary": "The Sri Lanka Embassy in Doha hosted the \"Explore Sri Lanka\" Cultural Festival as part of Qatar MENASA 2022, Years of Culture on September 9-10, 2022, at Education City in Doha, Qatar. The event showcased Sri Lankan culture and heritage to promote cultural exchange between the two countries.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lankans in Zambia Donate Rabies Vaccines to Sri Lanka",
    "Date": "12.09.2022",
    "Link": "https://mfa.gov.lk/en/sri-lankans-in-zambia-donate-rabies-vaccines-to-sri-lanka/",
    "Summary": "Sri Lankans residing in Zambia, through the Zambia Sri Lanka Friendship Association, donated 1150 Rabies Vaccines to Sri Lanka's Ministry of Health. The donation was facilitated by the Honorary Consul of Sri Lanka. This act of generosity aims to support rabies prevention efforts in Sri Lanka.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka Participates in the World Food Istanbul Trade Fair",
    "Date": "07.09.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-participates-in-the-world-food-istanbul-trade-fair/",
    "Summary": "Sri Lanka participated in the World Food Istanbul Trade Fair from September 1 to 4, 2022, showcasing Pure Ceylon tea. The Sri Lankan stand attracted a large number of visitors, with five companies representing the country.",
    "Category": "Mission News"
  },
  {
    "Title": "The Government of Myanmar donates 1000 metric tonnes of  Rice to Sri Lanka",
    "Date": "06.09.2022",
    "Link": "https://mfa.gov.lk/en/the-government-of-myanmar-donates-1000-metric-tonnes-of-rice-to-sri-lanka/",
    "Summary": "The Government of Myanmar donated 1000 metric tonnes of Myanmar White Rice, valued at Sri Lankan Rupees 170 million (approximately USD 463,215), to Sri Lanka on 2 September 2022. The donation was officially made to the Government of Sri Lanka.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka promotes MICE tourism for potential stakeholders in Dhaka",
    "Date": "06.09.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-promotes-mice-tourism-for-potential-stakeholders-in-dhaka/",
    "Summary": "Sri Lanka, in collaboration with the Sri Lanka Convention Bureau and SriLankan Airlines, organized a MICE Promotion Evening at the High Commission premises in Dhaka on 1 September. The event aimed to promote MICE tourism to potential stakeholders in Dhaka, facilitated by the High Commission of Sri Lanka in Bangladesh.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka participates in Indonesia’s biggest exhibition of the Islamic & Halal Industry",
    "Date": "05.09.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-participates-in-indonesias-biggest-exhibition-of-the-islamic-halal-industry/",
    "Summary": "Sri Lanka participated in Indonesia's largest exhibition of the Islamic and Halal Industry, with three companies showcasing their products and services at a stall organized by the Sri Lankan Embassy in Jakarta. The companies included PT Expo Freight-EFL, PT Advantis Akaza, and Hayleys Aventura (Pvt) Ltd.",
    "Category": "Mission News"
  },
  {
    "Title": "High Commissioner Moragoda participates in ‘Idea Exchange’ programme of the Indian Express",
    "Date": "02.09.2022",
    "Link": "https://mfa.gov.lk/en/high-commissioner-moragoda-participates-in-idea-exchange-programme-of-the-indian-express/",
    "Summary": "Sri Lanka's High Commissioner to India, Milinda Moragoda, participated in the 'Idea Exchange' programme hosted by The Indian Express newspaper on September 1, 2022, at the newspaper's headquarters in Noida. The event provided a platform for exchanging ideas and fostering dialogue between the two countries.",
    "Category": "Mission News"
  },
  {
    "Title": "Book on “Sri Lanka – Oman Relations” launched",
    "Date": "02.09.2022",
    "Link": "https://mfa.gov.lk/en/book-on-sri-lanka-oman-relations-launched/",
    "Summary": "A book titled \"Sri Lanka – Oman Relations; Past, Present and Future\" authored by O. L. Ameer Ajwad, Sri Lankan Ambassador to Oman, was launched at the Diplomatic Institute of the Foreign Ministry. The book explores the historical and future aspects of the relationship between Sri Lanka and Oman.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka National Pavilion on Douyin (TikTok) to promote Sri Lanka Products in China attracts over One Million Viewers",
    "Date": "02.09.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-national-pavilion-on-douyin-tiktok-to-promote-sri-lanka-products-in-china-attracts-over-one-million-viewers/",
    "Summary": "The Sri Lanka Embassy in Beijing, along with the China-Sri Lanka Association for Trade and Economic Cooperation, launched the Sri Lanka National Pavilion on Douyin (TikTok) to promote Sri Lankan products in China. The pavilion has attracted over one million viewers since its launch on August 30.",
    "Category": "Mission News"
  },
  {
    "Title": "Speaker unveils a portrait of Sir D.B. Jayatilaka at the  High Commission of Sri Lanka in New Delhi",
    "Date": "01.09.2022",
    "Link": "https://mfa.gov.lk/en/speaker-unveils-a-portrait-of-sir-d-b-jayatilaka-at-the-high-commission-of-sri-lanka-in-new-delhi/",
    "Summary": "The Speaker of the Sri Lanka Parliament, Mahinda Yapa Abeywardena, unveiled a portrait of Sir D.B. Jayatilaka, Sri Lanka's first representative to India, at the High Commission of Sri Lanka in New Delhi on the 28th. The event marked a significant tribute to Sir D.B. Jayatilaka's historical role in Sri Lanka-India relations.",
    "Category": "Mission News"
  },
  {
    "Title": "Ambassador Dr.Palitha Kohona Highlights the Imperative of Feeding 8 Billion Humans While Protecting the Quality of Food We Consume and the Environment",
    "Date": "31.08.2022",
    "Link": "https://mfa.gov.lk/en/ambassador-dr-palitha-kohona-highlights-the-imperative-of-feeding-8-billion-humans-while-protecting-the-quality-of-food-we-consume-and-the-environment/",
    "Summary": "Ambassador Dr. Palitha Kohona emphasized at the Jilin Green Agriculture Forum the importance of addressing the environmental impact of industrial agricultural practices while ensuring food quality for the world's 8 billion population. He urged policymakers to prioritize sustainable practices to protect both the environment and the quality of food consumed.",
    "Category": "Mission News"
  },
  {
    "Title": "Heart to Heart International United States donates USD 8 Million worth of urgent medicines to the people of Sri Lanka",
    "Date": "30.08.2022",
    "Link": "https://mfa.gov.lk/en/heart-to-heart-us-donates/",
    "Summary": "Heart to Heart International United States has donated USD 8 million worth of urgent medicines to the people of Sri Lanka. The donation was announced in a joint press release by the Embassy of Sri Lanka in Washington D.C. and Heart to Heart International, a well-known global humanitarian organization. This significant contribution aims to provide essential medical support to the people in need.",
    "Category": "Mission News"
  },
  {
    "Title": "The Honorary Consulate of Sri Lanka in Gaziantep officially opens",
    "Date": "29.08.2022",
    "Link": "https://mfa.gov.lk/en/the-honorary-consulate-of-sri-lanka-in-gaziantep-officially-opens/",
    "Summary": "The Honorary Consulate of Sri Lanka in Gaziantep, Turkey officially opened on 22 August 2022. The opening ceremony was attended by Ambassador M. Rizvi Hassen, Gaziantep-based parliamentarians, and government officials.",
    "Category": "Mission News"
  },
  {
    "Title": "Promoting Sri Lanka tourism in Tamil Nadu",
    "Date": "29.08.2022",
    "Link": "https://mfa.gov.lk/en/promoting-sri-lanka-tourism-in-tamil-nadu/",
    "Summary": "Deputy High Commissioner of Sri Lanka in Chennai, Dr. D. Venkateshwaran, met with Tourism Minister of Tamil Nadu, Dr. M. A. Mathiventhan, on August 19, 2022, to discuss strategies for boosting tourism between Sri Lanka and Tamil Nadu.",
    "Category": "Mission News"
  },
  {
    "Title": "Ambassador Dr.Palitha Kohona calls for the revival of  Global Tourism",
    "Date": "25.08.2022",
    "Link": "https://mfa.gov.lk/en/ambassador-dr-palitha-kohona-calls-for-the-revival-of-global-tourism/",
    "Summary": "Ambassador Dr. Palitha Kohona advocated for the revival of global tourism at the sixth summit of the Asian Mountain Tourism Alliance in Guiyang, Guizhou, China on 17-18 August 2022. The summit highlighted various products, particularly handicrafts from the province, and attracted high-level attendees.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lankan apparel exporters successfully participate in world’s largest fashion market place – Magic Las Vegas, USA",
    "Date": "24.08.2022",
    "Link": "https://mfa.gov.lk/en/sri-lankan-apparel-exporters-successfully-participate-in-worlds-largest-fashion-market-place-magic-las-vegas-usa/",
    "Summary": "Nine Sri Lankan apparel exporting companies successfully participated in the apparel sourcing trade fair, 'Magic Las Vegas,' held at the Convention Center of Las Vegas, USA from 7 - 10 August 2022. The companies showcased their products at the world's largest fashion marketplace, enhancing their global presence and networking opportunities.",
    "Category": "Mission News"
  },
  {
    "Title": "High Commissioner Moragoda interacts with African envoys concurrently accredited to Sri Lanka",
    "Date": "24.08.2022",
    "Link": "https://mfa.gov.lk/en/high-commissioner-moragoda-interacts-with-african-envoys-concurrently-accredited-to-sri-lanka/",
    "Summary": "High Commissioner of Sri Lanka to India, Milinda Moragoda, engaged with a group of African Heads of Missions concurrently accredited to Sri Lanka, as part of ongoing interactions with Diplomatic Missions from New Delhi. The meeting aimed to strengthen ties between Sri Lanka and African countries.",
    "Category": "Mission News"
  },
  {
    "Title": "Two Sri Lankan origin Canadians among Top 25 Canadian Immigrants of 2022",
    "Date": "22.08.2022",
    "Link": "https://mfa.gov.lk/en/two-sri-lankan-origin-canadians-among-top-25-canadian-immigrants-of-2022/",
    "Summary": "Two Sri Lankan origin Canadians were named among the Top 25 Canadian Immigrants of 2022. The High Commissioner of Sri Lanka to Canada attended the Annual Award Ceremony of the Canadian Immigrant Magazine in Toronto on August 11, 2022.",
    "Category": "Mission News"
  },
  {
    "Title": "Turkiye Donates Emergency Medicine and Medical Supplies to the Government of Sri Lanka",
    "Date": "22.08.2022",
    "Link": "https://mfa.gov.lk/en/turkiye-donates-emergency-medicine-and-medical-supplies-to-the-government-of-sri-lanka/",
    "Summary": "Turkey has donated emergency medicines and medical supplies worth USD one million to the Government of Sri Lanka. The donation includes urgently needed items for hospitals, with the first consignment containing Filgasstrin injections.",
    "Category": "Mission News"
  },
  {
    "Title": "The Government of Austria donates a consignment of essential medicines to Sri Lanka",
    "Date": "19.08.2022",
    "Link": "https://mfa.gov.lk/en/the-government-of-austria-donates-a-consignment-of-essential-medicines-to-sri-lanka/",
    "Summary": "The Government of Austria donated essential medicines worth four million Sri Lankan Rupees to Sri Lanka on August 16, 2022. The consignment included 27 essential medicines urgently needed by the country. This donation aims to support Sri Lanka's healthcare system during challenging times.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lankan Embassy in Jordan Conducts Awareness Session on  Remittances for Migrant Workers",
    "Date": "16.08.2022",
    "Link": "https://mfa.gov.lk/en/sri-lankan-embassy-in-jordan-conducts-awareness-session-on-remittances-for-migrant-workers/",
    "Summary": "The Sri Lankan Embassy in Jordan conducted an awareness session on remittances for migrant workers to boost inflows to Sri Lanka. The session, held via Zoom technology on August 12, 2022, featured an interactive discussion with the Peoples Bank of Sri Lanka. This initiative aimed to provide valuable information and support to Sri Lankan migrants regarding remittance processes.",
    "Category": "Mission News"
  },
  {
    "Title": "Consulate General of Sri Lanka in Mumbai Celebrates Raksha Bandhan with the Sisters from Brahma Kumaris",
    "Date": "16.08.2022",
    "Link": "https://mfa.gov.lk/en/consulate-general-of-sri-lanka-in-mumbai-celebrates-raksha-bandhan-with-the-sisters-from-brahma-kumaris/",
    "Summary": "The Consulate General of Sri Lanka in Mumbai celebrated Raksha Bandhan with the Brahma Kumaris sisters on August 8, 2022, as part of the Mission’s Cultural Exchange Programme. The event aimed to foster cultural ties and promote harmony between the two communities.",
    "Category": "Mission News"
  },
  {
    "Title": "The Ambassador of Sri Lanka to Lebanon calls on the Head of Mission and Force Commander of UNIFIL and visits the Sri Lankan Peace Keeping troops",
    "Date": "12.08.2022",
    "Link": "https://mfa.gov.lk/en/the-ambassador-of-sri-lanka-to-lebanon-calls-on-the-head-of-mission-and-force-commander-of-unifil-and-visits-the-sri-lankan-peace-keeping-troops/",
    "Summary": "The Ambassador of Sri Lanka to Lebanon, Shani Calyaneratne Karunaratne, along with Counselor Srimal Kahathuduwa, visited the United Nations Interim Force in Lebanon (UNIFIL). During the visit, they met with the Head of Mission and Force Commander Ma, and also visited the Sri Lankan Peacekeeping troops stationed in the region.",
    "Category": "Mission News"
  },
  {
    "Title": "​Informative Webinar on opportunities in the Israeli Market",
    "Date": "09.08.2022",
    "Link": "https://mfa.gov.lk/en/%e2%80%8binformative-webinar-on-opportunities-in-the-israeli-market/",
    "Summary": "The Embassy of Sri Lanka in Tel Aviv and the Sri Lanka Export Development Board (SLEDB) collaborated with the Federation of Israeli Chambers of Commerce to host an informative webinar on opportunities in the Israeli market on August 3, 2022. The webinar aimed to provide valuable insights for businesses looking to explore the Israeli market.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka organizes its first ever ‘Murugan Trail’ tour from South India",
    "Date": "09.08.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-organizes-its-first-ever-murugan-trail-tour-from-south-india/",
    "Summary": "Sri Lanka Deputy High Commission in Chennai, in collaboration with Sri Lanka Tourism Promo, organized the first-ever 'Murugan Trail' tour for South Indian media groups. The program aims to promote tourism in Sri Lanka and showcase the cultural significance of the trail.",
    "Category": "Mission News"
  },
  {
    "Title": "Ceremony to Hand over the Sacred Relics from Sri Lanka to  Laos Temple in France",
    "Date": "09.08.2022",
    "Link": "https://mfa.gov.lk/en/ceremony-to-hand-over-the-sacred-relics-from-sri-lanka-to-laos-temple-in-france/",
    "Summary": "Buddhist relics from Sri Lanka's Chief Incumbent of Mihinthale Rajamaha Viharaya, Ven. Dhammarathana Nayaka Thero, were handed over to the Veluvanarama Buddhist temple of Laos at Boussy Saint Georges in France during a ceremony.",
    "Category": "Mission News"
  },
  {
    "Title": "High Commissioner Milinda Moragoda meets Tamil Nadu  Parliamentarian Kanimozhi Karunanidhi",
    "Date": "08.08.2022",
    "Link": "https://mfa.gov.lk/en/high-commissioner-milinda-moragoda-meets-tamil-nadu-parliamentarian-kanimozhi-karunanidhi/",
    "Summary": "Sri Lanka's High Commissioner to India, Milinda Moragoda, met with Tamil Nadu Parliamentarian Kanimozhi Karunanidhi to strengthen engagement with the state, following a previous meeting with its Chief Minister in early June. This meeting signifies ongoing efforts to enhance relations between Sri Lanka and Tamil Nadu.",
    "Category": "Mission News"
  },
  {
    "Title": "Chinese students to follow the Master of Finance in Economics (MFE) of the University of Colombo soon",
    "Date": "08.08.2022",
    "Link": "https://mfa.gov.lk/en/chinese-students-to-follow-the-master-of-finance-in-economics-mfe-of-the-university-of-colombo-soon/",
    "Summary": "The Sri Lanka Embassy hosted a commencement ceremony for Chinese students who will soon begin the Master of Financial Economics Programme (MFE) at the University of Colombo in 2022. The event took place on July 29, 2022, marking the start of this academic endeavor for the students.",
    "Category": "Mission News"
  },
  {
    "Title": "Consular and Labour Mobile Service in Thilafushi Island in Maldives",
    "Date": "03.08.2022",
    "Link": "https://mfa.gov.lk/en/consular-and-labour-mobile-service-in-thilafushi-island-in-maldives/",
    "Summary": "The High Commission of Sri Lanka in Maldives conducted a mobile consular and labour service on Thilafushi Island on July 29, 2022. This was the second mobile service organized by the Mission. The initiative aimed to provide assistance to Sri Lankan citizens residing on the island.",
    "Category": "Mission News"
  },
  {
    "Title": "Dhaka Chamber of Commerce and Industry ready to boost cooperation with Sri Lanka’s National Chamber of Exporters",
    "Date": "29.07.2022",
    "Link": "https://mfa.gov.lk/en/dhaka-chamber-of-commerce-and-industry-ready-to-boost-cooperation-with-sri-lankas-national-chamber-of-exporters/",
    "Summary": "The High Commission of Sri Lanka in Dhaka recently hosted a webinar on July 27, 2022, bringing together the National Chamber of Exporters (NCE) from Sri Lanka and the Dhaka Chamber of Commerce and Industry (DCCI). The event aimed to enhance cooperation between the two chambers for mutual benefit and economic growth.",
    "Category": "Mission News"
  },
  {
    "Title": "Toronto Sri Varasiththi Vinaayagar Hindu Temple Annual Chariot Festival",
    "Date": "28.07.2022",
    "Link": "https://mfa.gov.lk/en/toronto-sri-varasiththi-vinaayagar-hindu-temple-annual-chariot-festival/",
    "Summary": "The Sri Lanka Consulate General in Toronto participated in the Annual Chariot Festival of the Sri Varasiththi Vinaayagar Hindu Temple on July 23, 2022, following an invitation from the Chief Priest and the Board of Trust. The event brought together community members to celebrate and honor the festival traditions.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka shines at Bedford River Festival 2022",
    "Date": "27.07.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-shines-at-bedford-river-festival-2022/",
    "Summary": "Sri Lanka showcased its culture and tourism at the Bedford River Festival 2022 through a collaboration between the High Commission of Sri Lanka in London, the Sri Lanka Tourist Promotion Bureau, and other organizations. The event featured the participation of various Sri Lankan entities, including the Sri Lanka Tea Board and the National Craft Council, to promote the country's offerings to attendees.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lankan Batiks Promotion in Antalya, Turkey",
    "Date": "27.07.2022",
    "Link": "https://mfa.gov.lk/en/sri-lankan-batiks-promotion-in-antalya-turkey/",
    "Summary": "The Embassy of Sri Lanka in Turkey, with the assistance of the Honorary Consul of Sri Lanka to Antalya Ali Kamburoglu, organized the second leg of the Sri Lankan Batiks promotional event on July 20, 2022. The event aimed to showcase and promote Sri Lankan Batiks in Antalya, Turkey.",
    "Category": "Mission News"
  },
  {
    "Title": "High Commissioner Moragoda visits Amul Headquarters in Gujarat; discusses ways and means to enhance dairy sector cooperation",
    "Date": "26.07.2022",
    "Link": "https://mfa.gov.lk/en/high-commissioner-moragoda-visits-amul-headquarters-in-gujarat-discusses-ways-and-means-to-enhance-dairy-sector-cooperation/",
    "Summary": "High Commissioner Moragoda visited Amul Headquarters in Gujarat to discuss enhancing dairy sector cooperation. Sri Lanka aims to develop its dairy industry with India's cooperation, as discussed during the official delegation's visit led by the High Commissioner.",
    "Category": "Mission News"
  },
  {
    "Title": "Jordan donates essential medicines to Sri Lanka",
    "Date": "25.07.2022",
    "Link": "https://mfa.gov.lk/en/jordan-donates-essential-medicines-to-sri-lanka/",
    "Summary": "The Embassy of Sri Lanka in Jordan facilitated a donation of essential medicines to Sri Lanka following a request from the Ministry of Health. The consignment was successfully sent on 19 July, supporting Sri Lanka's healthcare efforts.",
    "Category": "Mission News"
  },
  {
    "Title": "High Commissioner Moragoda interacts with Latin American and Caribbean envoys concurrently accredited to Sri Lanka",
    "Date": "21.07.2022",
    "Link": "https://mfa.gov.lk/en/high-commissioner-moragoda-interacts-with-latin-american-and-caribbean-envoys-concurrently-accredited-to-sri-lanka/",
    "Summary": "High Commissioner of Sri Lanka to India, Milinda Moragoda, engaged with Latin American and Caribbean envoys concurrently accredited to Sri Lanka as part of a series of diplomatic engagements. The interactions aimed to strengthen ties between Sri Lanka and these regions.",
    "Category": "Mission News"
  },
  {
    "Title": "Conference on Globally Important Agricultural Heritage Systems, Qintian, Zhejiang",
    "Date": "21.07.2022",
    "Link": "https://mfa.gov.lk/en/conference-on-globally-important-agricultural-heritage-systems-qintian-zhejiang/",
    "Summary": "The Conference on Globally Important Agricultural Heritage Systems took place in Qintian, Zhejiang, China on July 18, 2022. The hybrid-mode conference attracted a diverse group of high-level speakers.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lankans commemorate Esala Poya in Jordan",
    "Date": "21.07.2022",
    "Link": "https://mfa.gov.lk/en/sri-lankans-commemorate-esala-poya-in-jordan/",
    "Summary": "The Sri Lankan Embassy in Jordan celebrated Esala Poya with the local Buddhist community on July 15, 2022, at the Chancery premises. The day-long event concluded with a Dansala organized by the Embassy Staff, bringing the community together in commemoration.",
    "Category": "Mission News"
  },
  {
    "Title": "Technical Level Meeting on Opportunities in the Mozambique Sustainable Energy Sector Concluded",
    "Date": "21.07.2022",
    "Link": "https://mfa.gov.lk/en/technical-level-meeting-on-opportunities-in-the-mozambique-sustainable-energy-sector-concluded/",
    "Summary": "The Technical Level Meeting on Opportunities in the Mozambique Sustainable Energy Sector, organized by the Sri Lanka High Commission in Pretoria, South Africa, in collaboration with the Sri Lanka Export Development Board (EDB) and the Mozambique Chamber of Commerce, has concluded successfully.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka presents its second Voluntary National Review on the achievement of the Sustainable Development Goals (SDGs)",
    "Date": "19.07.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-presents-its-second-voluntary-national-review-on-the-achievement-of-the-sustainable-development-goals-sdgs/",
    "Summary": "Sri Lanka presented its second Voluntary National Review (VNR) on the achievement of the Sustainable Development Goals (SDGs) at the High Level Political Forum (HLPF) today. The review was convened under the auspices of the United Nations.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka Deputy High Commission in Chennai organizes a medical camp for Sri Lankans in Tamil Nadu for the first time",
    "Date": "19.07.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-deputy-high-commission-in-chennai-organizes-a-medical-camp-for-sri-lankans-in-tamil-nadu-for-the-first-time/",
    "Summary": "The Sri Lanka Deputy High Commission in Chennai organized a medical camp for Sri Lankans in Tamil Nadu for the first time. The camp took place at the Chancery premises on 28 June 2022, providing essential healthcare services to the community.",
    "Category": "Mission News"
  },
  {
    "Title": "URGENT MEDICINAL SUPPLIES FROM THE UNITED STATES  TO THE PEOPLE OF SRI LANKA",
    "Date": "19.07.2022",
    "Link": "https://mfa.gov.lk/en/urgent-medicinal-supplies-from-the-united-states-to-the-people-of-sri-lanka/",
    "Summary": "The Embassy of Sri Lanka in Washington D.C. and Heart to Heart International in the United States are collaborating to provide urgent medicinal supplies to the people of Sri Lanka. This initiative follows a request from the Sri Lankan Embassy and is being carried out under the guidance of His Excellency.",
    "Category": "Mission News"
  },
  {
    "Title": "Thalassemia Foundation and Siam Bioscience Group of Thailand donates  Triple 5000 blood bags and Filgrastim 750 Bottles to Sri Lanka",
    "Date": "13.07.2022",
    "Link": "https://mfa.gov.lk/en/thalassemia-foundation-and-siam-bioscience-group-of-thailand-donates-triple-5000-blood-bags-and-filgrastim-750-bottles-to-sri-lanka/",
    "Summary": "Thalassemia Foundation and Siam Bioscience Group of Thailand donated Triple 5000 blood bags and Filgrastim 750 Bottles to Sri Lanka. Professor Vip Viprakasit, the Director of Thalassemia Research Programme, handed over the donation as a contribution to the country's healthcare system.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lankan Handloom fabrics showcased in Jordan",
    "Date": "11.07.2022",
    "Link": "https://mfa.gov.lk/en/sri-lankan-handloom-fabrics-showcased-in-jordan/",
    "Summary": "Sri Lankan handloom fabrics were showcased in Jordan by the Embassy of Sri Lanka to raise awareness among Jordanian fabric importers about the export quality of traditional handloom fabrics from Sri Lanka. The event aimed to promote these fabrics manufactured in Sri Lanka.",
    "Category": "Mission News"
  },
  {
    "Title": "Beauty of Sri Lankan Batiks admired in Ankara",
    "Date": "11.07.2022",
    "Link": "https://mfa.gov.lk/en/beauty-of-sri-lankan-batiks-admired-in-ankara/",
    "Summary": "Sri Lanka's Ambassador in Turkey, M.R. Hassen, recently hosted an event at the Ambassador's residence in Ankara to showcase the beauty of Sri Lankan Batiks. The event, titled \"Discover the Beauty of Sri Lankan Batiks,\" treated guests to a fashion show highlighting the intricate designs of these traditional textiles.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka’s Popular Brand “Hemas” is set to enter Omani Market",
    "Date": "08.07.2022",
    "Link": "https://mfa.gov.lk/en/sri-lankas-popular-brand-hemas-is-set-to-enter-omani-market/",
    "Summary": "Sri Lanka's leading public company, Hemas Holding PLC, is preparing to enter the Omani market. The Ambassador of Sri Lanka to Oman, Ameer Ajwad, is collaborating with Hemas' Senior Manager for International Expansion on this venture.",
    "Category": "Mission News"
  },
  {
    "Title": "Fostering cooperation in shared advocacies and aspirations:  Sister Club Agreement and Collaboration on IT Education Scholarships Project between the Rotary Club of Colombo-Reconnections and the Rotary Club of Makati-Circle of Friends",
    "Date": "08.07.2022",
    "Link": "https://mfa.gov.lk/en/fostering-cooperation-in-shared-advocacies-and-aspirations-sister-club-agreement-and-collaboration-on-it-education-scholarships-project-between-the-rotary-club-of-colombo-reconnections-and-the/",
    "Summary": "The Embassy of Sri Lanka in Manila facilitated the virtual signing of a sister club agreement between the Rotary Club of Colombo-Reconnections (RCCR) and the Rotary Club of Makati Circle of Friends (RCM-CoF) on June 29. The agreement aims to foster cooperation in shared advocacies and aspirations, particularly focusing on the IT Education Scholarships Project.",
    "Category": "Mission News"
  },
  {
    "Title": "Deputy High Commissioner of Sri Lanka in Chennai meets Chief Minister and the Governor of Kerala",
    "Date": "08.07.2022",
    "Link": "https://mfa.gov.lk/en/deputy-high-commissioner-of-sri-lanka-in-chennai-meets-chief-minister-and-the-governor-of-kerala/",
    "Summary": "Deputy High Commissioner of Sri Lanka in Chennai, Dr. D. Venkateshwaran, met with Chief Minister Pinarayi Vijayan and Governor Arif Mohammad Khan of Kerala on June 30, 2022, in Thiruvananthapuram. The meetings aimed to discuss bilateral relations and cooperation between Sri Lanka and Kerala.",
    "Category": "Mission News"
  },
  {
    "Title": "New Honorary Consul of Sri Lanka in Salzburg appointed",
    "Date": "08.07.2022",
    "Link": "https://mfa.gov.lk/en/new-honorary-consul-of-sri-lanka-in-salzburg-appointed/",
    "Summary": "Ambassador Majintha Jayesinghe appointed Christian Winzer as the new Honorary Consul of Sri Lanka in Salzburg, Austria. Winzer is now responsible for representing Sri Lanka's interests in Salzburg.",
    "Category": "Mission News"
  },
  {
    "Title": "“Hands for Sri Lanka” under the All Nepal Bhikkhu Association donates essential medicines to Sri Lanka",
    "Date": "07.07.2022",
    "Link": "https://mfa.gov.lk/en/hands-for-sri-lanka-under-the-all-nepal-bhikkhu-association-donates-essential-medicines-to-sri-lanka/",
    "Summary": "The All Nepal Bhikkhu Association (ANBA) and the \"Hands for Sri Lanka\" committee donated essential medicines worth over Nepal Rupees 25 lakhs to the Embassy of Sri Lanka. The donation was a gesture of support and solidarity towards Sri Lanka.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lankan Food Product Companies Participate in the SAITEX Trade Show  2022 South Africa",
    "Date": "06.07.2022",
    "Link": "https://mfa.gov.lk/en/sri-lankan-food-product-companies-participate-in-the-saitex-trade-show-2022-south-africa/",
    "Summary": "Two prominent Sri Lankan food product companies took part in the SAITEX Trade Show 2022 in South Africa, held at the Gallagher Convention Centre in Johannesburg from 19 to 21 June 2022. SAITEX is a multi-sector trade show that provides a platform for companies to showcase their products and explore business opportunities.",
    "Category": "Mission News"
  },
  {
    "Title": "The Kuwait Humanitarian & Friendship Society donates USD 10,000 worth medical items",
    "Date": "06.07.2022",
    "Link": "https://mfa.gov.lk/en/the-kuwait-humanitarian-friendship-society-donates-usd-10000-worth-medical-items/",
    "Summary": "The Kuwait Humanitarian & Friendship Society donated medical items worth USD 10,000 to Sri Lanka, as requested by the Embassy of Sri Lanka in Kuwait. The donation aims to assist the Sri Lankan Government in maintaining essential medical supplies.",
    "Category": "Mission News"
  },
  {
    "Title": "Promotional Event on “Golden Paradise Visa Scheme and Other Visa Facilities in Sri Lanka”, held in Tehran",
    "Date": "06.07.2022",
    "Link": "https://mfa.gov.lk/en/promotional-event-on-golden-paradise-visa-scheme-and-other-visa-facilities-in-sri-lanka-held-in-tehran/",
    "Summary": "The Sri Lanka Embassy in Tehran, in partnership with the Department of Immigration and Emigration in Sri Lanka, hosted a promotional event on the \"Golden Paradise Visa Scheme and Other Visa Facilities in Sri Lanka.\" The event aimed to showcase and promote these visa programs to interested individuals in Tehran.",
    "Category": "Mission News"
  },
  {
    "Title": "Promotion of Sri Lanka tourism in Indonesia",
    "Date": "04.07.2022",
    "Link": "https://mfa.gov.lk/en/promotion-of-sri-lanka-tourism-in-indonesia/",
    "Summary": "The Embassy of Sri Lanka in Indonesia, in partnership with the Sri Lanka Tourism Promotion Bureau, held a tourism promotion event on June 24-25, 2022, at the Bundaran HI MRT Station in Jakarta. The event aimed to showcase Sri Lanka's tourist attractions to the Indonesian audience, boosting tourism between the two countries.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka Embassy in Japan conducts a successful Mobile Consular Service in Osaka",
    "Date": "04.07.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-embassy-in-japan-conducts-a-successful-mobile-consular-service-in-osaka/",
    "Summary": "The Sri Lanka Embassy in Tokyo successfully conducted a Mobile Consular Service at the Umeda Sky Building in Osaka on Saturday, benefiting over 50 Sri Lankan expatriates. The service provided essential facilities to the expatriates, enhancing their access to consular assistance and support.",
    "Category": "Mission News"
  },
  {
    "Title": "The Embassy of Sri Lanka in Brasilia participates at the INNOVA Summit 2022",
    "Date": "04.07.2022",
    "Link": "https://mfa.gov.lk/en/the-embassy-of-sri-lanka-in-brasilia-participates-at-the-innova-summit-2022/",
    "Summary": "The Embassy of Sri Lanka in Brasilia participated in the INNOVA Summit 2022 at the Convention Centre in Brasilia from June 21 to 23, 2022. The INNOVA Summit is a significant Trade and Industrial Promotional event.",
    "Category": "Mission News"
  },
  {
    "Title": "Ceylon Tea Seminar at the Embassy of Sri Lanka in Tokyo",
    "Date": "04.07.2022",
    "Link": "https://mfa.gov.lk/en/ceylon-tea-seminar-at-the-embassy-of-sri-lanka-in-tokyo/",
    "Summary": "The Embassy of Sri Lanka in Japan hosted a Ceylon Tea Seminar organized by the Japan Tea Association on June 25, 2022, with over 35 Japanese tea enthusiasts in attendance. The event aimed to promote Ceylon Tea and strengthen cultural ties between the two countries.",
    "Category": "Mission News"
  },
  {
    "Title": "Ambassador inaugurates the Office of Honorary Consulate of Sri Lanka in Tbilisi, Georgia",
    "Date": "04.07.2022",
    "Link": "https://mfa.gov.lk/en/ambassador-inaugurates-the-office-of-honorary-consulate-of-sri-lanka-in-tbilisi-georgia/",
    "Summary": "The Office of Honorary Consulate of Sri Lanka in Tbilisi, Georgia was inaugurated with a colorful ceremony on June 20, 2022. The event was attended by the Ambassador of Sri Lanka accredited to Georgia, marking the official launch of the consulate.",
    "Category": "Mission News"
  },
  {
    "Title": "Donation of Medicine to Sri Lanka",
    "Date": "29.06.2022",
    "Link": "https://mfa.gov.lk/en/donation-of-medicine-to-sri-lanka/",
    "Summary": "Several Buddhist and religious organizations in Malaysia have donated urgent medicine and medical items to Sri Lanka in response to appeals. The donation was made by Karine Gheong representing Chi Hui Tang - Kuala Lumpur and Siew Nyoke. This gesture aims to support the healthcare needs in Sri Lanka.",
    "Category": "Mission News"
  },
  {
    "Title": "High Commissioner Moragoda discusses urgent energy requirements of  Sri Lanka with the Minister of Petroleum and Natural Gas of India",
    "Date": "28.06.2022",
    "Link": "https://mfa.gov.lk/en/high-commissioner-moragoda-discusses-urgent-energy-requirements-of-sri-lanka-with-the-minister-of-petroleum-and-natural-gas-of-india/",
    "Summary": "Sri Lankan High Commissioner to India, Milinda Moragoda, held discussions with Indian Minister of Petroleum and Natural Gas and Housing and Urban Affairs, Hardeep Singh Puri, regarding Sri Lanka's urgent energy needs. The meeting focused on bilateral cooperation in addressing these critical energy requirements.",
    "Category": "Mission News"
  },
  {
    "Title": "Minister of Tourism Harin Fernando meets the UK travel industry",
    "Date": "28.06.2022",
    "Link": "https://mfa.gov.lk/en/minister-of-tourism-harin-fernando-meets-the-uk-travel-industry/",
    "Summary": "Minister of Tourism Harin Fernando met with the UK travel industry in London on June 16, 2022, at the High Commission of Sri Lanka. The promotional event was organized by the High Commission to showcase Sri Lanka's tourism offerings and strengthen ties with the UK travel sector.",
    "Category": "Mission News"
  },
  {
    "Title": "Ambassador of Sri Lanka to Lebanon pays courtesy call on Head of Mission and Force Commander of UNIFIL Major General Aroldo Lâzaro and visits Sri Lankan Peace Keeping troops",
    "Date": "28.06.2022",
    "Link": "https://mfa.gov.lk/en/ambassador-of-sri-lanka-to-lebanon-pays-courtesy-call-on-head-of-mission-and-force-commander-of-unifil-major-general-aroldo-lazaro-and-visits-sri-lankan-peace-keeping-troops/",
    "Summary": "Ambassador of Sri Lanka to Lebanon, Shani Calyaneratne Karunaratne, visited the Head Quarters of UNIFIL and met with the Head of Mission and Force Commander Major General Aroldo Lâzaro. During the visit, the Ambassador also met with Sri Lankan Peacekeeping troops stationed in Lebanon.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka Embassy in Paris successfully operates a Consular information service on ‘Sri Lanka Day’",
    "Date": "23.06.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-embassy-in-paris-successfully-operates-a-consular-information-service-on-sri-lanka-day/",
    "Summary": "The Sri Lanka Embassy in Paris operated a consular information desk during the Sri Lanka Day festivities at 'Pagode Grande Bois de Vincennes' on June 19. The event was organized by the 'I. Embassy of Sri Lanka successfully provided consular services to attendees during the celebration.",
    "Category": "Mission News"
  },
  {
    "Title": "Promotion of Sri Lanka Tourism in France",
    "Date": "23.06.2022",
    "Link": "https://mfa.gov.lk/en/promotion-of-sri-lanka-tourism-in-france/",
    "Summary": "The Embassy of Sri Lanka in Paris, in collaboration with Sri Lankan Airlines, organized a meeting between Sri Lanka's Minister of Tourism and Lands, Harin Fernando, and French travel agents to promote Sri Lanka tourism in France.",
    "Category": "Mission News"
  },
  {
    "Title": "High Commissioner Moragoda interacts with a group of fifteen European  envoys concurrently accredited to Sri Lanka",
    "Date": "22.06.2022",
    "Link": "https://mfa.gov.lk/en/high-commissioner-moragoda-interacts-with-a-group-of-fifteen-european-envoys-concurrently-accredited-to-sri-lanka/",
    "Summary": "High Commissioner of Sri Lanka to India, Milinda Moragoda, recently engaged with a group of fifteen European envoys concurrently accredited to Sri Lanka. This interaction is part of ongoing diplomatic engagement with 94 missions in Sri Lanka from New Delhi, fostering stronger international relations.",
    "Category": "Mission News"
  },
  {
    "Title": "International Domestic Workers Day – 2022",
    "Date": "22.06.2022",
    "Link": "https://mfa.gov.lk/en/international-domestic-workers-day-2022/",
    "Summary": "International Domestic Workers Day 2022 was celebrated on June 19 at the Embassy premises in Beirut by the Lebanon Sri Lanka Women's Association and the Embassy of Sri Lanka. The event was organized to honor and recognize the contributions of domestic migrant workers.",
    "Category": "Mission News"
  },
  {
    "Title": "Finance Minister of India assures her fullest support to the economic recovery process in Sri Lanka",
    "Date": "22.06.2022",
    "Link": "https://mfa.gov.lk/en/finance-minister-of-india-assures-her-fullest-support-to-the-economic-recovery-process-in-sri-lanka/",
    "Summary": "India's Finance Minister Nirmala Sitharaman assured Sri Lanka's High Commissioner to India, Milinda Moragoda, of her full support and cooperation in the economic recovery process.",
    "Category": "Mission News"
  },
  {
    "Title": "​High Commissioner Moragoda discusses stabilization and recovery of the  Sri Lankan economy with External Affairs Minister of India",
    "Date": "21.06.2022",
    "Link": "https://mfa.gov.lk/en/%e2%80%8bhigh-commissioner-moragoda-discusses-stabilization-and-recovery-of-the-sri-lankan-economy-with-external-affairs-minister-of-india/",
    "Summary": "High Commissioner of Sri Lanka to India, Milinda Moragoda, met with India's Minister of External Affairs, Dr. S. Jaishankar, on June 20, 2022, to discuss the stabilization and recovery of the Sri Lankan economy and the future of Indian assistance in this regard. The meeting focused on collaboration for economic progress between the two countries.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka Embassy in Bahrain conducts a free Medical Camp for  Sri Lankan migrant workers",
    "Date": "20.06.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-embassy-in-bahrain-conducts-a-free-medical-camp-for-sri-lankan-migrant-workers/",
    "Summary": "The Sri Lanka Embassy in Bahrain, along with the Sri Lanka Engineering Society and the American Mission Hospital, conducted a free Medical Camp and Clinic for Sri Lankan migrant workers on 17 June 2022 at the Embassy premises. This initiative aimed to provide healthcare services and support to the migrant community.",
    "Category": "Mission News"
  },
  {
    "Title": "Geographical Indication (GI) status for Ceylon Cinnamon attracts Turkish market",
    "Date": "20.06.2022",
    "Link": "https://mfa.gov.lk/en/geographical-indication-gi-status-for-ceylon-cinnamon-attracts-turkish-market/",
    "Summary": "The Embassy of Sri Lanka in Turkey has launched a program to boost the promotion of Ceylon Cinnamon in Turkey following the acquisition of European Union Geographical Indication status. This move aims to attract the Turkish market and enhance the recognition of Ceylon Cinnamon internationally.",
    "Category": "Mission News"
  },
  {
    "Title": "“Afternoon Tea; Learn about Ceylon Tea”",
    "Date": "20.06.2022",
    "Link": "https://mfa.gov.lk/en/afternoon-tea-learn-about-ceylon-tea/",
    "Summary": "The Embassy of Sri Lanka in Tokyo, in collaboration with the Foreign Correspondents Club (FCCJ) of Japan, organized a Ceylon Tea Promotion event titled \"Afternoon Tea; Learn about Ceylon Tea\" at the FCCJ on June 11, 2022. The event was attended by over 60 participants.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka Mission in New York co-hosts ‘Facets of Sri Lanka’ tourism promotion event with Turkish Airlines and Jetwing Travels",
    "Date": "20.06.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-mission-in-new-york-co-hosts-facets-of-sri-lanka-tourism-promotion-event-with-turkish-airlines-and-jetwing-travels/",
    "Summary": "The Sri Lanka Mission in New York, in collaboration with Turkish Airlines and Jetwing Travels, co-hosted the 'Facets of Sri Lanka' tourism promotion event on June 14, 2022. The event showcased the diverse attractions that Sri Lanka offers to visitors at the premises of the Sri Lanka Mission to the United Nations.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka cooperates with Brazilian Travel Agencies to Promote Tourism",
    "Date": "17.06.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-cooperates-with-brazilian-travel-agencies-to-promote-tourism/",
    "Summary": "Sri Lanka's Embassy in Brazil partnered with the Brazilian Association for Travel Agencies (ABAV- DF) to host an event promoting Sri Lanka as a tourist destination for Brazilian and South American travelers. The collaboration aims to boost tourism between the two countries.",
    "Category": "Mission News"
  },
  {
    "Title": "Exploring bilateral partnerships between Sri Lanka and the Philippines in Technical and Vocational Education (TVET)",
    "Date": "17.06.2022",
    "Link": "https://mfa.gov.lk/en/exploring-bilateral-partnerships-between-sri-lanka-and-the-philippines-in-technical-and-vocational-education-tvet/",
    "Summary": "The Embassy of Sri Lanka in Manila is collaborating with key stakeholders like the Colombo Plan Staff College (CPSC) in Manila and the State Ministry of Skills Development and Vocational Education to explore bilateral partnerships with the Philippines in Technical and Vocational Education (TVET). This initiative aims to enhance cooperation and promote skills development between the two countries.",
    "Category": "Mission News"
  },
  {
    "Title": "The Embassy of Sri Lanka in the United Arab Emirates Celebrates Poson  on 14 June 2022",
    "Date": "17.06.2022",
    "Link": "https://mfa.gov.lk/en/the-embassy-of-sri-lanka-in-the-united-arab-emirates-celebrates-poson-on-14-june-2022/",
    "Summary": "The Embassy of Sri Lanka in the United Arab Emirates, along with the Sri Lankan community, celebrated Poson on June 14, 2022, in honor of the day Buddhism was introduced to Sri Lanka by Arahat Mahinda Thero during the Poson Poya.",
    "Category": "Mission News"
  },
  {
    "Title": "The Islamic Republic of Iran Pledges Medical Assistance to Sri Lanka",
    "Date": "17.06.2022",
    "Link": "https://mfa.gov.lk/en/the-islamic-republic-of-iran-pledges-medical-assistance-to-sri-lanka/",
    "Summary": "The Islamic Republic of Iran has pledged medical assistance to Sri Lanka. Sri Lanka's Ambassador to Iran, G.M. Vipulatheja Wishwanath Aponsu, met with key dignitaries including Deputy Minister of Health Dr. Mohammed Hossein Niknam to discuss the support.",
    "Category": "Mission News"
  },
  {
    "Title": "Ambassador-designate of the Democratic Socialist Republic of Sri Lanka to the Republic of Korea, assumes duties",
    "Date": "16.06.2022",
    "Link": "https://mfa.gov.lk/en/ambassador-designate-of-the-democratic-socialist-republic-of-sri-lanka-to-the-republic-of-korea-assumes-duties/",
    "Summary": "Savitri Indrachapa Panabokke, the Ambassador-designate of Sri Lanka to South Korea, has officially started her duties at the Sri Lankan Embassy in Seoul.",
    "Category": "Mission News"
  },
  {
    "Title": "The Sri Lanka Embassy  in Oman organizes a blood donation programme to   coincide with Vesak",
    "Date": "16.06.2022",
    "Link": "https://mfa.gov.lk/en/the-sri-lanka-embassy-in-oman-organizes-a-blood-donation-programme-to-coincide-with-vesak/",
    "Summary": "The Sri Lanka Embassy in Oman, led by Ambassador Ameer Ajwad, organized a blood donation program in conjunction with the Vesak festival. The initiative was supported by the Sri Lankan community in Oman, emphasizing the spirit of giving during this auspicious occasion.",
    "Category": "Mission News"
  },
  {
    "Title": "Donation of Medicine",
    "Date": "16.06.2022",
    "Link": "https://mfa.gov.lk/en/donation-of-medicine/",
    "Summary": "Dato Anjela Nagoo Lai Choo, Chairperson of the Global Federation of Chinese Business Women, donated medicine worth MYR 29,900 to Sri Lanka. The donation was received by the High Commissioner of Sri Lanka to Malaysia, Air Chief Marshal (Retd) Sumangal.",
    "Category": "Mission News"
  },
  {
    "Title": "Minister of Education Susil Premajayantha leads the delegation for the 2nd Asia-Pacific Regional Education Minister’s Conference on SDG4 -Education 2030 (APREMC II) in Bangkok.",
    "Date": "16.06.2022",
    "Link": "https://mfa.gov.lk/en/minister-of-education-susil-premajayantha-leads-the-delegation-for-the-2nd-asia-pacific-regional-education-ministers-conference-on-sdg4-education-2030-apremc-ii-in-bangkok/",
    "Summary": "Minister of Education Susil Premajayantha led the Sri Lankan delegation at the 2nd Asia-Pacific Regional Education Minister’s Conference on SDG4 -Education 2030 (APREMC II) in Bangkok from June 5 to 7, 2022. The conference focused on advancing education goals in the region.",
    "Category": "Mission News"
  },
  {
    "Title": "The High Commission of Sri Lanka in Ottawa explores avenues for cooperation with Canadian Universities",
    "Date": "16.06.2022",
    "Link": "https://mfa.gov.lk/en/the-high-commission-of-sri-lanka-in-ottawa-explores-avenues-for-cooperation-with-canadian-universities/",
    "Summary": "The High Commission of Sri Lanka in Ottawa is collaborating with Canadian universities, including the University of Calgary and the University Grant Commission of Sri Lanka, to explore opportunities for cooperation. Vice Provost and Associate Vice President (International) Prof. Janaka Ruwanpura is involved in these discussions to enhance partnerships between the institutions.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka joins the celebration of the 75th Anniversary of the United Nations Economic and Social Commission for Asia and the Pacific (UNESCAP) and the 78th Session in  Bangkok",
    "Date": "15.06.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-joins-the-celebration-of-the-75th-anniversary-of-the-united-nations-economic-and-social-commission-for-asia-and-the-pacific-unescap-and-the-78th-session-in-bangko/",
    "Summary": "Sri Lanka participated in the 75th Anniversary of the UNESCAP and the 78th session in Bangkok, held from 23-27 May 2022 under the theme \"A common agenda to advance sustainable development in Asia and the Pacific.\" The event took place in a hybrid mode at the U.",
    "Category": "Mission News"
  },
  {
    "Title": "A new software application helps the Sri Lanka Consulate General in Melbourne to deliver efficient services",
    "Date": "15.06.2022",
    "Link": "https://mfa.gov.lk/en/a-new-software-application-helps-the-sri-lanka-consulate-general-in-melbourne-to-deliver-efficient-services/",
    "Summary": "A new digital Consular Counter Management System has been implemented by the Sri Lanka Consulate General in Melbourne to efficiently serve the Sri Lankan community in Victoria, Australia. This software application aims to streamline consular services for Sri Lankans residing in the Australian state.",
    "Category": "Mission News"
  },
  {
    "Title": "Religious Harmony among Sri Lankan Buddhist, Christian and Muslim Diaspora in Lebanon.",
    "Date": "15.06.2022",
    "Link": "https://mfa.gov.lk/en/religious-harmony-among-sri-lankan-buddhist-christian-and-muslim-diaspora-in-lebanon/",
    "Summary": "The Embassy of Sri Lanka in Lebanon organized a ceremony to baptize a newborn baby to Sri Lankan Catholic parents on June 5, 2022, as part of its cultural and religious outreach program. This event showcased religious harmony among the Sri Lankan Buddhist, Christian, and Muslim diaspora in Lebanon.",
    "Category": "Mission News"
  },
  {
    "Title": "CAEDA Offers to Promote Sri Lanka Products Online and Offline in China",
    "Date": "10.06.2022",
    "Link": "https://mfa.gov.lk/en/caeda-offers-to-promote-sri-lanka-products-online-and-offline-in-china/",
    "Summary": "CAEDA.UCC, led by Chairman Lu Hongjun, met with Ambassador Dr. Palitha Kohona on June 2, 2022, to discuss promoting Sri Lankan products in China both online and offline. The delegation aims to explore ways and means to enhance economic cooperation between the two countries.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka’s Tri Forces participate at the Queen’s Platinum Jubilee pageant",
    "Date": "10.06.2022",
    "Link": "https://mfa.gov.lk/en/sri-lankas-tri-forces-participate-at-the-queens-platinum-jubilee-pageant/",
    "Summary": "Sri Lanka's Tri Forces participated in the Queen's Platinum Jubilee pageant at the invitation of the UK Government on Sunday, June 5, 2022. The event celebrated Queen Elizabeth II's reign.",
    "Category": "Mission News"
  },
  {
    "Title": "International Tea Day 2022 Celebration & Ceylon Tea Promotion in South Africa",
    "Date": "10.06.2022",
    "Link": "https://mfa.gov.lk/en/2022-%e0%b6%a2%e0%b7%8f%e0%b6%ad%e0%b7%8a%e2%80%8d%e0%b6%ba%e0%b6%b1%e0%b7%8a%e0%b6%ad%e0%b6%bb-%e0%b6%ad%e0%b7%9a-%e0%b6%af%e0%b7%92%e0%b6%b1%e0%b6%ba-%e0%b7%83%e0%b7%90%e0%b6%b8%e0%b6%bb/",
    "Summary": "The Sri Lanka High Commission in Pretoria, South Africa, celebrated International Tea Day 2022 at the World Food Festival. May 21 was designated by the United Nations General Assembly in 2019 to raise awareness about the importance of tea. The event also promoted Ceylon tea in South Africa.",
    "Category": "Mission News"
  },
  {
    "Title": "High Commissioner Milinda Moragoda calls on the Chief Minister of  Tamil Nadu",
    "Date": "10.06.2022",
    "Link": "https://mfa.gov.lk/en/high-commissioner-milinda-moragoda-calls-on-the-chief-minister-of-tamil-nadu/",
    "Summary": "Sri Lanka's High Commissioner to India, Milinda Moragoda, visited the Chief Minister of Tamil Nadu, Thiru M.K. Stalin, at his office in Chennai on Saturday morning. The meeting was a courtesy call to strengthen diplomatic ties between the two regions.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka participates at the 3rd Pakistan Tea Convention in Karachi",
    "Date": "10.06.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-participates-at-the-3rd-pakistan-tea-convention-in-karachi/",
    "Summary": "Sri Lanka participated in the 3rd Pakistan Tea Convention organized by the Pakistan Tea Association at the Marriot Hotel in Karachi from May 20 to 22, 2022. The event saw the attendance of over 300 leaders from Pakistan's tea industry.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka Embassy in Beijing promotes Ceylon Black Tea at  International Tea Day 2022",
    "Date": "10.06.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-embassy-in-beijing-promotes-ceylon-black-tea-at-international-tea-day-2022/",
    "Summary": "The Sri Lanka Embassy in Beijing marked International Tea Day on June 7, 2022, by showcasing Ceylon Black Tea. This event was a delayed celebration due to pandemic restrictions. International Tea Day is observed annually on May 21.",
    "Category": "Mission News"
  },
  {
    "Title": "‘Support Sri Lanka’ organised by the Deputy High Commission of Sri Lanka in Chennai.",
    "Date": "10.06.2022",
    "Link": "https://mfa.gov.lk/en/support-sri-lanka-organised-by-the-deputy-high-commission-of-sri-lanka-in-chennai/",
    "Summary": "The Deputy High Commission of Sri Lanka in Chennai organized 'Support Sri Lanka' to secure the food and health safety of Sri Lanka through financial support. The program aimed to ensure the well-being of the country's population.",
    "Category": "Mission News"
  },
  {
    "Title": "Ambassador Sanjiv Gunasekara calls on Parliamentary Vice – Minister for Foreign Affairs of Japan, Honda Taro",
    "Date": "09.06.2022",
    "Link": "https://mfa.gov.lk/en/ambassador-sanjiv-gunasekara-calls-on-parliamentary-vice-minister-for-foreign-affairs-of-japan-honda-taro/",
    "Summary": "Ambassador Sanjiv Gunasekara met with Japan's Parliamentary Vice-Minister for Foreign Affairs, Honda Taro on June 2, 2022. They discussed Sri Lanka's current economic situation and other relevant matters during their meeting.",
    "Category": "Mission News"
  },
  {
    "Title": "Ambassador C.A. Chaminda I. Colonne presents the Letter of Credence to the His Majesty Preah Bat Samdech Preah Boromneath Norodom Sihamoni, King of the Kingdom of Cambodia",
    "Date": "02.06.2022",
    "Link": "https://mfa.gov.lk/en/ambassador-c-a-chaminda-i-colonne-presents-the-letter-of-credence-to-the-his-majesty-preah-bat-samdech-preah-boromneath-norodom-sihamoni-king-of-the-kingdom-of-cambodia/",
    "Summary": "Ambassador C.A. Chaminda I. Colonne of Sri Lanka presented his Letter of Credence to His Majesty Preah Bat Samdech Preah Boromneath Norodom Sihamoni, the King of Cambodia. He currently serves as Sri Lanka's Ambassador to Thailand and Permanent Representative to UNESCAP.",
    "Category": "Mission News"
  },
  {
    "Title": "India-Sri Lanka Foundation holds its 37 Board Meeting in New Delhi",
    "Date": "02.06.2022",
    "Link": "https://mfa.gov.lk/en/india-sri-lanka-foundation-holds-its-37-board-meeting-in-new-delhi/",
    "Summary": "The India-Sri Lanka Foundation convened its 37th Board Meeting in New Delhi on the 27th, co-chaired by Sri Lanka's High Commissioner to India, Milinda Moragoda, and the High Commissioner of India to Sri Lanka.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka Deputy High Commission in Chennai issues 330 citizenship certificates, 31 birth certificates and 9 RRP Passports during two Special Consular Camps",
    "Date": "01.06.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-deputy-high-commission-in-chennai-issues-330-citizenship-certificates-31-birth-certificates-and-9-rrp-passports-during-two-special-consular-camps/",
    "Summary": "The Sri Lanka Deputy High Commission in Chennai issued 330 citizenship certificates, 31 birth certificates, and 9 RRP Passports during two Special Consular Camps. These camps were organized to facilitate document processing for individuals in need of these official documents.",
    "Category": "Mission News"
  },
  {
    "Title": "Vesak celebrations in Berlin",
    "Date": "01.06.2022",
    "Link": "https://mfa.gov.lk/en/vesak-celebrations-in-berlin/",
    "Summary": "The Embassy of Sri Lanka in Berlin celebrated Vesak at the Official Residence on 29 May 2022 with the participation of the members of the Sri Lanka Association in Germany and disciples of Das Buddhistische Haus in Berlin. The event marked a significant cultural and religious celebration in the heart of Berlin.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka Embassy in Ankara, Turkey celebrates Vesak 2022",
    "Date": "27.05.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-embassy-in-ankara-turkey-celebrates-vesak-2022/",
    "Summary": "The Sri Lanka Embassy in Ankara, Turkey celebrated Vesak 2022 for the first time at the Chancery premises with Buddhist religious activities on 24 May. Venerable Bhante Pannawansa Thero attended the event upon the Embassy's invitation.",
    "Category": "Mission News"
  },
  {
    "Title": "The United Nations General Assembly adopts Sri Lanka sponsored resolution to declare 1 March as ‘World Sea-grass Day’",
    "Date": "25.05.2022",
    "Link": "https://mfa.gov.lk/en/the-united-nations-general-assembly-adopts-sri-lanka-sponsored-resolution-to-declare-1-march-as-world-sea-grass-day/",
    "Summary": "The United Nations General Assembly adopted a resolution sponsored by Sri Lanka on May 23, 2022, declaring March 1 as 'World Seagrass Day'. The resolution, co-sponsored by 24 countries, was passed by consensus. This initiative aims to raise awareness about the importance of seagrass ecosystems for marine biodiversity.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lankan and Thai Buddhists in South Africa Celebrate Vesak on the theme of Religious Harmony",
    "Date": "25.05.2022",
    "Link": "https://mfa.gov.lk/en/sri-lankan-and-thai-buddhists-in-south-africa-celebrate-vesak-on-the-theme-of-religious-harmony/",
    "Summary": "Sri Lankan and Thai Buddhists in South Africa celebrated Vesak on the theme of Religious Harmony. The Sri Lanka Mission staff in Pretoria and Sri Lankans in Johannesburg joined the 2022 Vesak celebrations by special invitation from the Thai Buddhist Temple - Johannesburg Medit. The event highlighted the importance of unity among different Buddhist communities in promoting religious harmony.",
    "Category": "Mission News"
  },
  {
    "Title": "Vesak celebrated in Brussels",
    "Date": "25.05.2022",
    "Link": "https://mfa.gov.lk/en/vesak-celebrated-in-brussels/",
    "Summary": "The Embassy of Sri Lanka in Brussels celebrated Vesak at the Official Residence on May 22, 2022, with the participation of the Sri Lankan community in Belgium and Luxembourg. The event also included representatives from the Mahamevnawa Buddhist Monastery in the Netherlands.",
    "Category": "Mission News"
  },
  {
    "Title": "The Vesak Full Moon Poya Day celebrated in Manila",
    "Date": "24.05.2022",
    "Link": "https://mfa.gov.lk/en/the-vesak-full-moon-poya-day-celebrated-in-manila/",
    "Summary": "The Embassy of Sri Lanka in Manila and the Universal Wisdom Foundation Inc. (UWFI) celebrated the Vesak Full Moon Poya Day at Wisdom Park. The event was attended by Ambassadors and other diplomatic representatives.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka’s role in getting due recognition for Vesak Day highlighted at celebrations in Kathmandu",
    "Date": "24.05.2022",
    "Link": "https://mfa.gov.lk/en/sri-lankas-role-in-getting-due-recognition-for-vesak-day-highlighted-at-celebrations-in-kathmandu/",
    "Summary": "During the Vesak Day celebration at the Sri Lankan Embassy in Kathmandu on May 18th, Ambassador Himalee Arunatilaka emphasized Sri Lanka's role in securing recognition for Vesak Day as a public holiday in Nepal. She highlighted the efforts made to promote the significance of Vesak internationally.",
    "Category": "Mission News"
  },
  {
    "Title": "Consulate General in Mumbai promotes Cinnamon with ISKCON temple",
    "Date": "20.05.2022",
    "Link": "https://mfa.gov.lk/en/consulate-general-in-mumbai-promotes-cinnamon-with-iskcon-temple/",
    "Summary": "The Consulate General of Sri Lanka in Mumbai launched a Ceylon Cinnamon promotion campaign by offering 5kgs of Ceylon Cinnamon to Lord Krishna at the ISKCON temple.",
    "Category": "Mission News"
  },
  {
    "Title": "Embassy of Sri Lanka in Viet Nam holds Vesak Day Blessing Ceremony",
    "Date": "19.05.2022",
    "Link": "https://mfa.gov.lk/en/embassy-of-sri-lanka-in-viet-nam-holds-vesak-day-blessing-ceremony/",
    "Summary": "The Embassy of Sri Lanka in Viet Nam held the Vesak Day Blessing Ceremony on May 14, 2022, in partnership with Bai Dinh Pagoda in Ninh Binh Province. The event was also supported by Linea Aqua Viet Nam Co. Ltd.",
    "Category": "Mission News"
  },
  {
    "Title": "Embassy of Sri Lanka in Yangon Commemorates Vesak Day 2022",
    "Date": "19.05.2022",
    "Link": "https://mfa.gov.lk/en/embassy-of-sri-lanka-in-yangon-commemorates-vesak-day-2022/",
    "Summary": "The Embassy of Sri Lanka in Yangon, Myanmar organized the commemoration of Vesak Day 2022 on Sunday, 15 May 2022. The event featured Ven. Bandarawela Wimalawansha Thero, a highly respected Sri Lankan Buddhist Bhikku known for his teachings on meditation.",
    "Category": "Mission News"
  },
  {
    "Title": "Indian Buddhists arrive in Sri Lanka under the Buddhist trail promotion organized by the Consulate General of Sri Lanka in Mumbai",
    "Date": "19.05.2022",
    "Link": "https://mfa.gov.lk/en/indian-buddhists-arrive-in-sri-lanka-under-the-buddhist-trail-promotion-organized-by-the-consulate-general-of-sri-lanka-in-mumbai/",
    "Summary": "The Consulate General of Sri Lanka in Mumbai organized a Buddhist tourist group of 90 Buddhists from Maharashtra, India, to visit Sri Lanka as part of the Buddhist trail promotion. This marks the first group of Indian Buddhists to visit Sri Lanka under this initiative.",
    "Category": "Mission News"
  },
  {
    "Title": "Vesak Celebrations at the Embassy of Sri Lanka in Tehran",
    "Date": "18.05.2022",
    "Link": "https://mfa.gov.lk/en/vesak-celebrations-at-the-embassy-of-sri-lanka-in-tehran/",
    "Summary": "The Embassy of Sri Lanka in Tehran celebrated Vesak on May 15, 2022, at the Chancery premises. The Ambassador, staff members, and the Sri Lankan community gathered at the Embassy for the occasion. The event marked a significant cultural and religious celebration for the Sri Lankan community in Tehran.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka Consulate General participates at the “My Karachi International Exhibition” in Karachi",
    "Date": "18.05.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-consulate-general-participates-at-the-my-karachi-international-exhibition-in-karachi/",
    "Summary": "The Consulate General of Sri Lanka in Karachi participated in the 17th My Karachi International Exhibition from May 13 to 15, 2022, at the Karachi Expo Center in Pakistan. The event was sponsored by the Department, and the Sri Lankan representation was successful in showcasing their presence.",
    "Category": "Mission News"
  },
  {
    "Title": "The Consulate General of Sri Lanka in Mumbai celebrates Vesak",
    "Date": "18.05.2022",
    "Link": "https://mfa.gov.lk/en/the-consulate-general-of-sri-lanka-in-mumbai-celebrates-vesak/",
    "Summary": "The Consulate General of Sri Lanka in Mumbai celebrated Vesak Day on May 14, 2022, at their premises. The event was attended by staff members and the Sri Lankan community in Mumbai, featuring special festivities. It was a joyous celebration of Vesak.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka Deputy High Commission in Chennai Celebrates Vesak",
    "Date": "18.05.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-deputy-high-commission-in-chennai-celebrates-vesak/",
    "Summary": "The Sri Lanka Deputy High Commission in Chennai celebrated Vesak, which commemorates the birth, enlightenment, and passing away of Lord Buddha. Vesak is widely celebrated in South and Southeast Asia among Buddhism followers. The event was held to honor this important occasion.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka Embassy in Beijing Celebrates Vesak 2022",
    "Date": "17.05.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-embassy-in-beijing-celebrates-vesak-2022/",
    "Summary": "The Sri Lanka Embassy in Beijing celebrated Vesak 2022, honoring the birth, enlightenment, and passing away of Lord Buddha on May 15. The event was low-key, with attendance limited to embassy staff.",
    "Category": "Mission News"
  },
  {
    "Title": "First ever visit of Buddhist and Hindu Priests from Sri Lanka to Saudi Arabia",
    "Date": "17.05.2022",
    "Link": "https://mfa.gov.lk/en/first-ever-visit-of-buddhist-and-hindu-priests-from-sri-lanka-to-saudi-arabia/",
    "Summary": "Buddhist and Hindu Priests from Sri Lanka made their first-ever visit to Saudi Arabia upon an invitation from Sheikh Dr. Mohammad bin Abdulkarim Al-Issa, Secretary General of the Muslim World League. The visit was for their participation in a forum titled \"Promoting Moderation and Rejecting Extremism.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka Mission in Maldives organises a blood donation to mark Vesak",
    "Date": "17.05.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-mission-in-maldives-organises-blood-donation-to-mark-vesak/",
    "Summary": "The Sri Lanka High Commission in Maldives organized a blood donation program on 14 May 2022 to commemorate Vesak. This initiative marked the first-ever blood donation drive undertaken by the Sri Lankan mission in Maldives.",
    "Category": "Mission News"
  },
  {
    "Title": "​Commemoration of the International day of Vesak in New York",
    "Date": "16.05.2022",
    "Link": "https://mfa.gov.lk/en/%e2%80%8bcommemoration-of-the-international-day-of-vesak-in-new-york/",
    "Summary": "The Permanent Missions of Sri Lanka and Thailand co-hosted a virtual commemoration of the International Day of Vesak on May 13, 2022, at the United Nations in New York. This event, sponsored by Sri Lanka and Thailand in 1999, celebrated the significance of Vesak internationally.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka Embassy in Lebanon & Syria celebrates Vesak",
    "Date": "16.05.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-embassy-in-lebanon-syria-celebrates-vesak/",
    "Summary": "The Sri Lanka Embassy in Lebanon & Syria celebrated Vesak on 15 May 2022 with Sri Lankans, Lebanese, and Syrians in attendance. The highlight of the Vesak 2022 celebration was the unveiling of a special event at the Embassy premises.",
    "Category": "Mission News"
  },
  {
    "Title": "Talent Show – 2022 in Lebanon",
    "Date": "09.05.2022",
    "Link": "https://mfa.gov.lk/en/talent-show-2022-in-lebanon/",
    "Summary": "The Embassy of Sri Lanka, in collaboration with the Rathnadeepa International Migrant Board, organized a Talent Show and Bazaar in Lebanon for May Day as part of the Public Diplomacy Community welfare program. The event aimed to showcase the talents of Sri Lankan migrants residing in Lebanon.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka’s Ambassador – designate to Myanmar assumes duties",
    "Date": "06.05.2022",
    "Link": "https://mfa.gov.lk/en/sri-lankas-ambassador-designate-to-myanmar-assumes-duties/",
    "Summary": "Sri Lanka's newly appointed Ambassador-designate to Myanmar, J.M. Janaka Priyantha Bandara, assumed duties at the Sri Lanka Embassy in Yangon on May 2, 2022. He addressed the embassy staff upon assuming office.",
    "Category": "Mission News"
  },
  {
    "Title": "Establishment of Diplomatic Relations between the Democratic Socialist Republic of Sri Lanka and the Democratic Republic of Timor-Leste.",
    "Date": "06.05.2022",
    "Link": "https://mfa.gov.lk/en/establishment-of-diplomatic-relations-between-the-democratic-socialist-republic-of-sri-lanka-and-the-democratic-republic-of-timor-leste/",
    "Summary": "Today, on May 4, 2022, the Democratic Socialist Republic of Sri Lanka and the Democratic Republic of Timor-Leste officially established diplomatic relations through the signing ceremony of the Joint Communiqué. The event took place at the Pe.",
    "Category": "Mission News"
  },
  {
    "Title": "​Bangladesh donates medical supplies to Sri Lanka",
    "Date": "06.05.2022",
    "Link": "https://mfa.gov.lk/en/%e2%80%8bbangladesh-donates-medical-supplies-to-sri-lanka/",
    "Summary": "Bangladesh donated medical supplies to Sri Lanka in response to a request from the Sri Lankan Government. The donation took place at a ceremony held at the State Guest House Padma in Dhaka on May 5, 2022.",
    "Category": "Mission News"
  },
  {
    "Title": "The Government of Indonesia donates medical supplies",
    "Date": "05.05.2022",
    "Link": "https://mfa.gov.lk/en/the-government-of-indonesia-donates-medical-supplies/",
    "Summary": "The Indonesian Government donated 11 types of medicines and 8 types of medical devices to Sri Lanka in response to a humanitarian aid request. This donation aims to provide essential medical supplies to the people of Sri Lanka.",
    "Category": "Mission News"
  },
  {
    "Title": "The President of the National Assembly and Speaker of the House of Representatives of the Kingdom of Thailand Chuan Leekpai hands over 700,000 Thai Baht to Sri Lanka",
    "Date": "05.05.2022",
    "Link": "https://mfa.gov.lk/en/the-president-of-the-national-assembly-and-speaker-of-the-house-of-representatives-of-the-kingdom-of-thailand-chuan-leekpai-hands-over-700000-thai-baht-to-sri-lanka/",
    "Summary": "Chuan Leekpai, President of the National Assembly and Speaker of the House of Representatives of Thailand, handed over a 700,000 Thai Baht cheque to the Sri Lankan Ambassador in a gesture of support. The donation aims to assist Sri Lanka in addressing its current challenges.",
    "Category": "Mission News"
  },
  {
    "Title": "Assistant High Commissioner (Protection) of UNHCR and the delegation meets the Deputy High Commissioner of Sri Lanka in Chennai",
    "Date": "05.05.2022",
    "Link": "https://mfa.gov.lk/en/assistant-high-commissioner-protection-of-unhcr-and-the-delegation-meets-the-deputy-high-commissioner-of-sri-lanka-in-chennai/",
    "Summary": "The Assistant High Commissioner (Protection) of UNHCR, Gillian Triggs, led a delegation that met with Dr. D. Venkateshwaran, the Deputy High Commissioner of Sri Lanka in Chennai.",
    "Category": "Mission News"
  },
  {
    "Title": "Investment Opportunities of the Port City Colombo presented in London",
    "Date": "05.05.2022",
    "Link": "https://mfa.gov.lk/en/investment-opportunities-of-the-port-city-colombo-presented-in-london-2/",
    "Summary": "The Sri Lanka High Commission in London, in collaboration with CHEC Port City Colombo (Pvt) Ltd and the Commonwealth Enterprise and Investment Council, hosted a presentation on investment opportunities in education and finance. The event aimed to showcase the potential for investment in the Port City Colombo project.",
    "Category": "Mission News"
  },
  {
    "Title": "Ambassador Dr Palitha Kohona Presents His Letter of Credence to  The President of Mongolia",
    "Date": "04.05.2022",
    "Link": "https://mfa.gov.lk/en/ambassador-dr-palitha-kohona-presents-his-letter-of-credence-to-the-president-of-mongolia/",
    "Summary": "Ambassador Dr. Palitha Kohona, who serves as the Ambassador to Mongolia, presented his Letter of Credence to President Khurelsukh Ukhnaa on April 27, 2022. The ceremony marked the official accreditation of Ambassador Kohona to Mongolia.",
    "Category": "Mission News"
  },
  {
    "Title": "The Sri Lanka Embassy in Beirut conducts internship on diplomacy",
    "Date": "04.05.2022",
    "Link": "https://mfa.gov.lk/en/the-sri-lanka-embassy-in-beirut-conducts-internship-on-diplomacy/",
    "Summary": "The Sri Lanka Embassy in Beirut conducted an internship focusing on languages, diplomacy, sworn translations, digital citizenship, and dress code. The program aimed to provide valuable insights into the field of diplomacy for participants.",
    "Category": "Mission News"
  },
  {
    "Title": "The first Sri Lanka Tea Shop and Cultural Centre Opened in Beijing",
    "Date": "27.04.2022",
    "Link": "https://mfa.gov.lk/en/the-first-sri-lanka-tea-shop-and-cultural-centre-opened-in-beijing/",
    "Summary": "The Embassy of Sri Lanka in Beijing, in partnership with the China Sri Lanka Association for Trade and Economic Cooperation (CSLATE) and the Beijing Wanhongtai Technology Group Co., Ltd., inaugurated the first Sri Lanka Tea Shop and Cultural Centre in Beijing. This initiative aims to promote Sri Lankan tea and culture in China, fostering closer ties between the two nations.",
    "Category": "Mission News"
  },
  {
    "Title": "Air Chief Marshal Sumangala Dias presents Credentials to His Majesty the King of Malaysia",
    "Date": "27.04.2022",
    "Link": "https://mfa.gov.lk/en/air-chief-marshal-sumangala-dias-presents-credentials-to-his-majesty-the-king-of-malaysia/",
    "Summary": "Air Chief Marshal Dabare Liyanage Sumangala Dias, the High Commissioner, presented his Credentials to His Majesty the King of Malaysia, Yang di-Pertuan Agong Al-Sultan Abdullah Ri'ayatuddin Al-Mustafa Billah Shah Ibni Almarhum Sultan H. This formal ceremony solidifies the diplomatic relationship between Sri Lanka and Malaysia.",
    "Category": "Mission News"
  },
  {
    "Title": "New Honorary Consul of Sri Lanka in Tyrol appointed",
    "Date": "26.04.2022",
    "Link": "https://mfa.gov.lk/en/new-honorary-consul-of-sri-lanka-in-tyrol-appointed/",
    "Summary": "Ambassador Majintha Jayesinghe appointed Dr. Christian Steppan as the new Honorary Consul of Sri Lanka in Tyrol, Austria. Dr. Steppan received the Commission of Appointment for this role.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka represented at the 4th Asia Pacific Water Summit",
    "Date": "26.04.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-represented-at-the-4th-asia-pacific-water-summit/",
    "Summary": "Sri Lanka was represented at the 4th Asia Pacific Water Summit, which opened on April 23, 2022, in Kumamoto City. The summit saw the participation of high-level delegations from various Asia-Pacific countries and representatives of international organizations.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka Coconut kernel products promoted in Belgium",
    "Date": "26.04.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-coconut-kernel-products-promoted-in-belgium/",
    "Summary": "The Embassy of Sri Lanka in Brussels organized a workshop titled “COCONUT WONDER - Truly Sri Lankan” on April 21, 2022, to boost the export of Sri Lankan coconut kernel products to Belgium. The event aimed to promote these products and enhance trade relations between the two countries.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lankan Drama “Love and Lockdown” staged at 23 Sabancı Adana  International Theater Festival",
    "Date": "22.04.2022",
    "Link": "https://mfa.gov.lk/en/sri-lankan-drama-love-and-lockdown-staged-at-23-sabanci-adana-international-theater-festival/",
    "Summary": "Sri Lanka's Inter Act Art Theatre Institute performed their monodrama \"Love & Lockdown\" at the 23rd Sabancı Adana International Theater Festival, following an invitation from the State Theatres Directorate General of Turkey.",
    "Category": "Mission News"
  },
  {
    "Title": "The Embassy of Sri Lanka in Abu Dhabi celebrates Sinhala and Tamil New Year with the Sri Lankan community",
    "Date": "22.04.2022",
    "Link": "https://mfa.gov.lk/en/the-embassy-of-sri-lanka-in-abu-dhabi-celebrates-sinhala-and-tamil-new-year-with-the-sri-lankan-community/",
    "Summary": "The Embassy of Sri Lanka in Abu Dhabi, along with the Dhamma School and the Sri Lankan Community, celebrated Sinhala and Tamil New Year with children under the theme of 'හෙළ සූර්ය මංගල'. The event aimed to bring together the Sri Lankan community in Abu Dhabi for a joyous cultural celebration.",
    "Category": "Mission News"
  },
  {
    "Title": "The Embassy of Sri Lanka in Beijing Celebrates the National New Year Day",
    "Date": "21.04.2022",
    "Link": "https://mfa.gov.lk/en/the-embassy-of-sri-lanka-in-beijing-celebrates-the-national-new-year-day/",
    "Summary": "The Embassy of Sri Lanka in Beijing celebrated the National New Year on April 17, 2022, following customs and traditions. The event was attended by over 150 invitees, including Ambassadors and representatives from Diplomatic Missions. It was a festive occasion that brought together a diverse group to mark the special day.",
    "Category": "Mission News"
  },
  {
    "Title": "Business contacts and orders for Sri Lankan companies at ANUFOOD Brazil exhibition",
    "Date": "20.04.2022",
    "Link": "https://mfa.gov.lk/en/business-contacts-and-orders-for-sri-lankan-companies-at-anufood-brazil-exhibition/",
    "Summary": "Several Sri Lankan tea exporters, including M/S. Imperial Tea (Pvt) Ltd, M/S Maltras International (Pvt) Ltd, M/S Basilure Teas (Pvt) Ltd, and M/S Tea Talk (Pvt) Ltd, participated in the ANUFOOD Brazil 2022 exhibition. They established valuable business contacts and received orders during the event, showcasing the potential for growth in the Sri Lankan tea industry.",
    "Category": "Mission News"
  },
  {
    "Title": "Colombo Plan scholars visit Sri Lanka High Commission in Canberra",
    "Date": "20.04.2022",
    "Link": "https://mfa.gov.lk/en/colombo-plan-scholars-visit-sri-lanka-high-commission-in-canberra/",
    "Summary": "Colombo Plan scholars visiting Sri Lanka High Commission in Canberra were welcomed at an event on April 14, 2022. They will pursue studies in Sri Lanka under the New Colombo Plan Programme.",
    "Category": "Mission News"
  },
  {
    "Title": "Prospects for exporting more gems & jewellery from Sri Lanka to Southern China",
    "Date": "19.04.2022",
    "Link": "https://mfa.gov.lk/en/prospects-for-exporting-more-gems-jewellery-from-sri-lanka-to-southern-china/",
    "Summary": "The Sri Lanka Export Development Board, in collaboration with the Consulate General of Sri Lanka in Guangzhou, arranged virtual B2B meetings on April 6 and 7, 2022, connecting five prominent Sri Lankan gem and jewelry businesses with potential partners in Southern China. This initiative aims to enhance opportunities for exporting gems and jewelry from Sri Lanka to the Southern Chinese market.",
    "Category": "Mission News"
  },
  {
    "Title": "Bangladesh and Sri Lanka explore new investments and Blue economy potential",
    "Date": "19.04.2022",
    "Link": "https://mfa.gov.lk/en/bangladesh-and-sri-lanka-explore-new-investments-and-blue-economy-potential/",
    "Summary": "Bangladesh and Sri Lanka are exploring new investments and the potential of the Blue economy. High Commissioner Professor Sudharshan Seneviratne emphasized the importance of both countries working together to achieve mutual benefits in various investment areas.",
    "Category": "Mission News"
  },
  {
    "Title": "“Ramadan Kareem – Harmony without Boundaries”  The Embassy of Sri Lanka in Abu Dhabi Celebrates Ramadan",
    "Date": "19.04.2022",
    "Link": "https://mfa.gov.lk/en/ramadan-kareem-harmony-without-boundaries-the-embassy-of-sri-lanka-in-abu-dhabi-celebrates-ramadan/",
    "Summary": "The Embassy of Sri Lanka in Abu Dhabi, UAE, celebrated Ramadan by hosting an 'Iftar' for Sri Lankan Muslims living in the country. The event aimed to promote harmony and unity among the Sri Lankan community during the holy month.",
    "Category": "Mission News"
  },
  {
    "Title": "Tourism Promotion Partnership Event-2022 held in Iran",
    "Date": "19.04.2022",
    "Link": "https://mfa.gov.lk/en/tourism-promotion-partnership-event-2022-held-in-iran/",
    "Summary": "The Embassy of Sri Lanka in Iran recently hosted the Tourism Promotion Partnership Event-2022 at its Chancery premises in Tehran on April 6, 2022. The event, supported by the Sri Lanka Tourism Promotion Bureau and Associations, aimed to boost tourism collaboration between the two countries.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lankan New Year Celebrated in Karachi",
    "Date": "18.04.2022",
    "Link": "https://mfa.gov.lk/en/sri-lankan-new-year-celebrated-in-karachi/",
    "Summary": "The Sri Lanka Consulate in Karachi and the Sri Lanka Community in Sindh & Balochistan provinces celebrated the Sinhala & Tamil New Year at the IQRA University premises in Karachi on Saturday, April 2. The event marked a joyous celebration of the New Year traditions in Pakistan.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka Embassy in Jordan organizes an Arabica Coffee Awareness Promotion",
    "Date": "11.04.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-embassy-in-jordan-organizes-an-arabica-coffee-awareness-promotion/",
    "Summary": "The Sri Lanka Embassy in Jordan hosted a workshop to promote high-quality Sri Lankan Arabica coffee among Jordanian coffee importers and shop owners. The event aimed to raise awareness and appreciation for Sri Lankan Arabica coffee in Jordan's market.",
    "Category": "Mission News"
  },
  {
    "Title": "Bangladesh corporate sector ready to expand economic cooperation  with Sri Lanka",
    "Date": "06.04.2022",
    "Link": "https://mfa.gov.lk/en/bangladesh-corporate-sector-ready-to-expand-economic-cooperation-with-sri-lanka/",
    "Summary": "The Sri Lanka High Commissioner to Bangladesh highlighted the strong historical and cultural ties between the two countries, emphasizing the need to enhance economic cooperation. Bangladesh's corporate sector is poised to expand collaboration with Sri Lanka, paving the way for increased mutual benefits and growth opportunities.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka Trade Minister Concludes Fruitful Bilateral Visit to Oman",
    "Date": "06.04.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-trade-minister-concludes-fruitful-bilateral-visit-to-oman/",
    "Summary": "Sri Lanka's Trade Minister Dr. Bandula Gunawardhana led a five-member delegation on a successful bilateral trade visit to Oman from March 27 to 28, 2022. The visit, organized by the Sri Lanka Embassy in Oman, aimed to strengthen trade relations between the two countries.",
    "Category": "Mission News"
  },
  {
    "Title": "127 Birth Certificates, 315 Citizenship Certificates and 34 Refugee Repatriation Programme (RRP) Passports issued by the Sri Lanka Deputy High Commission in Chennai",
    "Date": "04.04.2022",
    "Link": "https://mfa.gov.lk/en/127-birth-certificates-315-citizenship-certificates-and-34-refugee-repatriation-programme-rrp-passports-issued-by-the-sri-lanka-deputy-high-commission-in-chennai/",
    "Summary": "The Sri Lanka Deputy High Commission in Chennai issued 127 Birth Certificates, 315 Citizenship Certificates, and 34 Refugee Repatriation Programme (RRP) Passports at three special consular camps. These documents were provided to individuals during the organized events.",
    "Category": "Mission News"
  },
  {
    "Title": "Enhancing Collaboration between Sri Lanka and the Philippines through Technical Cooperation",
    "Date": "04.04.2022",
    "Link": "https://mfa.gov.lk/en/enhancing-collaboration-between-sri-lanka-and-the-philippines-through-technical-cooperation/",
    "Summary": "Sri Lanka and the Philippines are enhancing collaboration through technical cooperation. The Department of Foreign Affairs - Technical Cooperation Council of the Philippines (DFA-TCCP) is working with the Department of Agriculture-Philippine Rice Research Institute (PhilRice) and the Embassy of Sri Lanka to facilitate this partnership.",
    "Category": "Mission News"
  },
  {
    "Title": "“Hello Again” – High Commission of Sri Lanka in Malaysia organizes Sri Lanka Tourism Promotional Event",
    "Date": "01.04.2022",
    "Link": "https://mfa.gov.lk/en/hello-again-high-commission-of-sri-lanka-in-malaysia-organizes-sri-lanka-tourism-promotional-event/",
    "Summary": "The High Commission of Sri Lanka in Malaysia recently organized a tourism promotional event to raise awareness among tour operators for the year 2022. Starting from April 1, 2022, Malaysia will be opening its borders to tourists. This event aimed to boost tourism between the two countries.",
    "Category": "Mission News"
  },
  {
    "Title": "The President of the Asian Infrastructure Investment Bank (AIIB), encourages Sri Lanka to consult the IMF on the current economic challenges",
    "Date": "01.04.2022",
    "Link": "https://mfa.gov.lk/en/the-president-of-the-asian-infrastructure-investment-bank-aiib-encourages-sri-lanka-to-consult-the-imf-on-the-current-economic-challenges/",
    "Summary": "The President of the Asian Infrastructure Investment Bank (AIIB), Jin Liqun, advised Sri Lanka to seek guidance from the IMF regarding its current economic challenges. He shared this recommendation during a meeting with the Sri Lankan Ambassador.",
    "Category": "Mission News"
  },
  {
    "Title": "China – Sri Lanka Association for Trade & Economic Cooperation (CSLATE) Signs Three MOUs to Promote Business Cooperation",
    "Date": "01.04.2022",
    "Link": "https://mfa.gov.lk/en/china-sri-lanka-association-for-trade-economic-cooperation-cslate-signs-three-mous-to-promote-business-cooperation/",
    "Summary": "The China - Sri Lanka Association for Trade & Economic Cooperation (CSLATE) signed three MOUs with the CZK International Investment Group, the Hunan Construction Engineering Group, and the China Light Industry Jewe to promote business cooperation.",
    "Category": "Mission News"
  },
  {
    "Title": "Appointing New Honorary Consul to Ho Chi Minh City, Viet Nam",
    "Date": "29.03.2022",
    "Link": "https://mfa.gov.lk/en/appointing-new-honorary-consul-to-ho-chi-minh-city-viet-nam/",
    "Summary": "The Government of Sri Lanka has appointed Shirley Marguerite Hopman-Aluwihare as the Honorary Consul of Sri Lanka in Ho Chi Minh City, Vietnam. She received her Exequatur from the Deputy Director-General of the Department. Shirley Marguerite Hopman-Aluwihare is now the official Honorary Consul representing Sri Lanka in Ho Chi Minh City.",
    "Category": "Mission News"
  },
  {
    "Title": "State Minister of Foreign Employment Promotion and Market Diversification Piyankara Jayaratne concludes a successful visit to the Kingdom of Saudi Arabia",
    "Date": "29.03.2022",
    "Link": "https://mfa.gov.lk/en/state-minister-of-foreign-employment-promotion-and-market-diversification-piyankara-jayaratne-concludes-a-successful-visit-to-the-kingdom-of-saudi-arabia/",
    "Summary": "State Minister of Foreign Employment Promotion and Market Diversification Piyankara Jayaratne successfully concluded his official visit to the Kingdom of Saudi Arabia from 19 to 24 March 2022. During the visit, he engaged in discussions and meetings to strengthen bilateral relations between the two countries.",
    "Category": "Mission News"
  },
  {
    "Title": "State Minister for Regional Cooperation Tharaka Balasuriya concludes official visit to KSA",
    "Date": "28.03.2022",
    "Link": "https://mfa.gov.lk/en/state-minister-for-regional-cooperation-tharaka-balasuriya-concludes-official-visit-to-ksa/",
    "Summary": "State Minister for Regional Cooperation Tharaka Balasuriya concluded his official visit to the Kingdom of Saudi Arabia from 19 to 21 March 2022. This visit marks the first-ever bilateral visit at the Foreign Ministry level between the two countries.",
    "Category": "Mission News"
  },
  {
    "Title": "New Generation Technology Company iGreenData in Melbourne recruits thirty-two Sri Lankan Software Engineers",
    "Date": "28.03.2022",
    "Link": "https://mfa.gov.lk/en/new-generation-technology-company-igreendatain-melbourne-recruits-thirty-two-sri-lankan-software-engineers/",
    "Summary": "iGreenData, a technology company in Melbourne, has recruited thirty-two skilled Software Engineers from Sri Lanka to work in Australia. The engineers recently visited the Consulate General of Sri Lanka.",
    "Category": "Mission News"
  },
  {
    "Title": "Ministers Rajapaksa, Jaishankar and Sitharaman witness the signing of the USD 1 billion Indo – Lanka Loan Agreement",
    "Date": "24.03.2022",
    "Link": "https://mfa.gov.lk/en/ministers-rajapaksa-jaishankar-and-sitharaman-witness-the-signing-of-the-usd-1-billion-indo-lanka-loan-agreem/",
    "Summary": "Finance Minister Basil Rajapaksa concluded his two-day official visit to New Delhi by witnessing the signing of a USD 1 billion Indo-Lanka Loan Agreement. The agreement pertains to a Short-Term Concessional Loan facility extended during the visit. This marks a significant financial collaboration between the two countries.",
    "Category": "Mission News"
  },
  {
    "Title": "Finance Minister Basil Rajapaksa holds bilateral talks with the External Affairs Minister of India Dr. S. Jaishankar",
    "Date": "24.03.2022",
    "Link": "https://mfa.gov.lk/en/finance-minister-basil-rajapaksa-holds-bilateral-talks-with-the-external-affairs-minister-of-india-dr-s-jaishankar/",
    "Summary": "Finance Minister Basil Rajapaksa, during his two-day official visit to New Delhi, held bilateral talks with India's External Affairs Minister Dr. S. Jaishankar on the 16th. The talks took place at the Hyderabad House.",
    "Category": "Mission News"
  },
  {
    "Title": "Finance Minister Basil Rajapaksa calls on Prime Minister Narendra Modi",
    "Date": "24.03.2022",
    "Link": "https://mfa.gov.lk/en/finance-minister-basil-rajapaksa-calls-on-prime-minister-narendra-modi/",
    "Summary": "Finance Minister Basil Rajapaksa met with Prime Minister Narendra Modi in New Delhi. During the meeting, PM Modi assured that India will always support Sri Lanka as a close and friendly neighbor.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka participates at “EnviroteQ|AgriteQ 2022” in Doha",
    "Date": "23.03.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-participates-at-enviroteqagriteq-2022-in-doha-2/",
    "Summary": "Sri Lanka participated in \"EnviroteQ|AgriteQ 2022\" in Doha for the first time, showcasing its agricultural products in collaboration with the Export Development Board. The event marked Qatar's 9th International Agriculture Exhibition.",
    "Category": "Mission News"
  },
  {
    "Title": "Ambassador Kananathan presents Credentials in Guinea",
    "Date": "23.03.2022",
    "Link": "https://mfa.gov.lk/en/ambassador-kananathan-presents-credentials-in-guinea/",
    "Summary": "Sri Lanka High Commissioner in Kenya Veluppillai Kananathan presented his Letter of Credence appointing him as the Ambassador of Sri Lanka to Guinea to President of Guinea Mamady Doumbouya. He will reside in Kenya while serving in this new role.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka Ambassador meets the Head of Iran-Sri Lanka Parliamentary Friendship Group",
    "Date": "23.03.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-ambassador-meets-the-head-of-iran-sri-lanka-parliamentary-friendship-group/",
    "Summary": "Sri Lanka Ambassador G.M. Vipulatheja Wishwanath Aponsu met with Abdolnaser Derakhshan, the Head of Iran-Sri Lanka Parliamentary Friendship Group, on March 13, 2022, at the Parliament.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka strengthens agriculture ties with Bangladesh and FAO",
    "Date": "21.03.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-strengthens-agriculture-ties-with-bangladesh-and-fao/",
    "Summary": "Sri Lanka's Minister of Agriculture, Mahindananda Aluthgamage, updated delegates at the Ministerial Session of the 36th FAO Regional Conference for Asia and the Pacific in Dhaka. The discussions focused on strengthening agriculture partnerships between Sri Lanka, Bangladesh, and the FAO.",
    "Category": "Mission News"
  },
  {
    "Title": "Steel Giant Baowu Plans a Billion Dollar Investment in Hambantota",
    "Date": "18.03.2022",
    "Link": "https://mfa.gov.lk/en/steel-giant-baowu-plans-a-billion-dollar-investment-in-hambantota/",
    "Summary": "Steel giant Baowu plans to invest billions in Hambantota, as discussed during a meeting between the Ambassador of Sri Lanka to China, Dr. Palitha Kohona, and Baowu Steel's senior management in Ma’anshan, Anhui. The investment potential in Sri Lanka is being explored by Baowu Steel.",
    "Category": "Mission News"
  },
  {
    "Title": "High Commissioner Moragoda meets India’s Minister of Power and  New & Renewable Energy to discuss further cooperation",
    "Date": "18.03.2022",
    "Link": "https://mfa.gov.lk/en/high-commissioner-moragoda-meets-indias-minister-of-power-and-new-renewable-energy-to-discuss-further-cooperation/",
    "Summary": "Sri Lanka's High Commissioner to India, Milinda Moragoda, met with India's Minister of Power and New & Renewable Energy to discuss enhancing cooperation in the power and renewable energy sector. The meeting aimed to explore opportunities for collaboration between the two countries in these critical areas.",
    "Category": "Mission News"
  },
  {
    "Title": "​High Level Omani Business Delegation Concludes Productive Visit to Sri Lanka",
    "Date": "16.03.2022",
    "Link": "https://mfa.gov.lk/en/%e2%80%8bhigh-level-omani-business-delegation-concludes-productive-visit-to-sri-lanka/",
    "Summary": "A 17-member high-level Omani business delegation from the Oman Chamber of Commerce and Industry (OCCI) recently concluded a productive visit to Sri Lanka. The visit, organized by the Sri Lanka Embassy in Oman from 5 to 9 March 2022, aimed to strengthen economic ties between the two countries.",
    "Category": "Mission News"
  },
  {
    "Title": "​“Ceylon Tea” Showcased at Foodex Japan 2022",
    "Date": "16.03.2022",
    "Link": "https://mfa.gov.lk/en/%e2%80%8bceylon-tea-showcased-at-foodex-japan-2022/",
    "Summary": "The Sri Lanka Embassy in Japan, with the support of the Sri Lanka Tea Board, highlighted \"Ceylon Tea\" at Foodex Japan 2022, the 47th International Food and Beverage Exhibition in Tokyo. The event aimed to promote the renowned Ceylon Tea to a global audience, showcasing its quality and unique flavors.",
    "Category": "Mission News"
  },
  {
    "Title": "Ordination of Rev. Suseela of Austria",
    "Date": "15.03.2022",
    "Link": "https://mfa.gov.lk/en/ordination-of-rev-suseela-of-austria/",
    "Summary": "Rev. Suseela became the first Austrian national to be ordained in Austria on March 6, 2022, at the Dhamma-Zentrum Nyanaponika. The ordination ceremony was conducted by Most Ven. Dr. Wijayarajapura Seelawansa Thero, the founder and Chief Incumbent of the center.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka’s unique traditional products in high demand  at the 55th Diplomatic Red Cross Bazaar in Bangkok, Thailand",
    "Date": "15.03.2022",
    "Link": "https://mfa.gov.lk/en/sri-lankas-unique-traditional-products-in-high-demand-at-the-55th-diplomatic-red-cross-bazaar-in-bangkok-thailand/",
    "Summary": "Sri Lanka's unique traditional products were in high demand at the 55th Diplomatic Red Cross Bazaar in Bangkok, Thailand. The Sri Lanka Embassy in Thailand, along with the Export Development Board, Spice and Allied Product Marketing Board, and the National Craft Council, organized the event to showcase these sought-after products.",
    "Category": "Mission News"
  },
  {
    "Title": "High Commissioner Moragoda meets the Minister of Petroleum & Natural Gas and Housing & Urban Affairs of India to discuss bilateral energy cooperation",
    "Date": "15.03.2022",
    "Link": "https://mfa.gov.lk/en/high-commissioner-moragoda-meets-the-minister-of-petroleum-natural-gas-and-housing-urban-affairs-of-india-to-discuss-bilateral-energy-cooperation/",
    "Summary": "High Commissioner of Sri Lanka to India, Milinda Moragoda, met with India's Minister of Petroleum & Natural Gas and Housing & Urban Affairs, Shri Hardeep Singh Puri, on March 10 to discuss bilateral energy cooperation. The meeting took place at the Ministry of Urban Affairs, focusing on strengthening ties between the two countries in the energy sector.",
    "Category": "Mission News"
  },
  {
    "Title": "Officials of the Sri Lanka Deputy High Commission of Chennai discuss possible Agricultural Collaborations with MSSRF",
    "Date": "11.03.2022",
    "Link": "https://mfa.gov.lk/en/officials-of-the-sri-lanka-deputy-high-commission-of-chennai-discuss-possible-agricultural-collaborations-with-mssrf/",
    "Summary": "Officials from the Sri Lanka Deputy High Commission in Chennai, led by Deputy High Commissioner Dr. D. Venkateshwaran, held discussions with Professor M. S. Swaminathan at the M. S. Swaminathan Research Foundation (MSSRF) in Chennai regarding potential agricultural collaborations. The meeting aimed to explore opportunities for cooperation between the two entities in the agricultural sector.",
    "Category": "Mission News"
  },
  {
    "Title": "Ambassador Asirwatham discusses Sri Lanka tourism promotion   in the Walloon region with Governor of Namur in Belgium",
    "Date": "11.03.2022",
    "Link": "https://mfa.gov.lk/en/ambassador-asirwatham-discusses-sri-lanka-tourism-promotion-in-the-walloon-region-with-governor-of-namur-in-belgium/",
    "Summary": "Ambassador of Sri Lanka to Belgium, Grace Asirwatham, discussed Sri Lanka's tourism promotion in the Walloon region with Denis Mathen, the Governor of Namur Province in Belgium. The meeting took place on 8th March 2022 at the Governor's Residence in Namur, the capital of the French-speaking Walloon region. This meeting aimed to strengthen ties and explore opportunities for promoting tourism between the two regions.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka attracts visitors at Travel EXPO Ankara",
    "Date": "11.03.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-attracts-visitors-at-travel-expo-ankara/",
    "Summary": "The Embassy of Sri Lanka in Ankara, Turkey, along with the Sri Lanka Tourism Promotion Bureau, participated in the 5th edition of Travel EXPO Ankara. The travel trade fair took place from March 3 to 6, attracting visitors interested in exploring Sri Lanka's tourism offerings.",
    "Category": "Mission News"
  },
  {
    "Title": "Assumption of duty of new Consul General of Sri Lanka in Jeddah",
    "Date": "11.03.2022",
    "Link": "https://mfa.gov.lk/en/assumption-of-duty-of-new-consul-general-of-sri-lanka-in-jeddah/",
    "Summary": "S.M. Falah Alhabshi Mowlana has officially assumed the role of Consul General of Sri Lanka in Jeddah, Saudi Arabia. The ceremony marking the beginning of his duties took place on March 1, 2022.",
    "Category": "Mission News"
  },
  {
    "Title": "Minister of Higher Education, Science, Research and Innovation of Thailand Prof. Dr. Anek Laothamatas assures Sri Lanka’s envoy to accelerate bilateral cooperation",
    "Date": "11.03.2022",
    "Link": "https://mfa.gov.lk/en/minister-of-higher-education-science-research-and-innovation-of-thailand-prof-dr-anek-laothamatas-assures-sri-lankas-envoy-to-accelerate-bilateral-cooperation/",
    "Summary": "Minister of Higher Education, Science, Research and Innovation of Thailand, Prof. Dr. Anek Laothamatas, assured Sri Lanka's envoy of accelerating bilateral cooperation. The Ambassador of Sri Lanka to Thailand, C.A. Chaminda I. Colonne, met with the Minister to discuss enhancing collaboration between the two countries.",
    "Category": "Mission News"
  },
  {
    "Title": "Ambassador Manori Unambuwe Presents Credentials to   President Zoran Milanović of the Republic of Croatia",
    "Date": "11.03.2022",
    "Link": "https://mfa.gov.lk/en/ambassador-manori-unambuwe-presents-credentials-to-president-zoran-milanovic-of-the-republic-of-croatia/",
    "Summary": "Ambassador Manori Unambuwe, who serves as the Ambassador of Sri Lanka in Germany and is concurrently accredited as the Ambassador to the Republic of Croatia, presented her credentials to President Zoran Milanović on 3 March 2022 at a ceremony held at the O. This formal event marked the official recognition of her role as the Ambassador to Croatia.",
    "Category": "Mission News"
  },
  {
    "Title": "Consul General of Sri Lanka in Shanghai meets with Deputy Director of the Shanghai Foreign Affairs Office",
    "Date": "10.03.2022",
    "Link": "https://mfa.gov.lk/en/consul-general-of-sri-lanka-in-shanghai-meets-with-deputy-director-of-the-shanghai-foreign-affairs-office/",
    "Summary": "Consul General Anura Fernando met with Deputy Director General Fu Jihong at the Shanghai Foreign Affairs Office in China on February 23, 2022. The meeting took place in commemoration of the 65th anniversary of the establishment of diplomatic relations between Sri Lanka and China.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lankan Batik promoted in Melbourne coinciding with  International Women’s Day 2022",
    "Date": "09.03.2022",
    "Link": "https://mfa.gov.lk/en/sri-lankan-batik-promoted-in-melbourne-coinciding-with-international-womens-day-2022/",
    "Summary": "Sri Lankan Batik was promoted in Melbourne to coincide with International Women’s Day 2022. The Consulate General of Sri Lanka in Melbourne, in collaboration with the Committee for Sri Lanka (CFSL), the South Asian Australia Alliance, and the Australia Sri Lanka Business Council, organized a photo shoot to showcase the traditional craft.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka Tourism promotional booth at the VFS center, Jeddah",
    "Date": "09.03.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-tourism-promotional-booth-at-the-vfs-center-jeddah/",
    "Summary": "Ambassador of Sri Lanka to the Kingdom of Saudi Arabia, Pakeer Mohideen Amza, inaugurated a Sri Lanka Tourism promotional booth at the VFS Visa Application Center in Jeddah on March 1, 2022. The booth aims to showcase Sri Lanka's tourism offerings to visitors in Saudi Arabia.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka extends warm welcome to Maldivians and other foreigners  with easing of travel restrictions",
    "Date": "08.03.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-extends-warm-welcome-to-maldivians-and-other-foreigners-with-easing-of-travel-restrictions/",
    "Summary": "Sri Lanka has extended a warm welcome to Maldivians and other foreigners by easing travel restrictions, including lifting mandatory PCR tests for travelers. The High Commissioner of Sri Lanka to Maldives, A.M.J. Sadiq, emphasized the convenience of these changes during the reopening of travel.",
    "Category": "Mission News"
  },
  {
    "Title": "Continuing the dialogue with major religions in India, Sri Lanka High Commission in New Delhi presents a Sinhala translation of the Holy Quran to the Jamiat Ulama-i-Hind",
    "Date": "08.03.2022",
    "Link": "https://mfa.gov.lk/en/continuing-the-dialogue-with-major-religions-in-india-sri-lanka-high-commission-in-new-delhi-presents-a-sinhala-translation-of-the-holy-quran-to-the-jamiat-ulama-i-hind/",
    "Summary": "In an effort to foster dialogue with major religions in India, the Sri Lanka High Commission in New Delhi recently presented a Sinhala translation of the Holy Quran to the Jamiat Ulama-i-Hind on February 28, 2022. This gesture aims to promote understanding and cultural exchange between communities.",
    "Category": "Mission News"
  },
  {
    "Title": "“Expanding Ceylon Tea Market in Iran and Neighbouring Countries”",
    "Date": "07.03.2022",
    "Link": "https://mfa.gov.lk/en/expanding-ceylon-tea-market-in-iran-and-neighbouring-countries/",
    "Summary": "The Sri Lanka Embassy in Tehran, in collaboration with the Tea Association of Iran, Tea Exporters Association of Sri Lanka, and Sri Lanka Tea Board, organized a discussion on expanding the Ceylon tea market in Iran and neighboring countries. This initiative aims to promote Ceylon tea and strengthen its presence in the region, fostering trade relations and market growth.",
    "Category": "Mission News"
  },
  {
    "Title": "​The Embassy of Sri Lanka in Moscow facilitates a meeting between a Business Delegation from Sri Lanka and the Moscow Chamber of Commerce and Industry",
    "Date": "07.03.2022",
    "Link": "https://mfa.gov.lk/en/%e2%80%8bthe-embassy-of-sri-lanka-in-moscow-facilitates-a-meeting-between-a-business-delegation-from-sri-lanka-and-the-moscow-chamber-of-commerce-and-industry/",
    "Summary": "The Embassy of Sri Lanka in Moscow organized a meeting on February 9, 2022, between a Sri Lankan business delegation and the Moscow Chamber of Commerce and Industry, as well as members of the Russian business community. The meeting aimed to foster collaboration and strengthen ties between the two countries.",
    "Category": "Mission News"
  },
  {
    "Title": "​Pirith Ceremony to Commemorate the 65th of Anniversary of Diplomatic Relations  between Sri Lanka and China",
    "Date": "07.03.2022",
    "Link": "https://mfa.gov.lk/en/%e2%80%8bpirith-ceremony-to-commemorate-the-65th-of-anniversary-of-diplomatic-relations-between-sri-lanka-and-china/",
    "Summary": "To commemorate the 65th anniversary of diplomatic relations between Sri Lanka and China, the Sri Lanka-China Buddhist Friendship Association, in collaboration with the Buddhist Association of China, conducted a Pirith Ceremony.",
    "Category": "Mission News"
  },
  {
    "Title": "​The Embassy of Sri Lanka in Beijing and the Chongqing Huayan Culture and Education Foundational International Exchange Center of China explore avenues to strengthen cooperation",
    "Date": "07.03.2022",
    "Link": "https://mfa.gov.lk/en/%e2%80%8bthe-embassy-of-sri-lanka-in-beijing-and-the-chongqing-huayan-culture-and-education-foundational-international-exchange-center-of-china-explore-avenues-to-strengthen-cooperation/",
    "Summary": "The Embassy of Sri Lanka in Beijing and the Chongqing Huayan Culture and Education Foundational International Exchange Center of China are exploring ways to enhance cooperation. This initiative coincides with the 65th anniversary of diplomatic relations and the 70th anniversary of the Rubber-Rice Pact, fostering stronger ties between the two countries.",
    "Category": "Mission News"
  },
  {
    "Title": "Embassy of Sri Lanka in Jakarta organizes a Webinar on Reviving the Legacy of Sri Lanka- Indonesia Historical Relations",
    "Date": "07.03.2022",
    "Link": "https://mfa.gov.lk/en/embassy-of-sri-lanka-in-jakarta-organizes-a-webinar-on-reviving-the-legacy-of-sri-lanka-indonesia-historical-relations/",
    "Summary": "The Embassy of Sri Lanka in Indonesia, along with the University of Kelaniya and the University of Indonesia, organized a webinar on reviving the legacy of Sri Lanka-Indonesia historical relations on February 24, 2022. The event aimed to explore and strengthen the historical ties between the two countries.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka Participates in “Foodex Saudi 2022” Exhibition",
    "Date": "07.03.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-participates-in-foodex-saudi-2022-exhibition/",
    "Summary": "Sri Lanka participated in the \"Foodex Saudi 2022\" exhibition, organized by the Embassy of Sri Lanka in Riyadh and the Consulate General of Sri Lanka in Jeddah in collaboration with the Sri Lanka Tea Board (SLTB). The event showcased Sri Lanka's presence in Saudi Arabia's international food and beverage industry.",
    "Category": "Mission News"
  },
  {
    "Title": "​High Commissioner Moragoda meets Head of the RSS",
    "Date": "07.03.2022",
    "Link": "https://mfa.gov.lk/en/%e2%80%8bhigh-commissioner-moragoda-meets-head-of-the-rss/",
    "Summary": "Sri Lankan High Commissioner to India, Milinda Moragoda, met with the Chief of the Rashtriya Swayamsevak Sangh (RSS), Shri Mohan Bhagwat, on February 24, 2022, at the RSS Headquarters in Na.",
    "Category": "Mission News"
  },
  {
    "Title": "First-ever High Level Omani Business Delegation set to visit Sri Lanka",
    "Date": "04.03.2022",
    "Link": "https://mfa.gov.lk/en/first-ever-high-level-omani-business-delegation-set-to-visit-sri-lanka/",
    "Summary": "The Embassy of Sri Lanka in Oman has arranged the first-ever high-level visit of a 17-member Omani business delegation from the Oman Chamber of Commerce and Industry (OCCI). The delegation is led by Eng. Redha Bin Juma Al Saleh, Chairman of OCCI. This visit aims to strengthen business ties between Oman and Sri Lanka.",
    "Category": "Mission News"
  },
  {
    "Title": "​Ambassador Majintha Jayesinghe presents Letter of Credence in Czech Republic",
    "Date": "03.03.2022",
    "Link": "https://mfa.gov.lk/en/%e2%80%8bambassador-majintha-jayesinghe-presents-letter-of-credence-in-czech-republic/",
    "Summary": "Ambassador Majintha Jayesinghe presented the Letter of Credence to President Miloš Zeman of the Czech Republic at Prague Castle, accrediting as the Ambassador Extraordinary and Plenipotentiary of Sri Lanka. This formalized Jayesinghe's role as Sri Lanka's ambassador to the Czech Republic.",
    "Category": "Mission News"
  },
  {
    "Title": "Consul General of Sri Lanka in Mumbai pays a Courtesy Call on the Governor of Maharashtra",
    "Date": "28.02.2022",
    "Link": "https://mfa.gov.lk/en/consul-general-of-sri-lanka-in-mumbai-pays-a-courtesy-call-on-the-governor-of-maharashtra/",
    "Summary": "Consul General of Sri Lanka in Mumbai, Dr. Valsan Vethody, along with his wife Anitha Vethody, visited the Governor of Maharashtra, Bhagat Singh Koshyari, at the Raj Bhavan, his official residence. The visit was a courtesy call to strengthen diplomatic ties between Sri Lanka and Maharashtra.",
    "Category": "Mission News"
  },
  {
    "Title": "IMPA holds hands with Sri Lanka in Business & Investment Collaborations",
    "Date": "25.02.2022",
    "Link": "https://mfa.gov.lk/en/impa-holds-hands-with-sri-lanka-in-business-investment-collaborations/",
    "Summary": "The International Mudaliar and Pillaimar Association (IMPA), a non-profit organization based in Southern India with over 25,000 members globally, is collaborating with Sri Lanka in business and investment ventures. IMPA comprises respected business owners and aims to strengthen partnerships for mutual growth and development.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka Mission in Japan Organizes an Online Webinar with United Nations Industrial Development Organization (UNIDO) and the B. O. I.",
    "Date": "25.02.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-mission-in-japan-organizes-an-online-webinar-with-united-nations-industrial-development-organization-unido-and-the-b-o-i/",
    "Summary": "The Embassy of Sri Lanka in Japan hosted an online webinar with over 80 Japanese companies, featuring the United Nations Industrial Development Organization (UNIDO) and the B.O.I. Ambassador Sanjiv Gunasekara emphasized investment synergies between Sri Lanka and Japan during the event.",
    "Category": "Mission News"
  },
  {
    "Title": "Embassy of Sri Lanka Reaches Out to Brazilian Public to Promote Sri Lankan Trade and Tourism in Brazil",
    "Date": "24.02.2022",
    "Link": "https://mfa.gov.lk/en/embassy-of-sri-lanka-reaches-out-to-brazilian-public-to-promote-sri-lankan-trade-and-tourism-in-brazil/",
    "Summary": "The Embassy of Sri Lanka in Brazil partnered with the Pátio Brasil Shopping chain to host a promotional event for Sri Lankan trade and tourism at the Pátio Brasil Shopping Mall in Brasilia. This event aimed to reach out to the Brazilian public and boost awareness about Sri Lanka's offerings in trade and tourism.",
    "Category": "Mission News"
  },
  {
    "Title": "The Ambassador of Sri Lanka to Italy Jagath Wellawatte Presents Credentials to the President of the Italian Republic Sergio Mattarella",
    "Date": "24.02.2022",
    "Link": "https://mfa.gov.lk/en/the-ambassador-of-sri-lanka-to-italy-jagath-wellawatte-presents-credentials-to-the-president-of-the-italian-republic-sergio-mattarella/",
    "Summary": "Ambassador Jagath Wellawatte of Sri Lanka presented his Letters of Credence to Italian President Sergio Mattarella at the Palazzo del Quirinale in Rome on February 18, 2022. The ceremony marked the official beginning of Ambassador Wellawatte's diplomatic mission in Italy.",
    "Category": "Mission News"
  },
  {
    "Title": "Ambassador Majintha Jayesinghe presents Letters of Credence in Hungary",
    "Date": "24.02.2022",
    "Link": "https://mfa.gov.lk/en/ambassador-majintha-jayesinghe-presents-letters-of-credence-in-hungary/",
    "Summary": "Ambassador Majintha Jayesinghe presented the Letters of Credence to the President of Hungary, János Áder, at the Sándor Palace in Budapest, officially accrediting as the Ambassador Extraordinary and Plenipotentiary. This ceremony marks the formal beginning of Ambassador Jayesinghe's diplomatic mission in Hungary.",
    "Category": "Mission News"
  },
  {
    "Title": "Minister of Justice M U M Ali Sabry concludes successful official visit to Singapore",
    "Date": "24.02.2022",
    "Link": "https://mfa.gov.lk/en/minister-of-justice-m-u-m-ali-sabry-concludes-successful-official-visit-to-singapore/",
    "Summary": "Minister of Justice M.U.M. Ali Sabry successfully concluded an official visit to Singapore at the invitation of K. Shanmugam, Minister for Home Affairs and Minister for Law. The visit involved leading a high-level delegation from Sri Lanka.",
    "Category": "Mission News"
  },
  {
    "Title": "Evensong at the Westminster Abbey on the occasion of Sri Lanka’s Independence Day",
    "Date": "24.02.2022",
    "Link": "https://mfa.gov.lk/en/evensong-at-the-westminster-abbey-on-the-occasion-of-sri-lankas-independence-day/",
    "Summary": "An Evensong was held at Westminster Abbey on February 10, 2022, to mark the 74th Anniversary of Sri Lanka's Independence. The service was attended by the High Commissioner of Sri Lanka to the United Kingdom.",
    "Category": "Mission News"
  },
  {
    "Title": "High Commissioner Saroja Sirisena presents Letters of Credence to the President of Ireland",
    "Date": "22.02.2022",
    "Link": "https://mfa.gov.lk/en/high-commissioner-saroja-sirisena-presents-letters-of-credence-to-the-president-of-ireland/",
    "Summary": "High Commissioner Saroja Sirisena presented her Letters of Credence to President Michael D Higgins of Ireland on February 16, 2022, at a ceremonial event at the official residence Áras an Uachtaráin. This formal event marked the official beginning of her diplomatic mission in Ireland.",
    "Category": "Mission News"
  },
  {
    "Title": "Embassy of Sri Lanka Launches an Official TikTok Account for the Embassy",
    "Date": "22.02.2022",
    "Link": "https://mfa.gov.lk/en/embassy-of-sri-lanka-launches-an-official-tiktok-account-for-the-embassy/",
    "Summary": "The Embassy of Sri Lanka has launched an official TikTok account to mark the 65th anniversary of diplomatic relations and the 70th anniversary of the Rubber-Rice Pact. The initiative is in collaboration with CITS Overseas Economic Co., providing a new platform for engaging with audiences.",
    "Category": "Mission News"
  },
  {
    "Title": "Food Security in Southern African Countries: An Initiative by the Sri Lanka High Commission in Pretoria to Popularize Jackfruit Cultivation",
    "Date": "21.02.2022",
    "Link": "https://mfa.gov.lk/en/food-security-in-southern-african-countries-an-initiative-by-the-sri-lanka-high-commission-in-pretoria-to-popularize-jackfruit-cultivation/",
    "Summary": "The Sri Lanka High Commission in Pretoria has proposed a plan to promote jackfruit cultivation in Southern African countries to address food security issues. The initiative aims to showcase the benefits of growing jackfruit as a solution to hunger, with a concept paper submitted to UNICEF and FAO in South Africa.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka’s 74th Independence Day celebrated in the Philippines",
    "Date": "21.02.2022",
    "Link": "https://mfa.gov.lk/en/sri-lankas-74th-independence-day-celebrated-in-the-philippines/",
    "Summary": "The Embassy of Sri Lanka in Manila celebrated Sri Lanka's 74th Independence Day at the Official Residence with a solemn ceremony. The event began with the hoisting of the national flag and singing of the national anthem. Sri Lanka's Independence Day was commemorated in the Philippines with dignity and respect.",
    "Category": "Mission News"
  },
  {
    "Title": "Links Established between Turkish Aerospace and General Sir John Kotelawala Defense University of Sri Lanka",
    "Date": "21.02.2022",
    "Link": "https://mfa.gov.lk/en/links-established-between-turkish-aerospace-and-general-sir-john-kotelawala-defense-university-of-sri-lanka/",
    "Summary": "Turkish Aerospace and General Sir John Kotelawala Defense University of Sri Lanka established links through a productive virtual discussion. The Vice Chancellor of KDU, Maj. Gen Milinda Peiris, engaged with the President of the Turkish Aerospace Industry Academy. This collaboration aims to foster cooperation between the two institutions.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka Embassy gifts Books authored by Sri Lankan writers to the Abdul Hameed Shoman Public Library",
    "Date": "18.02.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-embassy-gifts-books-authored-by-sri-lankan-writers-to-the-abdul-hameed-shoman-public-library/",
    "Summary": "The Sri Lanka Embassy in Jordan gifted a collection of ninety-two Children’s Books authored by Sri Lankan writers to the Children’s section of the Abdul Hameed Shoman Public Library as part of their cultural diplomacy initiatives.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka High Commission in Malaysia celebrates the 74th anniversary of the Independence of Sri Lanka",
    "Date": "18.02.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-high-commission-in-malaysia-celebrates-the-74th-anniversary-of-the-independence-of-sri-lanka/",
    "Summary": "The Sri Lanka High Commission in Malaysia celebrated the 74th anniversary of Sri Lanka's Independence with a flag hoisting ceremony at the Chancery premises on February 4, 2022. The event was elegant and modest, marking the significant milestone in Sri Lanka's history.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka Embassy in Iran organizers a Sports Cooperation Event in Tehran",
    "Date": "18.02.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-embassy-in-iran-organizers-a-sports-cooperation-event-in-tehran/",
    "Summary": "The Sri Lanka Embassy in Tehran, in collaboration with the Tennis Federation of Iran, hosted a Sports Cooperation event at its Chancery premises on February 10, 2022. The event aimed to strengthen sports ties between Sri Lanka and Iran.",
    "Category": "Mission News"
  },
  {
    "Title": "Independence Day Celebrations in Singapore",
    "Date": "15.02.2022",
    "Link": "https://mfa.gov.lk/en/independence-day-celebrations-in-singapore/",
    "Summary": "The 74th anniversary of Sri Lanka's independence was celebrated in Singapore at the High Commission of Sri Lanka with the participation of staff. The event featured a simple ceremony to mark the occasion.",
    "Category": "Mission News"
  },
  {
    "Title": "74th Independance Day celebrations by the Sri Lanka Embassy of Abu Dhabi, UAE",
    "Date": "14.02.2022",
    "Link": "https://mfa.gov.lk/en/74th-independance-day-celebrations-by-the-sri-lanka-embassy-of-abu-dhabi-uae/",
    "Summary": "The Sri Lanka Embassy in Abu Dhabi celebrated the 74th Anniversary of Sri Lanka’s Independence with an official ceremony at the Chancery premises on February 4, 2022. The event followed health guidelines to ensure safety.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka and Belarus enhances bilateral cooperation",
    "Date": "14.02.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-and-belarus-enhances-bilateral-cooperation/",
    "Summary": "Sri Lanka's Ambassador to Russia, Prof. Janitha A. Liyanage, who is also accredited to Belarus, conducted several meetings with Belarusian authorities during her official visit from February 2-5, 2022. The discussions aimed to enhance bilateral cooperation between Sri Lanka and Belarus.",
    "Category": "Mission News"
  },
  {
    "Title": "High Commissioner Moragoda meets Finance Minister of India; Extends appreciation for support to Sri Lanka",
    "Date": "14.02.2022",
    "Link": "https://mfa.gov.lk/en/high-commissioner-moragoda-meets-finance-minister-of-india-extends-appreciation-for-support-to-sri-lanka/",
    "Summary": "High Commissioner of Sri Lanka to India, Milinda Moragoda, met with India's Finance and Corporate Affairs Minister, Smt. Nirmala Sitharaman, in New Delhi on February 11. During the meeting, High Commissioner Moragoda expressed appreciation for India's support to Sri Lanka.",
    "Category": "Mission News"
  },
  {
    "Title": "Commemorating the 74th Anniversary of Sri Lanka’s Independence, Ambassador Chaminda Colonne highlights Citizens’ National Responsibility to Work Together to Build their Motherland",
    "Date": "14.02.2022",
    "Link": "https://mfa.gov.lk/en/commemorating-the-74th-anniversary-of-sri-lankas-independence-ambassador-chaminda-colonne-highlights-citizens-national-responsibility-to-work-together-to-build-their-mothe/",
    "Summary": "Ambassador Chaminda Colonne, Sri Lanka's Ambassador to Thailand and Permanent Representative to UNESCAP, highlighted citizens' national responsibility to work together in commemorating the 74th Anniversary of Sri Lanka's Independence. The Ambassador, along with his spouse and Embassy staff, proudly celebrated the occasion.",
    "Category": "Mission News"
  },
  {
    "Title": "​Sri Lanka Embassy in Ethiopia Celebrates 74th Anniversary of Independence",
    "Date": "14.02.2022",
    "Link": "https://mfa.gov.lk/en/%e2%80%8bsri-lanka-embassy-in-ethiopia-celebrates-74th-anniversary-of-independence/",
    "Summary": "The Sri Lanka Embassy in Ethiopia celebrated the 74th anniversary of Sri Lanka's independence on February 4, 2022, with the participation of mission staff and their families at the Embassy premises. The event marked a significant milestone in honoring Sri Lanka's independence.",
    "Category": "Mission News"
  },
  {
    "Title": "World Growth Forum Magazine Selects Ambassador of Sri Lanka to Oman Ameer Ajwad as “Person of the Year 2021” for Diplomacy and Bilateral Relations",
    "Date": "14.02.2022",
    "Link": "https://mfa.gov.lk/en/world-growth-forum-magazine-selects-ambassador-of-sri-lanka-to-oman-ameer-ajwad-as-person-of-the-year-2021-for-diplomacy-and-bilateral-relations/",
    "Summary": "Ambassador Ameer Ajwad of Sri Lanka to Oman has been named \"Person of the Year 2021\" by World Growth Forum Magazine for his contributions to diplomacy and bilateral relations. The prestigious recognition highlights his significant achievements in fostering international cooperation.",
    "Category": "Mission News"
  },
  {
    "Title": "74th Anniversary of Independence Day Celebration 2022 Embassy of Sri Lanka in Paris, France",
    "Date": "12.02.2022",
    "Link": "https://mfa.gov.lk/en/74th-anniversary-of-independence-day-celebration-2022-embassy-of-sri-lanka-in-paris-france/",
    "Summary": "The Embassy of Sri Lanka in Paris celebrated the 74th Anniversary of Independence Day of the Democratic Socialist Republic of Sri Lanka with a ceremony at the Embassy premises. The event was attended by various dignitaries and officials.",
    "Category": "Mission News"
  },
  {
    "Title": "High Commissioner- designate of Sri Lanka to Malaysia presents the open copy of the letter of credentials",
    "Date": "11.02.2022",
    "Link": "https://mfa.gov.lk/en/high-commissioner-designate-of-sri-lanka-to-malaysia-presents-the-open-copy-of-the-letter-of-credentials/",
    "Summary": "On February 7, 2022, Sri Lanka's High Commissioner-designate to Malaysia, Air Chief Marshal Sumangala Dias, presented the open copy of his letter of credentials to Chief of Protocol Datuk Wan Zaidi Bin Ab. This formal exchange signifies the official recognition of his diplomatic role in Malaysia.",
    "Category": "Mission News"
  },
  {
    "Title": "74th Independence Day of Sri Lanka commemorated in Dhaka",
    "Date": "11.02.2022",
    "Link": "https://mfa.gov.lk/en/74th-independence-day-of-sri-lanka-commemorated-in-dhaka/",
    "Summary": "The 74th Independence Day of Sri Lanka was celebrated on February 4, 2022, at the Sri Lanka High Commission in Dhaka, Bangladesh, with the High Commissioner and Mission staff in attendance. The event marked a significant commemoration of Sri Lanka's independence.",
    "Category": "Mission News"
  },
  {
    "Title": "Ambassador Amza meets Secretary  General of GCC",
    "Date": "11.02.2022",
    "Link": "https://mfa.gov.lk/en/ambassador-amza-meets-secretary-general-of-gcc/",
    "Summary": "Ambassador of Sri Lanka to Saudi Arabia, P.M. Amza, met with the Secretary General of the Gulf Cooperation Council (GCC), Dr. Nayef Falah M. Al Hajraf, at the Council Headquarters in Riyadh on February 8, 2022. The meeting aimed to discuss bilateral relations and cooperation between Sri Lanka and the GCC.",
    "Category": "Mission News"
  },
  {
    "Title": "Ambassador Ameer Ajwad Plants Sri Lankan Fruit Sapling in Muscat to mark the 74th Independence Day of Sri Lanka",
    "Date": "11.02.2022",
    "Link": "https://mfa.gov.lk/en/ambassador-ameer-ajwad-plants-sri-lankan-fruit-sapling-in-muscat-to-mark-the-74th-independence-day-of-sri-lanka/",
    "Summary": "Ambassador Ameer Ajwad of Sri Lanka planted a \"wood apple fruit\" sapling in Muscat to celebrate Sri Lanka's 74th Independence Day. The sapling was planted at the Directorate General of Agricultural and Animal Research in Rumais, Barka.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka and Nepal continue collaborations in the construction sector",
    "Date": "10.02.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-and-nepal-continue-collaborations-in-the-construction-sector/",
    "Summary": "Sri Lanka Embassy in Nepal and the Export Development Board of Sri Lanka organized a virtual meeting for Sri Lankan Construction Companies to engage with the Nepal Ministry of Physical Infrastructure. The collaboration aims to strengthen ties and explore opportunities in the construction sector between the two countries.",
    "Category": "Mission News"
  },
  {
    "Title": "Ceremony to Mark the 74th Independence Day of Sri Lanka in Toronto",
    "Date": "10.02.2022",
    "Link": "https://mfa.gov.lk/en/ceremony-to-mark-the-74th-independence-day-of-sri-lanka-in-toronto/",
    "Summary": "The Consulate General of Sri Lanka in Toronto organized a small ceremony at the Consulate premises on 4 February, 2022, to mark the 74th Independence Day of Sri Lanka. The event was attended by staff members to commemorate the occasion.",
    "Category": "Mission News"
  },
  {
    "Title": "High Commissioner Navaratne invites Sri Lankan Canadians interested in Peace and Reconciliation for a dialogue on the occasion of 74th Independence Day of Sri Lanka",
    "Date": "09.02.2022",
    "Link": "https://mfa.gov.lk/en/high-commissioner-navaratne-invites-sri-lankan-canadians-interested-in-peace-and-reconciliation-for-a-dialogue-on-the-occasion-of-74th-independence-day-of-sri-lanka/",
    "Summary": "High Commissioner Navaratne of Sri Lanka invited Sri Lankan Canadians interested in Peace and Reconciliation for a dialogue on the 74th Independence Day of Sri Lanka. The celebration took place virtually in Ottawa, Canada on February 4, 2022, with the participation of the Diplomatic Corps, Sri Lankan expatriates, and staff.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka Deputy High Commission in Chennai Celebrates the 74th Independence Day of Sri Lanka",
    "Date": "09.02.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-deputy-high-commission-in-chennai-celebrates-the-74th-independence-day-of-sri-lanka/",
    "Summary": "The Sri Lanka Deputy High Commission in Chennai celebrated the 74th Independence Day of Sri Lanka on February 4, 2022, at the Chancery premises. The event took place amidst the ongoing pandemic situation in the region.",
    "Category": "Mission News"
  },
  {
    "Title": "The Embassy of Sri Lanka in Doha celebrates the 74th Anniversary of Independence of Sri Lanka",
    "Date": "09.02.2022",
    "Link": "https://mfa.gov.lk/en/the-embassy-of-sri-lanka-in-doha-celebrates-the-74th-anniversary-of-independence-of-sri-lanka/",
    "Summary": "The Embassy of Sri Lanka in Doha, Qatar celebrated the 74th Anniversary of Sri Lanka's Independence on February 4, 2022, with the participation of embassy staff at the embassy premises. The event marked a significant milestone in honoring Sri Lanka's independence.",
    "Category": "Mission News"
  },
  {
    "Title": "Ambassador–designate of Sri Lanka to Italy presents the open copy of the Letter of Credentials to the Foreign Ministry in Rome",
    "Date": "09.02.2022",
    "Link": "https://mfa.gov.lk/en/ambassador-designate-of-sri-lanka-to-italy-presents-the-open-copy-of-the-letter-of-credentials-to-the-foreign-ministry-in-rome/",
    "Summary": "Ambassador-designate of Sri Lanka to Italy, Jagath Wellawatte, presented the open copy of his Letter of Credentials to Chief of Protocol Ambassador Inigo Lambertini at the Foreign Ministry in Rome. This formalizes his appointment and marks the beginning of his diplomatic mission in Italy.",
    "Category": "Mission News"
  },
  {
    "Title": "Consulate General in Jeddah Celebrates the 74th Independence Day of Sri Lanka",
    "Date": "08.02.2022",
    "Link": "https://mfa.gov.lk/en/consulate-general-in-jeddah-celebrates-the-74th-independence-day-of-sri-lanka/",
    "Summary": "The Consulate General in Jeddah celebrated Sri Lanka's 74th Independence Day with a flag hoisting ceremony on February 4, 2022. The event was limited to the consulate staff.",
    "Category": "Mission News"
  },
  {
    "Title": "The Permanent Mission of Sri Lanka to the United Nations in New York celebrates the 74th Anniversary of Independence of Sri Lanka",
    "Date": "08.02.2022",
    "Link": "https://mfa.gov.lk/en/the-permanent-mission-of-sri-lanka-to-the-united-nations-in-new-york-celebrates-the-74th-anniversary-of-independence-of-sri-lanka/",
    "Summary": "The Permanent Mission of Sri Lanka to the United Nations in New York celebrated the 74th Anniversary of Sri Lanka's Independence virtually due to the COVID-19 pandemic. The event was held in New York City.",
    "Category": "Mission News"
  },
  {
    "Title": "Foreign Minister Prof. G.L. Peiris concludes successful visit to New Delhi",
    "Date": "08.02.2022",
    "Link": "https://mfa.gov.lk/en/fm-new-delhi/",
    "Summary": "Foreign Minister of Sri Lanka Prof. G.L. Peiris successfully concluded a two-day official visit to New Delhi on February 6-8, 2022. This visit marked his first trip to India since taking office.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka continues as Vice Chair of the Board of Trustees (BOT) of Asian Disaster Preparedness Centre (ADPC)",
    "Date": "07.02.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-continues-as-vice-chair-of-the-board-of-trustees-bot-of-asian-disaster-preparedness-centre-adpc/",
    "Summary": "Sri Lanka's Ambassador to Thailand, C. A. Chaminda I. Colonne, has been re-elected as Vice Chair of the Board of Trustees of the Asian Disaster Preparedness Centre (ADPC). This marks his continued role in overseeing disaster preparedness initiatives at the organization.",
    "Category": "Mission News"
  },
  {
    "Title": "​Refuting the allegation of “Tamil Genocide” in the final phase of the conflict in Sri Lanka",
    "Date": "07.02.2022",
    "Link": "https://mfa.gov.lk/en/tamil-genocide-sl/",
    "Summary": "The term genocide is used to describe one of the gravest crimes against humanity, involving specific acts committed with the intent to destroy a national, ethnical, racial, or religious group. Refuting the allegation of \"Tamil Genocide\" in the final phase of the conflict in Sri Lanka is crucial for addressing historical and political narratives accurately.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka assures enhanced partnership with the Asian Institute of Technology (AIT)",
    "Date": "04.02.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-assures-enhanced-partnership-with-the-asian-institute-of-technology-ait/",
    "Summary": "Sri Lanka's Ambassador to Thailand, C.A. Chaminda I. Colonne, has been elected as Co-Chairperson of the Student Relations Committee at the Asian Institute of Technology's Board of Trustees Meeting. This appointment signifies Sri Lanka's commitment to enhancing its partnership with AIT.",
    "Category": "Mission News"
  },
  {
    "Title": "​Appointment of High Commissioner of the Islamic Republic of Pakistan to Sri Lanka",
    "Date": "03.02.2022",
    "Link": "https://mfa.gov.lk/en/pakistan-sl/",
    "Summary": "The Government of Pakistan, with the approval of Sri Lanka, has named Maj. Gen. (Rtd) Umar Farooq Burki as the new High Commissioner of Pakistan to Sri Lanka.",
    "Category": "Mission News"
  },
  {
    "Title": "High Commissioner-designate of Sri Lanka to Malaysia assumes duties",
    "Date": "03.02.2022",
    "Link": "https://mfa.gov.lk/en/high-commissioner-designate-of-sri-lanka-to-malaysia-assumes-duties/",
    "Summary": "Air Chief Marshal Sumangala Dias, the newly appointed High Commissioner-designate of Sri Lanka to Malaysia, assumed duties at the Sri Lanka High Commission in Kuala Lumpur on 27 January 2022. He officially began his role at the High Commission, representing Sri Lanka in Malaysia.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka’s Envoy to Maldives presents credentials to President Solih",
    "Date": "03.02.2022",
    "Link": "https://mfa.gov.lk/en/sri-lankas-envoy-to-maldives-presents-credentials-to-president-solih/",
    "Summary": "Sri Lanka's High Commissioner-designate to Maldives, A.M.J. Sadiq, presented his credentials to Maldives President Ibrahim Mohamed Solih. He handed over his Letter of Credence and the Letter of Recall of his predecessor during the ceremony.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lankan State Minister of Batik, Handloom and Local Apparel Products Explores Opportunities in Russia",
    "Date": "02.02.2022",
    "Link": "https://mfa.gov.lk/en/sri-lankan-state-minister-of-batik-handloom-and-local-apparel-products-explores-opportunities-in-russia/",
    "Summary": "Sri Lankan State Minister of Batik, Handloom, and Local Apparel Products, along with a delegation led by Ambassador Prof. Janitha Abeywickrema Liyanage, recently explored business opportunities in Russia on January 24, 2022. The visit aimed to strengthen trade relations between the two countries in the textile and apparel sector.",
    "Category": "Mission News"
  },
  {
    "Title": "Embassy of Sri Lanka in Japan Organizes Live Sri Lankan Cuisine Competition for Japanese People",
    "Date": "02.02.2022",
    "Link": "https://mfa.gov.lk/en/embassy-of-sri-lanka-in-japan-organizes-live-sri-lankan-cuisine-competition-for-japanese-people/",
    "Summary": "The Embassy of Sri Lanka in Japan, along with two award-winning Sri Lankan chefs, hosted a Sri Lankan cuisine competition for the Japanese community. The event attracted over 140 applications and featured a live video broadcast. It aimed to promote Sri Lankan culinary culture among the Japanese audience.",
    "Category": "Mission News"
  },
  {
    "Title": "High Commissioner Moragoda stresses the importance of developing eight thrust areas to elevate Sri Lanka- India economic relations to a strategic level",
    "Date": "31.01.2022",
    "Link": "https://mfa.gov.lk/en/high-commissioner-moragoda-stresses-the-importance-of-developing-eight-thrust-areas-to-elevate-sri-lanka-india-economic-relations-to-a-strategic-level/",
    "Summary": "Sri Lanka's High Commissioner to India, Milinda Moragoda, emphasized the need to focus on eight key areas to enhance Sri Lanka-India economic relations to a strategic level. This shift aims to move the relationship beyond a transactional phase towards a more strategic partnership.",
    "Category": "Mission News"
  },
  {
    "Title": "Ambassador Ameer Ajwad meets the Minister of Agriculture, Fisheries and Water Resource of Oman",
    "Date": "31.01.2022",
    "Link": "https://mfa.gov.lk/en/ambassador-ameer-ajwad-meets-the-minister-of-agriculture-fisheries-and-water-resource-of-oman/",
    "Summary": "Ambassador Ameer Ajwad of Sri Lanka met with Dr. Saoud Hamood Ahmed Al Habsi, the Minister of Agriculture, Fisheries, and Water Resources of Oman, to discuss collaboration opportunities. They explored ways to enhance bilateral cooperation in these sectors during their meeting.",
    "Category": "Mission News"
  },
  {
    "Title": "High Commissioner – designate of Sri Lanka to Maldives presents the open copy of the letter of credentials to the Foreign Ministry in Malé",
    "Date": "29.01.2022",
    "Link": "https://mfa.gov.lk/en/high-commissioner-designate-of-sri-lanka-to-maldives-presents-the-open-copy-of-the-letter-of-credentials-to-the-foreign-ministry-in-male/",
    "Summary": "The High Commissioner-designate of Sri Lanka to Maldives, A.M.J. Sadiq, presented the open copy of his letter of credentials to the Foreign Ministry in Malé upon his arrival on January 25, 2022. He assumed duties at the High Commission of Sri Lanka in Malé on the same day following a simple ceremony attended by staff.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lankas Representative to Palestine meets with Minister of Health of the State of Palestine, Dr. Mai Al-Kailah",
    "Date": "28.01.2022",
    "Link": "https://mfa.gov.lk/en/sri-lankas-representative-to-palestine-meets-with-minister-of-health-of-the-state-of-palestine-dr-mai-al-kailah/",
    "Summary": "Sri Lanka's Representative to Palestine, Nawalage Bennet Cooray, met with the Minister of Health of the State of Palestine, Dr. Mai Al-Kailah, in Ramallah on January 20, 2022. They discussed the Covid-19 situations in both Sri Lanka and Palestine during the meeting.",
    "Category": "Mission News"
  },
  {
    "Title": "Ambassador Prof. Kshanika Hirimburegama presented Credentials to the President of the Portuguese Republic Marcelo Rebelo de Sousa",
    "Date": "27.01.2022",
    "Link": "https://mfa.gov.lk/en/ambassador-prof-kshanika-hirimburegama-presented-credentials-to-the-president-of-the-portuguese-republic-marcelo-rebelo-de-sousa/",
    "Summary": "Ambassador Prof. Kshanika Hirimburegama presented her credentials to the President of the Portuguese Republic, Marcelo Rebelo de Sousa, at a ceremony on January 17, 2022, at the Ajuda National Palace in Lisbon, Portugal. This formal event marked the official beginning of her diplomatic duties in Portugal.",
    "Category": "Mission News"
  },
  {
    "Title": "State Minister Tharaka Balasuriya, inaugurates the virtual B2B matchmaking session between Sri Lankan and Ukrainian business community",
    "Date": "27.01.2022",
    "Link": "https://mfa.gov.lk/en/state-minister-tharaka-balasuriya-inaugurates-the-virtual-b2b-matchmaking-session-between-sri-lankan-and-ukrainian-business-community/",
    "Summary": "State Minister of Regional Cooperation Tharaka Balasuriya inaugurated a virtual B2B matchmaking session between the Sri Lankan and Ukrainian business communities. The session was organized by the Ceylon Chamber of Commerce and the Ukrainian Chamber of Commerce.",
    "Category": "Mission News"
  },
  {
    "Title": "Thai Pongal celebrations at the High Commission of Sri Lanka in Singapore",
    "Date": "27.01.2022",
    "Link": "https://mfa.gov.lk/en/thai-pongal-celebrations-at-the-high-commission-of-sri-lanka-in-singapore/",
    "Summary": "The Thai Pongal festival was celebrated at the Sri Lanka High Commission in Singapore on Thursday, 20 January 2022. Representatives from the Singapore Ceylon Tamils Association and the Sri Senpa were in attendance. The event marked a joyous celebration of Thai Pongal at the High Commission premises.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lankans living in KSA donate medical equipments",
    "Date": "27.01.2022",
    "Link": "https://mfa.gov.lk/en/sri-lankans-living-in-ksa-donate-medical-equipments/",
    "Summary": "Sri Lankans living in KSA donated medical equipment to Sri Lanka through the coordination of the Embassy of Sri Lanka in Riyadh and with the support of Sri Lankan Airlines on January 20, 2022. The donated equipment was contributed by the Sri Lankan community living in KSA.",
    "Category": "Mission News"
  },
  {
    "Title": "Religious Observances held in Milan to Bestow Merit on The Late Consul General Visharada Neela Wickramasinghe",
    "Date": "24.01.2022",
    "Link": "https://mfa.gov.lk/en/religious-observances-in-milan-for-the-late-consul-general-visharada-neela-wickramasinghe/",
    "Summary": "Religious observances were conducted at the Casa Funeraria Funeral Home in Milan, Italy on Saturday, January 22, 2022, to honor the late Consul General Visharada Neela Wickramasinghe, who passed away in Italy. The event aimed to bestow merit on the late Consul General for his contributions and service.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lankan Sapphires Highlighted at the Sri Lanka Embassy in China",
    "Date": "24.01.2022",
    "Link": "https://mfa.gov.lk/en/sri-lankan-sapphires-highlighted-at-the-sri-lanka-embassy-in-china/",
    "Summary": "Sri Lankan gemstones, including blue sapphires, were featured at a prestigious event held at the Sri Lanka Embassy in Beijing on January 17, 2022. The showcase was sponsored by 'LARWINER - Gem Art Jewellery', highlighting the beauty of Sri Lankan sapphires to attendees.",
    "Category": "Mission News"
  },
  {
    "Title": "Ambassador Grace Asirwatham receives State and Government Sector Award at Top 50 Professional & Career Women Awards",
    "Date": "20.01.2022",
    "Link": "https://mfa.gov.lk/en/ambassador-grace-asirwatham-receives-state-and-government-sector-award-at-top-50-professional-career-women-awards/",
    "Summary": "Ambassador Grace Asirwatham received the 2021 State and Government Sector Award at the 11th Edition of the Top 50 Professional & Career Women Awards in Sri Lanka and the Maldives on January 18, 2022.",
    "Category": "Mission News"
  },
  {
    "Title": "Omani Business Fraternity invited to the Exhibition of Sri Lanka Export Brands at Dubai Expo in February 2022",
    "Date": "20.01.2022",
    "Link": "https://mfa.gov.lk/en/omani-business-fraternity-invited-to-the-exhibition-of-sri-lanka-export-brands-at-dubai-expo-in-february-2022/",
    "Summary": "The Omani business fraternity has been invited to the Exhibition of Sri Lanka Export Brands at Dubai Expo, taking place from 17 to 20 February 2022. The event aims to showcase Sri Lankan exports and foster business connections between the two countries.",
    "Category": "Mission News"
  },
  {
    "Title": "High Commissioner of Sri Lanka to the UK addresses the Conservative Foreign and Commonwealth Council",
    "Date": "20.01.2022",
    "Link": "https://mfa.gov.lk/en/high-commissioner-of-sri-lanka-to-the-uk-addresses-the-conservative-foreign-and-commonwealth-council/",
    "Summary": "Saroja Sirisena, the High Commissioner of Sri Lanka to the UK, spoke at the Conservative Foreign and Commonwealth Council at the Carlton Club on January 12, 2022. The theme of her address was 'Sri Lanka, the Commonwealth, and Global Britain.",
    "Category": "Mission News"
  },
  {
    "Title": "Collaboration and partnership in the ICT sector between Sri Lanka and Indonesia",
    "Date": "19.01.2022",
    "Link": "https://mfa.gov.lk/en/collaboration-and-partnership-in-the-ict-sector-between-sri-lanka-and-indonesia/",
    "Summary": "The Sri Lanka Embassy in Jakarta facilitated two interactive sessions on January 13, 2022, bringing together authorities from Sri Lanka and Indonesia to explore collaboration and partnerships in the ICT sector. The discussions aimed to strengthen ties and foster cooperation between the two countries in the field of information and communication technology.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka Mission in Tokyo celebrates “Thai Pongal” Festival",
    "Date": "19.01.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-mission-in-tokyo-celebrates-thai-pongal-festival/",
    "Summary": "The Sri Lanka Mission in Tokyo celebrated the \"Thai Pongal\" festival in a hybrid format in collaboration with the Sri Lanka Students Association in Japan on January 13, 2022, at the Mission premises. The event began with a short introduction and brought together attendees to mark the occasion.",
    "Category": "Mission News"
  },
  {
    "Title": "MICE Tourism in Sri Lanka promoted in Indonesia",
    "Date": "19.01.2022",
    "Link": "https://mfa.gov.lk/en/mice-tourism-in-sri-lanka-promoted-in-indonesia/",
    "Summary": "The Sri Lanka Embassy in Indonesia organized a virtual webinar on January 12, 2022, to promote Sri Lanka as a MICE destination. This initiative is part of the Economic Diplomacy efforts to boost MICE tourism in Sri Lanka.",
    "Category": "Mission News"
  },
  {
    "Title": "High Commissioner of Sri Lanka in the UK meets FCDO Minister of State for South and Central Asia, United Nations and the Commonwealth",
    "Date": "18.01.2022",
    "Link": "https://mfa.gov.lk/en/high-commissioner-of-sri-lanka-in-the-uk-meets-fcdo-minister-of-state-for-south-and-central-asia-united-nations-and-the-commonwealth/",
    "Summary": "Sri Lanka's High Commissioner in the UK, Saroja Sirisena, met with the Minister of State for South and Central Asia, United Nations, and the Commonwealth, Lord Ahmad of Wimbledon, at the Foreign, Commonwealth and Development Office. The meeting aimed to discuss matters concerning the regions and organizations they represent.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka Deputy High Commission in Chennai Celebrates Thai Pongal",
    "Date": "18.01.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-deputy-high-commission-in-chennai-celebrates-thai-pongal/",
    "Summary": "The Sri Lanka Deputy High Commission in Chennai celebrated Thai Pongal, a four-day festival that expresses gratitude to the Sun, nature, and farm animals for a bountiful harvest. This annual festival takes place in January to coincide with the harvest season.",
    "Category": "Mission News"
  },
  {
    "Title": "Meeting between Prof. Kshanika Hirimburegama & Khondker M.Talha, Ambassador of Bangladesh & Permanent Delegate to UNESCO",
    "Date": "14.01.2022",
    "Link": "https://mfa.gov.lk/en/meeting-between-prof-kshanika-hirimburegama-khondker-m-talha-ambassador-of-bangladesh-permanent-delegate-to-unesco/",
    "Summary": "Prof. Kshanika Hirimburegama met with Khondker M. Talha, the Ambassador of Bangladesh and Permanent Delegate to UNESCO, on December 22, 2021, at the Sri Lanka Embassy in Paris. The meeting aimed to discuss collaboration and mutual interests between the two parties.",
    "Category": "Mission News"
  },
  {
    "Title": "​Sri Lankan products and tourism booth draws interest at Dashihui Summit Forum of International Business Cooperation and Public Welfare",
    "Date": "14.01.2022",
    "Link": "https://mfa.gov.lk/en/%e2%80%8bsri-lankan-products-and-tourism-booth-draws-interest-at-dashihui-summit-forum-of-international-business-cooperation-and-public-welfare/",
    "Summary": "The Consulate General of Sri Lanka in Guangzhou showcased Sri Lankan food products, tea, handicrafts, and tourism at the Dashihui Summit Forum of International Business Cooperation and Public Welfare. The booth attracted significant interest from attendees, highlighting the appeal of Sri Lankan offerings in the global market.",
    "Category": "Mission News"
  },
  {
    "Title": "The grand celebrations of ‘EXPO National Day of Sri Lanka’ at EXPO 2020, Dubai",
    "Date": "11.01.2022",
    "Link": "https://mfa.gov.lk/en/the-grand-celebrations-of-expo-national-day-of-sri-lanka-at-expo-2020-dubai/",
    "Summary": "The grand celebrations of the 'EXPO National Day of Sri Lanka' took place on 3 January 2022 at Al Wasl Plaza during EXPO 2020 in Dubai. The event was attended by a delegation led by Sri Lanka's Foreign Minister, Prof. G.L. Peiris.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka Ambassador in Thailand invokes blessings at the beginning of 2022",
    "Date": "10.01.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-ambassador-in-thailand-invokes-blessings-at-the-beginning-of-2022/",
    "Summary": "Sri Lanka's Ambassador in Thailand, C.A. Chaminda I. Colonne, along with his spouse, conducted an almsgiving ceremony to invoke blessings at the start of 2022 before beginning their official duties.",
    "Category": "Mission News"
  },
  {
    "Title": "The Embassy of Sri Lanka in Beijing Commenced Work for 2022 with a Simple Ceremony",
    "Date": "06.01.2022",
    "Link": "https://mfa.gov.lk/en/the-embassy-of-sri-lanka-in-beijing-commenced-work-for-2022-with-a-simple-ceremony/",
    "Summary": "The Embassy of Sri Lanka in Beijing started work for 2022 with a simple ceremony attended by all staff members. Ambassador Dr. Palitha Kohona highlighted the Mission's achievements in 2021, including securing 26 million vaccine doses.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka Embassy in Oman Commences work for the Year 2022 by taking Public Servants’ Oath",
    "Date": "05.01.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-embassy-in-oman-commences-work-for-the-year-2022-by-taking-public-servants-oath/",
    "Summary": "The staff of the Sri Lanka Embassy in Oman started their work for 2022 by taking the oath of allegiance to the public service at a ceremony on January 2, 2022. The ceremony marked the beginning of their official duties for the year.",
    "Category": "Mission News"
  },
  {
    "Title": "Embassy and Permanent Mission of Sri Lanka in Vienna commenced work for 2022",
    "Date": "05.01.2022",
    "Link": "https://mfa.gov.lk/en/embassy-and-permanent-mission-of-sri-lanka-in-vienna-commenced-work-for-2022/",
    "Summary": "The Embassy and Permanent Mission of Sri Lanka in Vienna started its operations for 2022 with a ceremony at the Embassy premises. The event included hoisting the National Flag and singing the national anthem. The mission is now fully operational for the year ahead.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka’s first ever coco peat export to Kenya launched",
    "Date": "05.01.2022",
    "Link": "https://mfa.gov.lk/en/sri-lankas-first-ever-coco-peat-export-to-kenya-launched/",
    "Summary": "Sri Lanka has launched its first-ever coco peat export to Kenya, boosting economic activities between the two countries. The initiative gained momentum during the visit of Sri Lankan ministers of Youth and Sports, Development Co-ordination, and Moni.",
    "Category": "Mission News"
  },
  {
    "Title": "Ceremonial Commencement of Work for the New Year 2022- Consulate General of Sri Lanka – Jeddah, Saudi Arabia",
    "Date": "04.01.2022",
    "Link": "https://mfa.gov.lk/en/ceremonial-commencement-of-work-for-the-new-year-2022-consulate-general-of-sri-lanka-jeddah-saudi-arabia/",
    "Summary": "The Consulate General of Sri Lanka in Jeddah, Saudi Arabia marked the ceremonial commencement of work for the New Year 2022 with the hoisting of the National Flag and singing of the National Anthem by Acting Consul General T.F.M. Aashiq and staff. The event also included a two-minute silence to honor the occasion.",
    "Category": "Mission News"
  },
  {
    "Title": "The Embassy of Sri Lanka in Paris celebrated the first working day of the 2022 New Year",
    "Date": "04.01.2022",
    "Link": "https://mfa.gov.lk/en/the-embassy-of-sri-lanka-in-paris-celebrated-the-first-working-day-of-the-2022-new-year/",
    "Summary": "The Embassy of Sri Lanka in Paris celebrated the first working day of the 2022 New Year with a ceremony at 9:00 am, attended by the Ambassador, Diplomats, and Embassy staff following French health guidelines. The event marked the commencement of the new year activities at the Embassy.",
    "Category": "Mission News"
  },
  {
    "Title": "State Minister Tharaka Balasuriya participates at Sri Lanka – Oman Hockey Tournament organized to mark the 40th Anniversary of Diplomatic Relations",
    "Date": "04.01.2022",
    "Link": "https://mfa.gov.lk/en/state-minister-tharaka-balasuriya-participates-at-sri-lanka-oman-hockey-tournament-organized-to-mark-the-40th-anniversary-of-diplomatic-relations/",
    "Summary": "State Minister of Regional Cooperation of Sri Lanka, Tharaka Balasuriya, participated as the guest of honour at the presentation ceremony of the first-ever Sri Lanka-Oman Club Level Hockey Tournament. The event was organized to mark the 40th Anniversary of Diplomatic Relations between the two countries.",
    "Category": "Mission News"
  },
  {
    "Title": "Sri Lanka Embassy in Ankara Celebrates Christmas and New Year with Children with Special needs",
    "Date": "03.01.2022",
    "Link": "https://mfa.gov.lk/en/sri-lanka-embassy-in-ankara-celebrates-christmas-and-new-year-with-children-with-special-needs/",
    "Summary": "The Sri Lanka Embassy in Ankara celebrated Christmas and New Year with children at the \"Autism Foundation School\" in Incek on December 29, 2021. Ambassador M. Rizvi Hassen, along with family and Embassy staff, visited the school for the occasion, spreading joy and festive cheer.",
    "Category": "Mission News"
  },
  {
    "Title": "​Honorary Consuls of Sri Lanka and Sri Lankans living in Ankara donated medical equipment to support GOSL effort",
    "Date": "03.01.2022",
    "Link": "https://mfa.gov.lk/en/%e2%80%8bhonorary-consuls-of-sri-lanka-and-sri-lankans-living-in-ankara-donated-medical-equipment-to-support-gosl-effort/",
    "Summary": "Sri Lankans living in Turkey and Honorary Consuls from various cities donated medical equipment to support the Sri Lankan government's efforts in combating Covid-19. The equipment will be used in government hospitals in Sri Lanka.",
    "Category": "Mission News"
  },
  {
    "Title": "Leading Chinese Tour Operators and Agencies will target the Sri Lanka Market when Travel Restrictions are relaxed",
    "Date": "03.01.2022",
    "Link": "https://mfa.gov.lk/en/leading-chinese-tour-operators-and-agencies-will-target-the-sri-lanka-market-when-travel-restrictions-are-relaxed/",
    "Summary": "Leading Chinese tour operators and agencies are set to target the Sri Lanka market once travel restrictions are eased. The Embassy of Sri Lanka in Beijing, along with Sri Lankan Airlines, recently hosted a town hall meeting with 60 invited guests, including tour operators. This initiative aims to strengthen tourism ties between China and Sri Lanka.",
    "Category": "Mission News"
  }
]